{"text":"1. The review should have more critical comments, and give a fair account of both the advantages and disadvantages of the presented separations. Critical accounts should also be discussed (Current Opinion in Chemical Engineering 2011, 1, 77-83).","array_agg":["145, 162, CONTENT","26, 48, CONTENT","178, 187, ACTION","14, 20, MODAL","163, 169, MODAL","82, 143, CONTENT","7, 13, LOCATION","189, 243, CONTENT","54, 58, ACTION","21, 25, ACTION"]}
{"text":"2. Bulk referencing should be avoided , e.g. [2-5], [14-23] etc. A review article is not the same as a compilation of literature. When multiple references are grouped together, it is difficult for the readers to digest the message and find the information they need.","array_agg":["30, 37, ACTION","20, 26, MODAL","3, 19, CONTENT","45, 59, CONTENT"]}
{"text":"3. The authors should introduce MOF membranes from a broader perspective and mention their versatility in different separations and give examples such as oil/water separation (ACS Appl. Mater. Interfaces, 2018, 10, 17301-17308; J. Membr. Sci., 2018, 566, 268-277), organic solvent nanofiltration (J. Mater. Chem. A, 2014, 2, 9260-9271; J. Membr. Sci., 2016, 503, 166-176), xylene isomer separation (Inorganic Chemistry Communications, 2013, 30, 74-78), switchable separations (Nature Comm. 2018, 9, 3968).","array_agg":["154, 504, CONTENT","132, 136, ACTION","85, 127, CONTENT","77, 84, ACTION","22, 31, ACTION","15, 21, MODAL","32, 45, CONTENT"]}
{"text":"4. A novel figure should be added  that compares the different ZIF membrane fabrication methodologies.","array_agg":["18, 24, MODAL","28, 33, ACTION","3, 17, CONTENT","49, 101, CONTENT"]}
{"text":"5. A novel table should be added that compares the hydrocarbon separation performance of the ZIF membranes discussed  in the review.","array_agg":["125, 131, LOCATION","17, 23, MODAL","3, 16, CONTENT","27, 32, ACTION","47, 106, CONTENT"]}
{"text":"6. Avoid using the ambiguous x/y formatting for units, and follow the IUPAC recommendation which is x y^-1 throughout the manuscript, including figures and text.","array_agg":["59, 65, ACTION","100, 106, CONTENT","29, 53, CONTENT","3, 8, ACTION","66, 90, CONTENT","122, 132, LOCATION","144, 151, LOCATION","156, 160, LOCATION"]}
{"text":"7. In the review the authors should mention the use of software-assisted experimental design of membranes and membrane systems to encourage their use, which does not require extensive theoretical knowledge of the field and can be easily employed  by industrial professionals as well; and give some recent filtration examples from the membrane literature using design of experiments (DoE) optimization approach: ACS Catal., 2018, 8, 7430-7438; J. Membr. Sci., 2015, 493, 568-579. This will help to broaden the scope of the review.","array_agg":["288, 292, ACTION","44, 126, CONTENT","298, 477, CONTENT","10, 16, LOCATION","29, 35, MODAL","36, 43, ACTION","522, 528, LOCATION"]}
{"text":"8. An elaborate discussion on the stability and limited number of studies should be given in the review.","array_agg":["30, 73, CONTENT","74, 80, MODAL","83, 89, ACTION","97, 103, LOCATION"]}
{"text":"9. The recent https://doi.org/10.1002/ange.201708924 article presents a new approach for the fabrication of ZIF membranes for propylene/propane separation, which should be mentioned  in the review.","array_agg":["3, 60, CONTENT","190, 196, LOCATION","162, 168, MODAL","72, 154, CONTENT","172, 181, ACTION"]}
{"text":"10. The“Adsorption (2018) 24:691” article should be acknowledged , it discussed the same material and separation but from a different approach. Similarly,“Chem. Mater., 2018, 30 (2), 447-455” also discussed the same material for a novel application, which should be briefly incorporated  into the introduction about the target materials.","array_agg":["52, 64, ACTION","42, 48, MODAL","4, 41, CONTENT","154, 191, CONTENT","256, 262, MODAL","274, 286, ACTION","297, 309, LOCATION"]}
{"text":"The manuscript entitled „Prognostic value of small bowel mucosal villous atrophy at diagnosis in Dermatitis herpetiformis” presents an important issue, but the study requires some revisions.","array_agg":["152, 155, TRIGGER","24, 122, LOCATION","4, 14, LOCATION"]}
{"text":"The main problem is associated with the fact, that Authors applied the tools, that were either not validated at all (their own questionnaire), or were validated, but in a different groups (GSRS validated for groups of IBS patients and pelvic ulcer patients). Without the validation conducted in the properly chosen group, it can not be stated , that the results obtained using the form allow to conclude. This problem is especially important, if the data obtained using the forms are the main data in the study.","array_agg":["143, 145, TRIGGER","162, 165, TRIGGER"]}
{"text":"Authors should precisely present the scope of their study in the title – currently the title does not present the same scope, as presented in the aim of the study. It should be corrected .","array_agg":["65, 70, LOCATION","25, 32, ACTION","33, 57, CONTENT","8, 14, MODAL","146, 162, LOCATION","177, 186, ACTION","167, 173, MODAL","87, 92, LOCATION"]}
{"text":"The excessive information from the introduction is not needed – Authors should rather present more results of their study.","array_agg":["86, 93, ACTION","0, 25, CONTENT","51, 61, ACTION","35, 47, LOCATION","94, 121, CONTENT","72, 78, MODAL"]}
{"text":"The“prognostic value” may be also misleading  for readers.","array_agg":["34, 44, ACTION","22, 25, MODAL","0, 21, CONTENT"]}
{"text":"In this section Authors should precisely specify the background of their study – why did they suppose, that between compared groups may be a difference?","array_agg":["24, 30, MODAL","81, 84, TRIGGER","8, 15, LOCATION","49, 78, CONTENT","85, 151, CONTENT","41, 48, ACTION"]}
{"text":"Authors should also precisely formulate the aim, that should correspond the title (as indicated above).","array_agg":["54, 60, MODAL","40, 47, CONTENT","30, 39, ACTION","8, 14, MODAL","76, 81, LOCATION"]}
{"text":"Authors should specify what is the policy in their country of using  the medical record data of patients who did not express their informed consent – they analysed not only the data of patients who expressed their informed consent (2nd stage) but also of patients who did not (1st stage). In some countries it is allowed and in other countries it is not. If all the patients while being in the hospital allow to use their medical record data in the analysis – it should be specified .","array_agg":["31, 147, CONTENT","8, 14, MODAL","15, 22, ACTION","243, 246, TRIGGER","463, 469, MODAL","473, 482, ACTION","358, 457, CONTENT","355, 357, TRIGGER"]}
{"text":"It should be specified  in what share of individuals, the GFD was applied before the diagnosis and the share should be compared  between sub-groups.","array_agg":["13, 22, ACTION","24, 94, CONTENT","3, 9, MODAL","109, 115, MODAL","119, 127, ACTION","99, 108, CONTENT","129, 147, CONTENT"]}
{"text":"Lines 87-95 – it should be defined what was the grading procedure. Such procedure (depending on the factor) may be highly subjective, so the general rules that were applied must be presented . Moreover, it should be indicated how many persons conducted grading and if each grading was conducted  by only one physician or independently by two of them.","array_agg":["226, 349, CONTENT","44, 65, CONTENT","17, 23, MODAL","27, 34, ACTION","181, 190, ACTION","206, 212, MODAL","216, 225, ACTION","0, 11, LOCATION","137, 154, CONTENT","173, 177, MODAL"]}
{"text":"The number of the bioethical commission agreement (or the date) should be indicated .","array_agg":["74, 83, ACTION","54, 62, CONTENT","51, 53, TRIGGER","0, 49, CONTENT","64, 70, MODAL"]}
{"text":"It should be specified if the applied  disease-specific questionnaire was validated. If it was – it should be indicted what were the results of the validation. The assessment of the reproducibility of the data may be crucial for the new form.","array_agg":["100, 106, MODAL","39, 69, CONTENT","85, 87, TRIGGER","129, 158, CONTENT","110, 118, ACTION","13, 22, ACTION","3, 9, MODAL"]}
{"text":"Moreover, the new form (not published previously) should be presented  – either in the main body of the article, or as a supplementary material.","array_agg":["87, 96, LOCATION","104, 111, LOCATION","121, 143, LOCATION","10, 49, CONTENT","50, 56, MODAL","60, 69, ACTION"]}
{"text":"The GSRS questionnaire in the indicated reference was validated for groups of IBS patients and pelvic ulcer patients, but not for coeliac disease ones. If Authors have the data from the validation conducted for coeliac disease ones – they should present it. If they do not have – they should indicate it as an important limitation of the study.","array_agg":["118, 121, TRIGGER","239, 245, MODAL","246, 253, ACTION","168, 231, CONTENT","285, 291, MODAL","163, 167, ACTION","310, 343, CONTENT","292, 300, ACTION","152, 154, TRIGGER","258, 260, TRIGGER","39, 49, LOCATION"]}
{"text":"It should be specified what method was applied  to verify the normality of distribution.","array_agg":["28, 34, CONTENT","58, 87, CONTENT","13, 22, ACTION","3, 9, MODAL"]}
{"text":"Lines 149-150 – rather a disease duration, than year of diagnosis should be presented","array_agg":["48, 65, CONTENT","0, 13, LOCATION","23, 41, CONTENT","66, 72, MODAL","76, 85, ACTION"]}
{"text":"Line 160 – p=0.097 may be treated  as a“close to significance”, but if so, the p<0.1 should be defined  as close to significance in a statistical analysis methods section","array_agg":["11, 18, LOCATION","64, 67, TRIGGER","85, 91, MODAL","134, 170, LOCATION","107, 128, CONTENT","39, 62, LOCATION","79, 84, CONTENT","95, 102, ACTION","0, 8, LOCATION"]}
{"text":"Tables – the p-Values should be presented in tables for conducted  comparisons","array_agg":["32, 41, ACTION","9, 21, CONTENT","45, 51, LOCATION","0, 6, LOCATION","22, 28, MODAL"]}
{"text":"Figure 1 – should be rather presented  as a table, as not all categories may be read in the current form","array_agg":["11, 17, MODAL","0, 8, LOCATION","44, 49, CONTENT","28, 37, ACTION"]}
{"text":"Line 215 – p=0.05 should be specified  – the p=0.049 and p=0.051 are from various categories of p-Value, so especially in this case Authors should precisely present the obtained value","array_agg":["0, 8, LOCATION","165, 183, CONTENT","11, 17, CONTENT","18, 24, MODAL","28, 37, ACTION","45, 52, LOCATION","57, 64, LOCATION","140, 146, MODAL","157, 164, ACTION"]}
{"text":"Paragraph 3.2. – the results presented previously in tables and in the text while tables are being presented, should not be reproduced  once again","array_agg":["75, 81, TRIGGER","0, 14, LOCATION","53, 59, LOCATION","71, 75, LOCATION","110, 116, MODAL","117, 134, ACTION","17, 28, CONTENT","82, 88, LOCATION"]}
{"text":"Authors should not reproduce the results in the Discussion section.","array_agg":["29, 40, CONTENT","48, 66, LOCATION","8, 18, MODAL","19, 28, ACTION"]}
{"text":"The possible physiological explanation of the observed differences should be presented  – Authors should try to indicate what is the reason of the observed differences.","array_agg":["0, 66, CONTENT","98, 104, MODAL","129, 167, CONTENT","112, 120, ACTION","67, 73, MODAL","77, 86, ACTION"]}
{"text":"Authors should broaden the limitations sub-section and add also other limitations – e.g. associated with the applied questionnaires, fact that patients are from the same hospital (same region?), etc.","array_agg":["27, 50, LOCATION","64, 81, CONTENT","55, 58, ACTION","15, 22, ACTION","8, 14, MODAL","105, 193, CONTENT"]}
{"text":"The information, that“All authors contributed substantially to the reported work.” is not needed.","array_agg":["86, 96, ACTION","21, 82, LOCATION"]}
{"text":"Authors included a number of old and very old references (older than 2000) – over 42% of included references. The redundant old references should be removed , while the new ones should be included , if possible.","array_agg":["149, 156, ACTION","165, 177, CONTENT","139, 145, MODAL","110, 138, CONTENT","188, 196, ACTION","178, 184, MODAL"]}
{"text":"The manuscript by Chae and co-workers discusses the isolation and formulation of 1D niobium selenide crystals. The topic is of interest to a broad audience, however the potential impact needs to be emphasized. The manuscript reads well, and the conclusions are supported by experimental evidence. The work lacks of critical evaluation. Overall, it is worth publishing in nanomaterials after addressing the following comments.","array_agg":["198, 208, ACTION","186, 191, MODAL","157, 164, TRIGGER","4, 14, LOCATION","165, 185, CONTENT","214, 225, LOCATION","391, 401, ACTION","402, 424, CONTENT"]}
{"text":"1. The potential impact and use of the research outcomes should be clearly stated  in the manuscript, and briefly implied in the abstract and conclusion sections.","array_agg":["75, 81, ACTION","57, 63, MODAL","3, 56, CONTENT","142, 161, LOCATION","129, 137, LOCATION","114, 121, ACTION","90, 100, LOCATION"]}
{"text":"2. The authors claim that niobium selenide is a“new type of” material. However, it has been studied for a long time with publications from the 70s and 80s.","array_agg":["71, 78, TRIGGER"]}
{"text":"3. Avoid grouping references, e.g. [1-5], [6-10], [11-23], instead discuss them individually if they are relevant for the manuscript, or if the statement is general then a single book chapter or review article should be cited .","array_agg":["42, 48, LOCATION","35, 40, LOCATION","18, 28, CONTENT","3, 8, ACTION","50, 57, LOCATION","170, 209, CONTENT","219, 225, ACTION","210, 216, MODAL"]}
{"text":"4. Avoid the x/y format for units, and use the x y^-1 format instead, as per the IUPA recommendation (both in the text and on the figures).","array_agg":["47, 60, CONTENT","130, 137, LOCATION","114, 118, LOCATION","39, 42, ACTION","77, 100, CONTENT","3, 8, ACTION","13, 33, CONTENT"]}
{"text":"5. The authors should comment on the reproducibility of their methods, and preferably provide some quantitative data to demonstrate the robustness of their method. Currently there are no standard deviations or any mention of repeats and their goodness.","array_agg":["22, 30, ACTION","86, 93, ACTION","99, 162, CONTENT","180, 186, ACTION","187, 206, CONTENT","214, 251, CONTENT","15, 21, MODAL","33, 69, CONTENT"]}
{"text":"6. Works on solvent selection for dispersion should be briefly introduced  in the manuscript: Compos. Sci. Technol., 2005, 65, 719-725; J. Am. Ceram. Soc., 2000, 83, 1681-1686.","array_agg":["45, 51, MODAL","3, 44, CONTENT","63, 73, ACTION","94, 175, CONTENT","82, 92, LOCATION"]}
{"text":"7. The rationale behind the selection of the solvents should be mentioned . Were they randomly selected? In such an extensive study, the authors could have considered including  some green solvents, especially from the class of alcohols, which seem to work the best based on the results. The authors should refer to book chapter 3.15, Organic Solvents in Sustainable Synthesis and Engineering, Green Chemistry – An Inclusive Approach, 2018, 513-553 (Elsevier) as a guideline for solvent selection.","array_agg":["479, 496, CONTENT","3, 53, CONTENT","54, 60, MODAL","64, 73, ACTION","76, 80, TRIGGER","81, 103, CONTENT","145, 155, MODAL","167, 176, ACTION","183, 197, CONTENT","210, 236, CONTENT","279, 286, LOCATION","300, 306, MODAL","307, 312, ACTION","316, 459, CONTENT"]}
{"text":"8. The chemical structures in Table 1 should be redrawn to have the same size.","array_agg":["48, 55, ACTION","68, 77, CONTENT","3, 26, CONTENT","30, 37, LOCATION","38, 44, MODAL"]}
{"text":"9. Avoid exaggeration and vague expressions throughout the text, e.g.“very important” should be simply“important”.","array_agg":["3, 8, ACTION","59, 63, LOCATION","102, 113, CONTENT","86, 92, MODAL","69, 85, LOCATION","9, 43, CONTENT"]}
{"text":"10. The work used 16 conventional solvents and many of them are undesirable for toxicity and environmental reasons. The authors should mention in a sentence that solvent consumption should be minimized  in order to increase the sustainability of the process via sustainable membrane-based recovery (ACS Catal., 2018, 8, 7430–7438; ACS Sustainable Chem. Eng., 2014, 2, 2371–2379).","array_agg":["162, 378, CONTENT","128, 134, MODAL","135, 142, ACTION","148, 156, LOCATION"]}
{"text":"11. The conclusion section is too brief. It should summarize the main research findings, and preferably it should include some quantitative statements. The drawbacks and limitations of the method should be also mentioned  to add a critical edge.","array_agg":["107, 113, MODAL","211, 220, ACTION","196, 202, MODAL","152, 195, CONTENT","127, 150, CONTENT","114, 121, ACTION","27, 39, ACTION","61, 87, CONTENT","51, 60, ACTION","44, 50, MODAL","8, 26, LOCATION"]}
{"text":"The manuscript entitled“Stabilization of Vitamin D in Pea Protein Isolate Nanoemulsions Increases its bioefficacy in Rats” presents interesting issue, but some important corrections are necessary.","array_agg":["23, 122, LOCATION","151, 154, TRIGGER","160, 181, CONTENT","182, 195, ACTION","4, 14, LOCATION"]}
{"text":"The manuscript should be prepared  according to the instructions for Authors and some aspects must be corrected  – e.g. Abstract “The abstract should be a single paragraph and should follow the style of structured  abstracts, but without headings”), references (doubled numbering should be removed ), etc.","array_agg":["15, 21, MODAL","25, 33, ACTION","81, 93, CONTENT","94, 98, MODAL","102, 111, ACTION","120, 128, LOCATION","129, 247, CONTENT","250, 260, LOCATION","262, 297, CONTENT","4, 14, LOCATION"]}
{"text":"“Control sufficient group” – the other description of group is needed, as a word“sufficient” does not present properly the characteristics – they were rather with no vitamin D deficiency, not“sufficient”.","array_agg":["93, 109, ACTION","0, 26, LOCATION","32, 59, CONTENT","63, 69, ACTION","158, 186, CONTENT","191, 203, LOCATION"]}
{"text":"The treatment should be briefly defined  for groups: Nano+VitD, Oil+VitD, Nano-VitD, Oil-VitD – especially if for Nano-VitD, Oil-VitD, the“minus” sigh looks like“hyphen” sigh, so Authors should think about changing  the names to obtain better readability","array_agg":["216, 225, CONTENT","206, 214, ACTION","187, 193, MODAL","125, 133, LOCATION","0, 13, CONTENT","53, 62, LOCATION","64, 72, LOCATION","114, 123, LOCATION","161, 174, CONTENT","32, 39, ACTION","14, 20, MODAL","85, 93, LOCATION","74, 83, LOCATION","138, 150, CONTENT"]}
{"text":"Authors should correct the wording  – e.g. they should not indicate that “vitamin D deficient rats […] recovered from VitD deficiency […] compared to the sufficient control”, as they may have either “recovered from VitD deficiency […] compared to the baseline results” or “be characterised by higher VitD level […] compared to the sufficient control” – it should be corrected  accordingly in the whole manuscript","array_agg":["8, 14, MODAL","15, 22, ACTION","23, 34, CONTENT","402, 412, LOCATION","366, 375, ACTION","356, 362, MODAL","272, 350, CONTENT","199, 268, CONTENT","73, 173, LOCATION","55, 67, ACTION","48, 54, MODAL"]}
{"text":"Background – Authors should properly justify the study – not only present the aim, but aim accompanied by proper justification","array_agg":["83, 86, TRIGGER","87, 126, CONTENT","0, 10, LOCATION","21, 27, MODAL","37, 44, ACTION","45, 54, CONTENT"]}
{"text":"The vitamin D content in the diets should be presented and the intake should be compared  between groups.","array_agg":["59, 69, CONTENT","35, 41, MODAL","45, 54, ACTION","70, 76, MODAL","80, 88, ACTION","90, 104, CONTENT","22, 34, LOCATION","0, 21, CONTENT"]}
{"text":"Lines 35-43 – Authors present a number of basic or even trivial information that are well known for the readers of the Nutrients journal – such information must be reduced","array_agg":["139, 155, CONTENT","156, 160, MODAL","0, 11, LOCATION","164, 171, ACTION","30, 95, CONTENT"]}
{"text":"The section must be more consistent with the conducted  study – Authors assessed the model of young rats – rather the model of rickets than osteomalacia, so more information about rickets is needed and not about osteomalacia","array_agg":["157, 187, CONTENT","191, 197, ACTION","12, 16, MODAL","41, 61, CONTENT","17, 35, ACTION","4, 11, LOCATION"]}
{"text":"Authors must briefly introduce the aim of the study – it is not known what model is analysed – the model of fortified food products (if so, Authors did not present the influence of nutrients present in the fortified products that may interact) or the model of supplementation (if so, why the Introduction section presents the issue of food fortification).","array_agg":["95, 131, CONTENT","247, 275, CONTENT","244, 246, TRIGGER","133, 135, TRIGGER","152, 163, ACTION","164, 242, CONTENT","277, 279, TRIGGER","292, 312, LOCATION","313, 321, ACTION","322, 353, CONTENT","8, 12, MODAL","21, 30, ACTION","31, 51, CONTENT","60, 69, ACTION","70, 92, CONTENT"]}
{"text":"The rest of the section should be corrected  accordingly – e.g. if the model of food fortification is analysed – what products are in general fortified, what amount of vitamin D is added, what is the share of fortified products in vitamin D supply, etc.","array_agg":["34, 43, ACTION","113, 253, CONTENT","67, 110, CONTENT","64, 66, TRIGGER","24, 30, MODAL","4, 23, LOCATION"]}
{"text":"Lines 105-107 – The specific number of ethics committee agreement should be presented  (referred), as on the basis of the presented info it is not explicit, that the research obtained the agreement to be conducted “Research principles and ethical guidelines of the KSU-CAMS Research Ethics Committee were strictly observed for all experiments using animals”).","array_agg":["214, 357, LOCATION","162, 213, CONTENT","88, 96, ACTION","76, 85, ACTION","66, 72, MODAL","16, 65, CONTENT","0, 13, LOCATION","140, 155, ACTION"]}
{"text":"Line 112 –“This diet contained 1,000 IU (25 ?g) of cholecalciferol per kg.” the information is reproduced from the previous sentence","array_agg":["95, 105, ACTION","115, 132, LOCATION","10, 75, LOCATION","76, 91, CONTENT","0, 8, LOCATION"]}
{"text":"The vitamin D intake (based on the intake of diet) must be presented and compared .","array_agg":["0, 50, CONTENT","59, 68, ACTION","73, 81, ACTION","51, 55, MODAL"]}
{"text":"It seems, that Authors did not verify the normality of distribution for the assessed variables. Authors must verify the normality of distribution and specify the test applied for verification.","array_agg":["23, 37, ACTION","116, 145, CONTENT","150, 157, ACTION","158, 191, CONTENT","109, 115, ACTION","38, 94, CONTENT","104, 108, MODAL"]}
{"text":"If the distribution is normal, the mean values should be presented  (accompanied by SD), but if it is different than normal, the median, accompanied by minimum and maximum values should be presented  – it should be specified  that distribution is normal if it is.","array_agg":["93, 95, TRIGGER","205, 211, MODAL","231, 262, CONTENT","215, 224, ACTION","31, 46, CONTENT","47, 53, MODAL","57, 66, ACTION","69, 86, CONTENT","89, 92, TRIGGER","125, 178, CONTENT","179, 185, MODAL","189, 198, ACTION","0, 2, TRIGGER"]}
{"text":"The applied statistical tests should be corrected accordingly based  on distribution.","array_agg":["62, 84, CONTENT","0, 29, CONTENT","30, 36, MODAL","40, 49, ACTION"]}
{"text":"If the distribution is normal, the mean values should be presented  (accompanied by SD), but if it is different than normal, the median, accompanied by minimum and maximum values should be presented  – it should be specified  that distribution is normal if it is.","array_agg":["0, 2, TRIGGER","125, 178, CONTENT","179, 185, MODAL","189, 198, ACTION","205, 211, MODAL","215, 224, ACTION","231, 262, CONTENT","93, 95, TRIGGER","31, 46, CONTENT","47, 53, MODAL","57, 66, ACTION","69, 86, CONTENT","89, 92, TRIGGER"]}
{"text":"Table 1 – Authors should compare the baseline vitamin D levels for“VitD” groups","array_agg":["25, 32, ACTION","37, 62, CONTENT","66, 72, LOCATION","0, 7, LOCATION","18, 24, MODAL"]}
{"text":"The baseline body mass for groups should be presented and compared","array_agg":["44, 53, ACTION","34, 40, MODAL","0, 33, CONTENT","58, 66, ACTION"]}
{"text":"Figure 3(B), Figure 4(B) – should be presented  rather as tables to be easier to follow","array_agg":["27, 33, MODAL","48, 54, TRIGGER","55, 64, CONTENT","37, 46, ACTION","13, 24, LOCATION","0, 11, LOCATION"]}
{"text":"Authors should address the short period of the study – Authors analysed the results after only one week of intervention – why such a short intervention was planned and how it may have influenced the observed results?","array_agg":["8, 14, MODAL","15, 22, ACTION","23, 52, CONTENT","122, 125, TRIGGER","126, 215, CONTENT"]}
{"text":"It seems that a number of factors were not analysed at baseline, but just after intervention – it should be explained and discussed .","array_agg":["98, 104, MODAL","108, 117, ACTION","122, 131, ACTION","14, 33, CONTENT","39, 51, ACTION"]}
{"text":"The limitations of the study should be extensively discussed","array_agg":["0, 28, CONTENT","29, 35, MODAL","51, 60, ACTION"]}
{"text":"Authors should address the previously indicated issues associated with the applied model","array_agg":["27, 88, CONTENT","8, 14, MODAL","15, 22, ACTION"]}
{"text":"The potential mechanism was not studied, so it should not be addressed  in the conclusion","array_agg":["0, 23, CONTENT","79, 89, LOCATION","54, 70, ACTION","46, 53, MODAL","27, 39, ACTION"]}
{"text":"X.X. (line 303) – who is he?","array_agg":["6, 14, LOCATION","0, 4, LOCATION","22, 27, CONTENT","18, 21, TRIGGER"]}
{"text":"H.F. – it seems that he participated only in resources (what do Authors mean by“resources”?) and funding acquisition","array_agg":["0, 4, LOCATION","72, 90, CONTENT","56, 60, TRIGGER"]}
{"text":"S.R. - it seems that he participated only in investigation (what do Authors mean by“investigation”? animal experiment?)","array_agg":["0, 4, LOCATION","100, 117, CONTENT","76, 98, CONTENT","60, 64, TRIGGER"]}
{"text":"In this work, the adsorption of a polycation (namely polydiallyldimethylammonium chloride) onto the surface of nanosilica (synthesized from rice husk) was studied. The applicability of surface modified nanosilica in antibiotic (AMX) adsorption was investigated. The topic of the manuscript is suitable for the journal, and the results are interesting. However, there are several issues that must be addressed  prior to further consideration for publishing.","array_agg":["399, 408, ACTION","371, 385, CONTENT","327, 334, LOCATION","279, 289, LOCATION","8, 12, LOCATION","391, 395, MODAL"]}
{"text":"1) The article is full of grammatical mistakes and incorrect use of English which hinders understanding. -> The manuscript should be revised and corrected , preferably by a native speaker or proof-reading company.","array_agg":["145, 154, ACTION","112, 122, LOCATION","123, 129, MODAL","133, 140, ACTION","26, 75, CONTENT"]}
{"text":"2) The introduction is poorly structured, and lacks a logical thread of discussion. -> Problem statement, existing solutions and hypothesis of the work should be clearly stated .","array_agg":["46, 51, ACTION","170, 176, ACTION","87, 151, CONTENT","152, 158, MODAL","52, 82, CONTENT","23, 40, ACTION","7, 19, LOCATION"]}
{"text":"3) The introduction claims environmental remediation as the proposed application area of the prepared adsorbent. However, it is not clear which sector (industrial/domestic waste water treatment, potable water purification, etc.) faces problems caused by antibiotic pollutants where the developed adsorbents could be used . -> The introduction should precisely highlight the reason why new, effective adsorbents for antibiotic removal are needed.","array_agg":["138, 320, CONTENT","330, 342, LOCATION","343, 349, MODAL","7, 19, LOCATION","113, 120, TRIGGER","370, 444, CONTENT","360, 369, ACTION","128, 137, ACTION"]}
{"text":"4) The importance of sustainability in new water treatment processes should be mentioned with examples of various adsorbents complementing the one selected  by the authors: biochar (Journal of Environmental Management, 2017, 197, 732-749), imprinted materials (Green Chemistry, 2015, 17, 5196-5205), coconut (Journal of Cleaner Production, 2017, 162, 484-490), FO-MD (Water Research, 2014, 52, 112-121).","array_agg":["89, 402, CONTENT","79, 88, ACTION","69, 75, MODAL","3, 68, CONTENT"]}
{"text":"5) Figures 13-16: Instead of/Besides‘Removal Efficiency’,‘Adsorbent capacity’ should be depicted  as it gives a better picture on the adsorbent performance.","array_agg":["36, 56, LOCATION","57, 77, CONTENT","78, 84, MODAL","88, 96, ACTION","18, 28, TRIGGER","3, 16, LOCATION"]}
{"text":"6) Bulk references should be avoided . Instead, a book or a review article should be cited when possible.","array_agg":["85, 90, ACTION","75, 81, MODAL","19, 25, MODAL","29, 36, ACTION","3, 18, CONTENT","48, 74, CONTENT"]}
{"text":"7) Although, the prepared adsorbent is described as cheap and potent, no comparison is presented with existing adsorbent regarding the price or efficiency. -> The performance of the prepared adsorbent should be compared  against other commercial ones.","array_agg":["70, 96, ACTION","102, 154, CONTENT","159, 200, CONTENT","201, 207, MODAL","211, 219, ACTION","221, 250, CONTENT"]}
{"text":"8) In a pollutant adsorption process, the stability and regenerability of the adsorbent is essential. -> Experiments on the PDADMAC leaching during adsorption and on the possibility of regeneration should be performed  to evaluate the adsorbent performance.","array_agg":["219, 256, CONTENT","208, 217, ACTION","198, 204, MODAL","105, 197, CONTENT"]}
{"text":"9) Section 3.1: The characterization (SEM, FTIR, XRD) of the same nanosilica from rice husk is already discussed in reference 33. -> This part should be removed from the main text and presented  as supplementary material.","array_agg":["16, 91, CONTENT","3, 14, LOCATION","92, 112, ACTION","116, 128, LOCATION","143, 149, MODAL","152, 160, ACTION","170, 179, LOCATION","184, 193, ACTION","198, 220, LOCATION","133, 142, LOCATION"]}
{"text":"10) All information should be presented  in a compact manner. Figures with similar content should be combined and presented  as parts of a single figure with panels a, b, c,… e.g. Figure 1+2, 7+8, 13+14+15 should be combined .","array_agg":["30, 39, ACTION","197, 205, LOCATION","192, 195, LOCATION","180, 190, LOCATION","62, 69, LOCATION","4, 19, CONTENT","216, 224, ACTION","206, 212, MODAL","128, 174, CONTENT","114, 123, ACTION","101, 109, ACTION","20, 26, MODAL","91, 97, MODAL"]}
{"text":"11) Figure 1: The chemical structure of PDADMAC is incorrect. -> The structure should be checked  against the supplier catalogue (https://www.sigmaaldrich.com/catalog/product/aldrich/409030?lang=en&region=VN) and corrected accordingly.","array_agg":["48, 60, ACTION","79, 85, MODAL","65, 78, CONTENT","14, 47, CONTENT","4, 12, LOCATION","213, 222, ACTION","110, 208, CONTENT","89, 96, ACTION"]}
{"text":"12) Figure 1b: The schematic/cartoon structure should be omitted  as it shows the same information as the chemical structure.","array_agg":["47, 53, MODAL","15, 46, CONTENT","4, 13, LOCATION","57, 64, ACTION"]}
{"text":"13) Figure 16: This figure contains little information. -> The figure should be omitted  and the data should be directly written in the text.","array_agg":["80, 87, ACTION","4, 13, LOCATION","15, 26, LOCATION","27, 42, ACTION","43, 54, CONTENT","59, 69, LOCATION","70, 76, MODAL","93, 101, CONTENT","102, 108, MODAL","121, 128, ACTION","136, 140, LOCATION"]}
{"text":"14) Figure 1 and 2: All chemical structures should be drawn uniformly, while following the journal’s style guide.","array_agg":["44, 50, MODAL","4, 18, LOCATION","20, 43, CONTENT","54, 59, ACTION"]}
{"text":"15) Lines 53, 68, 195: Informal expressions such as“seems” or“fortunately” should be avoided  in a scientific article.","array_agg":["51, 58, LOCATION","23, 43, CONTENT","4, 21, LOCATION","85, 92, ACTION","75, 81, MODAL","61, 74, LOCATION"]}
{"text":"16) The correct degree symbol (°) should be used  everywhere in the text instead of a zero in superscript (0).","array_agg":["68, 72, LOCATION","4, 33, CONTENT","34, 40, MODAL","44, 48, ACTION","86, 109, LOCATION"]}
{"text":"17) Lines 141, 301, 308 The incorrect abbreviation, PDADAMAC is used instead of the correct PDADMAC; it should be corrected .","array_agg":["24, 50, CONTENT","4, 23, LOCATION","114, 124, ACTION","104, 110, MODAL","92, 99, CONTENT","52, 60, LOCATION"]}
{"text":"18) Figure 3: The figures should be uniformly formatted  in terms of dimensions, size and positioning.","array_agg":["36, 55, ACTION","14, 25, LOCATION","60, 101, CONTENT","4, 12, LOCATION","26, 32, MODAL"]}
{"text":"19) Line 139: “An amount of …” -> In the experimental section exact descriptions with exact amounts should be given.","array_agg":["100, 106, MODAL","4, 12, LOCATION","14, 30, LOCATION","62, 99, CONTENT","41, 61, LOCATION","110, 115, ACTION"]}
{"text":"20) The calibration curves should be provided  as supplementary material.","array_agg":["27, 33, MODAL","4, 26, CONTENT","50, 72, LOCATION","37, 45, ACTION"]}
{"text":"21) Line 151: How was the adsorbent separated from the PDADMAC solution? What type of filter was used/What were the conditions of centrifugation?","array_agg":["78, 101, CONTENT","73, 77, TRIGGER","22, 71, CONTENT","14, 17, TRIGGER","4, 12, LOCATION","112, 144, CONTENT","102, 106, TRIGGER"]}
{"text":"22) Line 183: What software or method was used to calculate the average size of silica particles?","array_agg":["18, 96, CONTENT","4, 12, LOCATION","14, 18, TRIGGER"]}
{"text":"23) Figure 10: The horizontal line representing 0 mV is above the 0 tick on the Y-axis. -> This inconsistency should be corrected .","array_agg":["80, 86, LOCATION","120, 129, ACTION","4, 13, LOCATION","15, 34, LOCATION","48, 52, LOCATION","110, 116, MODAL","65, 72, LOCATION"]}
{"text":"24) Line 273: “…the asymmetric N–H bonding of ammonium ion in PDADMAC molecules…” -> There are no N–H bonds in PDADMAC. The reasoning should be revised and corrected .","array_agg":["144, 151, ACTION","134, 140, MODAL","156, 165, ACTION","4, 12, LOCATION","98, 107, CONTENT","91, 97, ACTION","14, 81, LOCATION","120, 133, CONTENT","111, 118, LOCATION"]}
{"text":"25) Figure 9:“lines are results of two-step adsorption model” -> What method/software was used for the curve fitting?","array_agg":["4, 12, LOCATION","13, 61, LOCATION","65, 69, TRIGGER","70, 116, CONTENT"]}
{"text":"26) Either (preferably) the product form of units (V cm-1) or the quotient form (g/L) should be used  consistently throughout the whole manuscript.","array_agg":["136, 146, LOCATION","28, 58, CONTENT","65, 85, CONTENT","86, 92, MODAL","96, 100, ACTION","4, 10, TRIGGER"]}
{"text":"27) Further details are needed for the preparation of the solutions having different pH. How was the pH measured, and how accurate the given pH values are? Which buffers were used?","array_agg":["156, 161, TRIGGER","162, 179, CONTENT","4, 19, CONTENT","24, 30, ACTION","35, 87, CONTENT","89, 92, TRIGGER","97, 112, CONTENT","118, 121, TRIGGER","122, 154, CONTENT"]}
{"text":"The manuscript by Chun and co-workers describes a fouling and scaling study on FO membranes. There is a need for such research and the obtained results are of interest to a broad audience working in water purification, and membranes. The topic fits well within the scope of the journal. The experimental description is good and the results are clearly presented. However, there are several minor and major issues that must be addressed  prior to further consideration.","array_agg":["382, 412, CONTENT","418, 422, MODAL","426, 435, ACTION","4, 14, LOCATION","363, 370, TRIGGER"]}
{"text":"1, At the beginning of the manuscript, a tale should be added  that describes the properties and fabrication of each membrane. Currently the first table is table 1, which already refers to TFC-1 and TFC-2 without any previous tabulated information about these membranes.","array_agg":["217, 269, CONTENT","205, 213, ACTION","199, 204, LOCATION","10, 37, LOCATION","46, 52, MODAL","39, 45, CONTENT","56, 61, ACTION","68, 125, CONTENT","156, 163, LOCATION","189, 194, LOCATION"]}
{"text":"2, The main text under the ‘results and discussion’ is unnecessarily wordy. Shorten the text and minimize the discussion and reference to literature in this section as the ‘results and discussion’ should focus on the results obtained by the authors. In some cases it is difficult to understand whether the findings are original, or already reported in the literature.","array_agg":["76, 83, ACTION","329, 331, TRIGGER","302, 327, CONTENT","294, 301, TRIGGER","270, 293, ACTION","210, 248, CONTENT","204, 209, ACTION","197, 203, MODAL","172, 196, LOCATION","157, 164, LOCATION","125, 148, ACTION","106, 120, LOCATION","97, 105, ACTION","84, 92, LOCATION","332, 366, CONTENT","55, 74, ACTION","27, 51, LOCATION"]}
{"text":"3, A similar study was done on RO detailing the combined organic fouling and inorganic scaling of membranes, which should be mentioned , and the main differences and similarities with FO highlighted (10.1021/acs.est.8b02194).","array_agg":["125, 134, ACTION","145, 186, CONTENT","187, 198, ACTION","200, 223, CONTENT","5, 18, CONTENT","115, 121, MODAL","31, 107, CONTENT"]}
{"text":"4, Instead of the ambiguous x/y formatting of the units, use the IUPAC recommended x y^-1 throughout the text and the figures and tables.","array_agg":["65, 89, CONTENT","28, 55, CONTENT","105, 109, LOCATION","118, 125, LOCATION","130, 136, LOCATION","57, 60, ACTION"]}
{"text":"5, Figure 3 appears multiple times in the manuscript.","array_agg":["12, 34, ACTION","42, 52, LOCATION","3, 11, LOCATION"]}
{"text":"6, Recent diverse approaches on antifouling examples should be briefly mentioned  in the introduction (electrochemical 10.1021/acsapm.9b00087, graphene 10.1016/j.memsci.2020.118007, pillars 10.1021/acsanm.9b01942, sepiolite 10.1021/acssuschemeng.9b02025).","array_agg":["53, 59, MODAL","71, 80, ACTION","89, 101, LOCATION","103, 253, CONTENT","3, 52, CONTENT"]}
{"text":"7, The ‘conclusion’ section needs to be improved by adding quantitative statements about the main research findings as the text is currently too vague.","array_agg":["59, 115, CONTENT","7, 27, LOCATION","28, 33, MODAL","40, 48, ACTION","123, 127, LOCATION","141, 150, ACTION"]}
{"text":"8, The authors should add a brief discussion on the limitations and drawbacks of the proposed methodologies. Some thoughts on further work and the possibility of using DoE and AI for such investigations should be mentioned .","array_agg":["48, 107, CONTENT","15, 21, MODAL","22, 25, ACTION","203, 209, MODAL","213, 222, ACTION","143, 202, CONTENT","126, 138, LOCATION"]}
{"text":"The manuscript entitled“Ferroportin-hepcidin axis in prepubertal obese children with sufficient daily iron intake” presents  interesting issue, but the study itself has a number of serious limitations, significantly decreasing the quality of the study and reducing the possibility to conclude.","array_agg":["23, 114, LOCATION","144, 147, TRIGGER","169, 200, CONTENT","4, 14, LOCATION"]}
{"text":"2.       The control group recruited from ones“seeking dietary counselling” – it is not a“real” control group, as probably a number of other diet-related problems is observed for participants from the group","array_agg":["46, 75, LOCATION"]}
{"text":"4.       The age of study group and control group seem to differ (an important tendency – p=0.06) – it may have significantly influenced the results","array_agg":["9, 49, CONTENT","58, 64, ACTION","90, 96, LOCATION","126, 136, ACTION","103, 106, MODAL"]}
{"text":"It seems, that Authors are not fluent English speakers as some sentences are hard to follow and some grammar issues must be corrected  (e.g. line 52 it should be“known”).The manuscript should be corrected  by native English speaker or maybe by the professional agency.","array_agg":["124, 133, ACTION","101, 115, CONTENT","77, 91, ACTION","195, 204, ACTION","185, 191, MODAL","174, 184, LOCATION","161, 168, CONTENT","141, 148, LOCATION","116, 120, MODAL"]}
{"text":"The manuscript is shabbily prepared (e.g. formatting – descriptions under tables, typestyle – line 161, etc.)","array_agg":["82, 91, CONTENT","55, 80, LOCATION","15, 35, ACTION","4, 14, LOCATION","94, 102, LOCATION","42, 52, CONTENT"]}
{"text":"Authors should avoid personal description (e.g.“we determined”) and instead use less personal phrases (e.g.“it was determined”).","array_agg":["76, 79, ACTION","80, 127, CONTENT","15, 41, ACTION","8, 14, MODAL","47, 62, LOCATION"]}
{"text":"The study should be justified  – in the first sentence Authors should indicate the background","array_agg":["10, 16, MODAL","20, 29, ACTION","40, 54, LOCATION","63, 69, MODAL","70, 78, ACTION","83, 93, CONTENT","0, 9, CONTENT"]}
{"text":"Lines 18-19 – more specific information needed","array_agg":["14, 39, CONTENT","0, 11, LOCATION","40, 46, ACTION"]}
{"text":"Lines 19-23 – it should be mentioned what situation was observed  in the control group","array_agg":["0, 11, LOCATION","17, 23, MODAL","37, 86, CONTENT","27, 36, ACTION"]}
{"text":"Lines 23-25 – the conclusion must be more general – the fact, that there was no anemia in the studied group is not conclusion but the result","array_agg":["77, 107, CONTENT","126, 129, TRIGGER","134, 140, LOCATION","115, 125, LOCATION","108, 114, ACTION","34, 49, ACTION","29, 33, MODAL","18, 28, LOCATION","0, 11, LOCATION"]}
{"text":"Authors should carefully complete their references in this section, as for a number of information the references are lacking (e.g. lines 46-49)","array_agg":["25, 33, ACTION","54, 66, LOCATION","75, 98, CONTENT","103, 113, LOCATION","40, 50, CONTENT","114, 125, ACTION","132, 143, LOCATION","8, 14, MODAL"]}
{"text":"While indicating the risk groups of iron deficiency anemia, Authors must consult the reliable references, as it is not true, that“problem concerns especially children and adolescents”, as two main risk target groups are preschool children and young women, not adolescents – it must be corrected  (see documents of WHO: http://www.who.int/nutrition/publications/micronutrients/anaemia_iron_deficiency/en/ and consult the Global Targets 2025 document: http://www.who.int/nutrition/global-target-2025/en/)","array_agg":["68, 72, MODAL","81, 104, CONTENT","297, 501, CONTENT","112, 123, ACTION","129, 183, LOCATION","188, 271, CONTENT","277, 281, MODAL","285, 294, ACTION","73, 80, ACTION"]}
{"text":"Lines 51-63 – while defining the situation in overweight ones, Authors should indicate if in normal body weight/ malnourished ones there are similar observations or not","array_agg":["71, 77, MODAL","78, 86, ACTION","87, 168, CONTENT","0, 11, LOCATION"]}
{"text":"As both groups were recruited from ones“seeking dietary counselling”, the control group is not a“real” control group, as probably a number of other diet-related problems is observed for participants from the group. This group must be described  in details – what was the reason for seeking dietary counselling – any food products reluctances or avoidances? any acute medical conditions?","array_agg":["258, 262, TRIGGER","39, 68, LOCATION","70, 87, CONTENT","215, 225, CONTENT","226, 230, MODAL","234, 243, ACTION","267, 309, CONTENT","312, 315, TRIGGER","315, 355, CONTENT","357, 360, TRIGGER","361, 385, CONTENT"]}
{"text":"The age of the groups should be explained  – why the age group of 5-9 years (?) old ones was chosen? What was the age inclusion criteria? Were there any?","array_agg":["22, 29, MODAL","32, 41, ACTION","0, 21, CONTENT","45, 48, TRIGGER","49, 99, CONTENT","101, 105, TRIGGER","110, 136, CONTENT","138, 142, TRIGGER","143, 152, CONTENT"]}
{"text":"It seems, that there was a tendency towards difference between studied group and control one (p=0.06) – it is very serious limitation of the study and must be indicated  in this section","array_agg":["44, 92, CONTENT","110, 146, CONTENT","150, 155, MODAL","159, 168, ACTION","173, 185, LOCATION","94, 100, LOCATION"]}
{"text":"Moreover, acute medical conditions were not among the exclusion criteria – it may have influenced the results","array_agg":["78, 81, MODAL","10, 34, CONTENT","35, 43, ACTION","54, 72, LOCATION","98, 109, CONTENT","82, 97, ACTION"]}
{"text":"Lines 82-83 – it seems, that from 40 ones some were excluded – was it so? The number of excluded ones must be indicated","array_agg":["74, 101, CONTENT","110, 119, ACTION","0, 11, LOCATION","102, 106, MODAL"]}
{"text":"Why some participants prepared 10-DR and others 14-DR? It must be specified","array_agg":["58, 62, MODAL","4, 53, CONTENT","0, 3, TRIGGER","66, 75, ACTION"]}
{"text":"Why Authors decided to assess the consecutive days? The general methodology for the 3-DR requires the NON-consecutive days. Authors should get familiar with the reasons of recommending  non-consecutive ones – e.g. in the positions of NIH (https://dietassessmentprimer.cancer.gov/profiles/record/)","array_agg":["0, 3, TRIGGER","132, 138, MODAL","139, 151, ACTION","157, 206, CONTENT","214, 296, CONTENT","23, 50, CONTENT"]}
{"text":"The methodology of nutritional data gathering must be precisely presented  (e.g. was there any structured form, was the record weighted, etc.)","array_agg":["64, 73, ACTION","81, 84, TRIGGER","0, 45, CONTENT","116, 135, CONTENT","112, 115, TRIGGER","91, 110, CONTENT","46, 50, MODAL"]}
{"text":"It seems, that there are new Polish recommendations (published in 2017 - https://ncez.pl/aktualnosci/znowelizowane-normy-zywienia-2017) and maybe Authors are not familiar with them, as they stated, that they referred“current recommendations” while they referred ones published in 2012 (5 years older) – Authors must address the real current recommendations in their study (especially if the study was conducted in 2018), so they must get familiar with the document. Maybe there are also more recent recommendations (published in 2018?) - Authors must analyse the problem instead of referring  the old references","array_agg":["447, 464, CONTENT","360, 371, LOCATION","559, 570, CONTENT","551, 558, ACTION","487, 535, CONTENT","546, 550, MODAL","433, 446, ACTION","429, 433, MODAL","324, 356, CONTENT","316, 323, ACTION","311, 315, MODAL","216, 241, LOCATION","154, 170, ACTION","25, 135, CONTENT","571, 578, TRIGGER"]}
{"text":"Authors must indicate if they applied EAR, RDA or AI values","array_agg":["13, 21, ACTION","8, 12, MODAL","30, 59, CONTENT","22, 24, TRIGGER"]}
{"text":"Part 2.4. – the number of repetitions for the assessments must be specified","array_agg":["12, 57, CONTENT","66, 75, ACTION","58, 62, MODAL","0, 9, LOCATION"]}
{"text":"Line 113 –“other” – must be specified","array_agg":["10, 17, LOCATION","20, 24, MODAL","28, 37, ACTION","0, 8, LOCATION"]}
{"text":"Instead of interquartile range the minimum and maximum should be presented  (or should be added  to existing 25th and 75th)","array_agg":["65, 74, ACTION","80, 86, MODAL","90, 95, ACTION","11, 30, LOCATION","100, 122, LOCATION","31, 54, CONTENT","55, 61, MODAL","77, 79, TRIGGER"]}
{"text":"What do Authors mean by“graphical inspections”? – the methodology of normality assessment should be described  (as it seems that two independent methods were applied) and the reference is needed","array_agg":["171, 184, CONTENT","100, 109, ACTION","90, 96, MODAL","50, 89, CONTENT","23, 46, LOCATION","0, 5, TRIGGER","188, 194, ACTION"]}
{"text":"Instead of interquartile range the minimum and maximum should be presented  (or should be added  to existing 25th and 75th)","array_agg":["90, 95, ACTION","11, 30, LOCATION","31, 54, CONTENT","55, 61, MODAL","65, 74, ACTION","77, 79, TRIGGER","80, 86, MODAL","100, 122, LOCATION"]}
{"text":"The descriptions under tables should be properly formatted","array_agg":["4, 29, LOCATION","49, 58, ACTION","30, 36, MODAL"]}
{"text":"Why Authors did not calculate the individual energy intake recommendation? Is it not recommended in Poland? Why? Must be changed or justified  in the Materials and Methods Section","array_agg":["150, 179, LOCATION","113, 117, MODAL","107, 111, TRIGGER","75, 106, CONTENT","12, 73, CONTENT","0, 3, TRIGGER","121, 128, ACTION","132, 141, ACTION"]}
{"text":"The whole discussion must be corrected  accordingly while Authors should address all the problems in their study and indicate them as a limitations. Moreover, with such a major limitations Authors must conclude carefully and do not indicate the strong statements.","array_agg":["241, 262, CONTENT","225, 240, ACTION","202, 210, ACTION","197, 201, MODAL","171, 188, CONTENT","126, 147, CONTENT","117, 125, ACTION","81, 112, CONTENT","73, 80, ACTION","66, 72, MODAL","29, 38, ACTION","21, 25, MODAL","10, 20, LOCATION"]}
{"text":"The conclusions must be corrected as indicated  above (see: abstract)","array_agg":["60, 68, LOCATION","16, 20, MODAL","4, 15, LOCATION","55, 58, ACTION","24, 33, ACTION"]}
{"text":"Must be specified","array_agg":["0, 4, MODAL","8, 17, ACTION"]}
{"text":"1. Informal expressions and wording should be avoided , e.g. quite high, very close, we want","array_agg":["85, 92, LOCATION","46, 53, ACTION","36, 42, MODAL","3, 35, CONTENT","73, 83, LOCATION","61, 71, LOCATION"]}
{"text":"2. Abbreviations such as H/M should not be used  without revealing what they stand for.","array_agg":["29, 35, MODAL","36, 47, ACTION","25, 28, LOCATION","3, 16, CONTENT","49, 86, CONTENT"]}
{"text":"3. The typical elemental composition of inorganic membrane for hydrogen purification should be mentioned  and references. How does that compare to the system selected by the authors (Ni, Nb, Zr, Ta, B)? A more thorough analysis of the literature should be carried out and summarized  in a table.","array_agg":["3, 84, CONTENT","85, 91, MODAL","122, 125, TRIGGER","203, 245, CONTENT","136, 201, CONTENT","110, 120, ACTION","95, 104, ACTION","246, 252, MODAL","256, 267, ACTION","272, 282, ACTION","289, 294, LOCATION"]}
{"text":"4. H+ atoms should ready H+ ions.","array_agg":["25, 32, CONTENT","3, 11, LOCATION","12, 18, MODAL","19, 24, ACTION"]}
{"text":"5. Since the price for Ni, Co, Nb and Zr are given, the price of Pd (by the same source/supplier) should be mentioned  as well.","array_agg":["108, 117, ACTION","98, 104, MODAL","52, 97, CONTENT","9, 18, CONTENT","41, 50, ACTION"]}
{"text":"6. Alternative solutions, i.e. polymer-based membranes, need to be mentioned, and their extensive limitations should be stressed  to justify the importance of inorganic membranes.","array_agg":["130, 178, CONTENT","3, 54, CONTENT","56, 60, MODAL","67, 76, ACTION","82, 109, CONTENT","110, 116, MODAL","120, 128, ACTION"]}
{"text":"7. The results and discussion section contains experimental details that should only be mentioned under the experimental section of the manuscript, e.g. temperature scanning rate, argon purging rate. Experimental descriptions should be limited  to the experimental section and the results and discussion section to the presentation and discussion of results.","array_agg":["6, 14, LOCATION","19, 37, LOCATION","47, 67, CONTENT","73, 79, MODAL","88, 97, ACTION","108, 128, LOCATION","135, 146, LOCATION","153, 198, CONTENT","200, 225, CONTENT","226, 232, MODAL","236, 243, ACTION","315, 357, CONTENT","293, 311, LOCATION","281, 288, LOCATION","252, 272, LOCATION"]}
{"text":"8. The cause of the large hysteresis should be explained . Is it generally observed or specific to this membrane?","array_agg":["37, 43, MODAL","3, 36, CONTENT","47, 56, ACTION","59, 61, TRIGGER","62, 112, CONTENT"]}
{"text":"9. How was the boron content of the membrane controlled? What was the rationale behind the selection of boron content in the membrane? Could the boron content be further increased to achieve a further improved hydrogen solubility? What is the upper limit of the boron content? The same thoughts should be elaborated  for the Zr content.","array_agg":["62, 133, CONTENT","57, 61, TRIGGER","3, 6, TRIGGER","7, 55, CONTENT","277, 294, CONTENT","317, 335, CONTENT","236, 275, CONTENT","231, 235, TRIGGER","305, 315, ACTION","141, 229, CONTENT","135, 140, TRIGGER","295, 301, MODAL"]}
{"text":"10. It was concluded that the membranes are not brittle. How was the brittleness of the membrane evaluated?","array_agg":["61, 106, CONTENT","57, 60, TRIGGER"]}
{"text":"11. The experimental section on the membrane preparation should explain how the experimental conditions are controlled and selected to obtain either crystalline or amorphous membranes.","array_agg":["72, 183, CONTENT","64, 71, ACTION","32, 56, CONTENT","8, 28, LOCATION","57, 63, MODAL"]}
{"text":"The manuscript entitled „Sustainable Method Using Filtering Techniques for a Fermentation Process State Estimation” presents interesting issue, but some areas must be corrected .","array_agg":["24, 115, LOCATION","148, 158, CONTENT","159, 163, MODAL","167, 176, ACTION","4, 14, LOCATION","144, 147, TRIGGER"]}
{"text":"The major problem with the presented manuscript is associated with the fact, that Author presents a kind of technical report only, that is not prepared according to the commonly applied rules for scientific paper. Author must be aware that even if he has interesting  idea and valuable results, he can not just present them without a proper justification, discussion, and conclusions. The contribution valuable for readers must be presented  in a proper form – according to the generally applied scheme of the scientific paper. Without it, it is just a technical report from the study and should not be published .","array_agg":["221, 225, MODAL","298, 318, ACTION","226, 234, ACTION","334, 383, CONTENT","37, 47, LOCATION","474, 526, CONTENT","431, 440, ACTION","423, 427, MODAL","385, 422, CONTENT"]}
{"text":"Author tried to justify the study extensively (lines 8-14) – the information should be reduced  to 1-2 sentences associated directly with the study that was conducted","array_agg":["47, 57, LOCATION","99, 166, CONTENT","87, 94, ACTION","77, 83, MODAL","61, 76, CONTENT"]}
{"text":"Author should properly formulate the aim of the study (e.g. “The aim of the study was…”)","array_agg":["60, 87, CONTENT","37, 53, LOCATION","23, 32, ACTION","7, 13, MODAL"]}
{"text":"Author must present specific results of the study – e.g. estimation errors for the applied estimations","array_agg":["20, 49, CONTENT","7, 11, MODAL","57, 102, CONTENT","12, 19, ACTION"]}
{"text":"Author must present any specific conclusions from the conducted study","array_agg":["7, 11, MODAL","20, 69, CONTENT","12, 19, ACTION"]}
{"text":"Author should properly arrange their Introduction to justify in convincing  way the aim of the study. For the time being, Introduction seems rather to be a set of random information that are not associated with each other.","array_agg":["7, 13, MODAL","122, 134, LOCATION","80, 100, CONTENT","53, 60, ACTION","37, 49, LOCATION","23, 30, ACTION"]}
{"text":"Authors should present what is already known in the area and what are the “gaps” in the existing knowledge in order to present that the study that was planned was important for the area.","array_agg":["15, 22, ACTION","23, 106, CONTENT","8, 14, MODAL"]}
{"text":"Authors should properly use the references in this section – they should refer the presented information with the properly chosen literature. In the prese4nt version of the manuscript there are whole paragraphs with no references at all (e.g. lines 27-35).","array_agg":["24, 27, ACTION","46, 58, LOCATION","28, 42, CONTENT","66, 72, MODAL","73, 78, ACTION","79, 140, CONTENT","173, 183, LOCATION","200, 210, LOCATION","216, 236, CONTENT","243, 254, LOCATION","8, 14, MODAL"]}
{"text":"Authors should avoid multiple references for one simple information – it the current version of their manuscript even for very simple information (e.g. „ In recent years, the number of projects, protocols, and tools assigned to the promotion of sustainability in the industry has increased” – very general sentence which is not needed in this section at all), Authors include numerous references (as for this sentence – five of them: [8-12]). The number of such references should be reduced  – here and in other sentences.","array_agg":["102, 112, LOCATION","8, 14, MODAL","15, 20, ACTION","21, 67, CONTENT","152, 290, LOCATION","343, 350, LOCATION","324, 334, ACTION","376, 395, CONTENT","404, 417, LOCATION","434, 440, LOCATION","443, 472, CONTENT","473, 479, MODAL","483, 490, ACTION","494, 498, LOCATION","506, 521, LOCATION","293, 314, CONTENT"]}
{"text":"Authors should not present in this section information about the manuscript (e.g. “This research paper has three sections.”)","array_agg":["30, 42, LOCATION","8, 14, MODAL","43, 75, CONTENT","82, 123, LOCATION","15, 26, ACTION"]}
{"text":"Lines 84-93 – either should not be presented  in this section, or should not be presented  in the manuscript","array_agg":["63, 65, TRIGGER","66, 72, MODAL","73, 89, ACTION","98, 108, LOCATION","14, 20, TRIGGER","0, 11, LOCATION","21, 27, MODAL","28, 44, ACTION","49, 61, LOCATION"]}
{"text":"In this section Author presented a number of equations, but did not present in fact what in fact was done by him.","array_agg":["56, 59, TRIGGER","60, 75, ACTION","97, 112, CONTENT","3, 15, LOCATION"]}
{"text":"Author should present this section with the necessary details to be reproducible for other authors.","array_agg":["14, 21, ACTION","22, 34, LOCATION","40, 98, CONTENT","7, 13, MODAL"]}
{"text":"Figure 1 – should not be presented  as a figure, but in the regular text.","array_agg":["11, 17, MODAL","18, 34, ACTION","39, 47, CONTENT","68, 72, LOCATION","49, 52, TRIGGER","0, 8, LOCATION"]}
{"text":"Author may include sub-sections to this section to present information in an organized way.","array_agg":["11, 18, ACTION","19, 31, CONTENT","35, 47, LOCATION","7, 10, MODAL"]}
{"text":"Results and Discussion:","array_agg":["0, 22, LOCATION"]}
{"text":"This section does not present discussion at all – there is even no single reference","array_agg":["0, 12, LOCATION","13, 29, ACTION","30, 40, CONTENT","64, 83, ACTION"]}
{"text":"The results are presented shabbily – it is even hard to guess what did Author do and what results did he observed","array_agg":["62, 66, TRIGGER","85, 89, TRIGGER","90, 113, CONTENT","0, 11, CONTENT","16, 34, ACTION","67, 80, CONTENT"]}
{"text":"Author should briefly formulate the conclusions from the conducted study","array_agg":["7, 13, MODAL","32, 47, LOCATION","22, 31, ACTION"]}
{"text":"Author should include adequate references, while self-citations should be avoided , as they are not adequate (3 of 22 references – 14% are the own references by Author)","array_agg":["64, 70, MODAL","7, 13, MODAL","22, 41, CONTENT","49, 63, CONTENT","74, 81, ACTION","14, 21, ACTION"]}
{"text":"The manuscript evaluates the treatment of wastewater in China over the period 2011-2015. It uses a statistical model (Directional Distance Function) to determine the efficiency of inputs and outputs such as GDP, wastewater and expense efficiency. The study is comprehensive; drawing conclusions from data gathered over 31 different regions across China. Based on their findings, the authors give critical recommendations about actions which could be taken. The article fits well into the scope of Applied Sciences and could be further considered  for publication after major alterations.","array_agg":["4, 14, LOCATION"]}
{"text":"1. When stating the input and output variables in Table 1, the authors should explain the parentheses/units and what these refer to (e.g. Population (10,000 persons)). These units on all efficiencies should be made clear before the explanations that follow in Section 4.2.","array_agg":["210, 220, ACTION","50, 57, LOCATION","138, 165, LOCATION","71, 77, MODAL","78, 85, ACTION","86, 107, CONTENT","112, 116, TRIGGER","117, 131, CONTENT","260, 271, LOCATION","200, 206, MODAL","168, 199, CONTENT"]}
{"text":"2. The presentation of data tables should be made neater before publication. As some tables’ present data for 31 regions, these contain lots of information and appear cluttered. The authors could separate regions by gridlines in the tables, making it easier for the reader to visualise.","array_agg":["233, 239, LOCATION","205, 225, CONTENT","196, 204, ACTION","190, 195, MODAL","85, 91, LOCATION","45, 49, ACTION","35, 41, MODAL","57, 75, CONTENT","23, 34, LOCATION"]}
{"text":"3. Table 8 should be restructured . It can be seen the heading Rank is sometimes spread over two rows. This appears untidy and should be corrected  prior to publication.","array_agg":["103, 107, CONTENT","51, 101, CONTENT","21, 33, ACTION","11, 17, MODAL","137, 146, ACTION","3, 10, LOCATION","127, 133, MODAL"]}
{"text":"4. For all of the efficiency graphs (Figures 1 – 6), showing average values of various inputs and outputs, each data point should contain standard deviation (or error bars) about these mean values for each year. These would make the figures more information rich and give an idea to the reader regarding  the spread of results about the mean. It should also be stated explicitly how these errors were calculated. As the study is based on a theoretical model, the more statistical analysis that can be presented  in the figures would be beneficial to the manuscript.","array_agg":["107, 122, CONTENT","123, 129, MODAL","459, 488, CONTENT","138, 210, CONTENT","361, 367, ACTION","379, 382, TRIGGER","383, 411, CONTENT","233, 240, LOCATION","346, 352, MODAL","130, 137, ACTION","493, 497, MODAL","501, 510, ACTION","519, 526, LOCATION","554, 564, LOCATION","37, 50, LOCATION","18, 35, LOCATION"]}
{"text":"5. In Section 4.2.2, the author(s) make statements such as: The COD of all regions are all above 0.6534. The author(s) should provide some benchmark values, putting these results into context as to what constitutes a good efficiency score. This could be done by referencing existing literature or modelling  efficiency scores over the previous 10 years in China for comparison. This would help the reader to immediately determine the performance of wastewater treatment compared to similar works.","array_agg":["244, 250, MODAL","308, 361, CONTENT","297, 306, ACTION","274, 293, CONTENT","262, 273, ACTION","6, 19, LOCATION","60, 103, LOCATION","119, 125, MODAL","126, 133, ACTION","139, 238, CONTENT","251, 258, ACTION"]}
{"text":"6. Recent efforts on the wastewater treatment area in China should be acknowledged : Water Res., 2018, 130, 38-46; J. Hazard. Mater., 2018, 354, 81-90.","array_agg":["70, 82, ACTION","3, 59, CONTENT","60, 66, MODAL","85, 150, CONTENT"]}
{"text":"7. The author(s) are inconsistent in describing the efficiencies. For example in Section 4.2.2 the author(s) state 0.6556 and 7438. The efficiencies should have a maximum value of 1 and these misquotations of results in the text should be corrected  prior to publication.","array_agg":["132, 148, CONTENT","81, 94, LOCATION","115, 121, LOCATION","126, 130, LOCATION","149, 155, MODAL","156, 160, ACTION","161, 181, CONTENT","192, 216, CONTENT","224, 228, LOCATION","229, 235, MODAL","239, 248, ACTION"]}
{"text":"8. In Table 2, it should be made clearer how the Rate (%) is determined (bottom row). It is unclear whether this refers to the duration over which this rate is determined. This should be described  in the table or main body of the text.","array_agg":["89, 99, ACTION","6, 13, LOCATION","18, 24, MODAL","28, 40, ACTION","41, 44, TRIGGER","45, 84, CONTENT","172, 176, CONTENT","177, 183, MODAL","187, 196, ACTION","204, 210, LOCATION","214, 223, LOCATION","231, 235, LOCATION","100, 170, CONTENT"]}
{"text":"9. Given the global trend toward sustainable solutions, the authors should write a short paragraph in the introduction, and mention the importance and need for sustainable solutions for various applications among them water treatment, and give some diverse examples such desalination (Green Chem., 2018, 20, 3689-3695); wastewater treatment (Green Chem., 2015, 17, 5196-5205); water management (J. Clean. Product., 2018, 172, 786-794); catalysis (ACS Catal., 2018, 8, 7430-7438); extraction (J. Clean. Product., 2018, 181, 574-583).","array_agg":["239, 243, ACTION","244, 531, CONTENT","67, 74, MODAL","75, 80, ACTION","81, 98, CONTENT","105, 118, LOCATION","124, 131, ACTION","132, 233, CONTENT"]}
{"text":"10. The author(s) frequently refer to the‘5-Year Plan’ throughout the text. It should be stated what this refers to in the introduction, outlining the goals and origin of the plan. For readers outside of China, this is not immediately clear upon reading the article.","array_agg":["137, 146, ACTION","123, 135, LOCATION","89, 95, ACTION","79, 85, MODAL","70, 74, LOCATION","41, 54, LOCATION","147, 179, CONTENT"]}
{"text":"The manuscript entitled „ Consumption of ultra-processed foods and nutritional profile in a health promotion service of Brazilian primary care” presents interesting issue, but some areas must be corrected . Unfortunately Authors still did not correct the problems which I indicated in my previous review.","array_agg":["251, 263, CONTENT","195, 204, ACTION","187, 191, MODAL","176, 186, CONTENT","172, 175, TRIGGER","24, 143, LOCATION","4, 14, LOCATION","235, 250, ACTION"]}
{"text":"Authors should prepare their manuscript according  to the instructions for authors (e.g. References Section)","array_agg":["15, 22, ACTION","8, 14, MODAL","29, 39, LOCATION","54, 82, CONTENT","89, 107, LOCATION"]}
{"text":"There are numerous methodological problems (see above) – they must be either soled or extensively discussed  in the manuscript.","array_agg":["44, 47, ACTION","70, 76, TRIGGER","62, 66, MODAL","116, 126, LOCATION","10, 42, CONTENT","77, 82, ACTION","86, 107, ACTION"]}
{"text":"Authors improperly conducted their statistical analysis – they should use appropriate statistical test based on the distribution and analyse exact data which are presented in tables.","array_agg":["141, 157, CONTENT","63, 69, MODAL","70, 73, ACTION","74, 128, CONTENT","133, 140, ACTION","175, 181, LOCATION"]}
{"text":"Authors did not take into account the normality of distribution – it should be verified and defined and afterwards data presentation and statistical tests should be based  on the distribution.","array_agg":["8, 33, ACTION","92, 99, ACTION","34, 63, CONTENT","115, 154, CONTENT","155, 161, MODAL","165, 170, ACTION","69, 75, MODAL","79, 87, ACTION"]}
{"text":"For normally distributed data if Authors should present mean and SD, while for other – median, min and max values.","array_agg":["87, 113, CONTENT","41, 47, MODAL","48, 55, ACTION","4, 29, LOCATION","56, 67, CONTENT"]}
{"text":"The indicated problems should be reflected  in the discussion – all of them.","array_agg":["23, 29, MODAL","0, 22, CONTENT","33, 42, ACTION","51, 61, LOCATION"]}
{"text":"The manuscript details the fabrication, characterisation and some performance tests of dopamine-based FO membranes. The work has some novelty and potential impact. The topic is of interest to a broad audience. However, whether the manuscript fits within the scope of the journal is questionable. The manuscript is well-written and organized. The following technical issues need to be addressed:","array_agg":["4, 14, LOCATION","210, 217, TRIGGER","342, 372, CONTENT","373, 377, MODAL","384, 393, ACTION"]}
{"text":"1. Only 0.3 wt% DA was present in the membrane? The authors should also quantify the amount of the DA used during  the membrane preparation and express its incorporation into the membrane. It seems that most of the DA remains in solution and does not for part of the membrane. In this case the problem of lack of sustainability should be mentioned  in the manuscript.","array_agg":["3, 46, CONTENT","60, 66, MODAL","72, 80, ACTION","81, 139, CONTENT","144, 151, ACTION","152, 187, CONTENT","290, 327, CONTENT","328, 334, MODAL","338, 347, ACTION","356, 366, LOCATION"]}
{"text":"2. The experimental description for the TFC membrane (section 2.3) is not clearly explained. A table should be included  with all the components and relevant information for each membrane. The wt% does not add up to 100.","array_agg":["3, 52, CONTENT","54, 65, LOCATION","70, 91, ACTION","93, 100, CONTENT","101, 107, MODAL","111, 119, ACTION","126, 187, CONTENT","193, 196, LOCATION","197, 212, ACTION","213, 219, CONTENT"]}
{"text":"3. The abstract and the conclusion sections read the same. They should be rewritten, the abstract should not contain conclusions.","array_agg":["74, 83, ACTION","117, 128, CONTENT","105, 116, ACTION","98, 104, MODAL","89, 97, LOCATION","64, 70, MODAL","59, 63, CONTENT","24, 43, LOCATION","7, 15, LOCATION"]}
{"text":"4. The figures are very difficult to see and some of the text, especially the legend is not legible at all; they should all be enlarged.","array_agg":["7, 14, LOCATION","19, 40, ACTION","57, 61, LOCATION","78, 84, LOCATION","88, 99, ACTION","108, 112, CONTENT","113, 119, MODAL","127, 135, ACTION"]}
{"text":"5. line 65 should read“Guo et al.”","array_agg":["11, 17, MODAL","18, 22, ACTION","22, 34, CONTENT","3, 10, LOCATION"]}
{"text":"6. Under section 2.1 the purity/grade of all chemicals and solvents should be mentioned .","array_agg":["78, 87, ACTION","9, 20, LOCATION","21, 67, CONTENT","68, 74, MODAL"]}
{"text":"7. The experimental description of a well-know, simple PSf substrate does not require 5 references. Include only one reference under section 2.2.","array_agg":["108, 126, CONTENT","100, 107, ACTION","86, 98, CONTENT","69, 85, ACTION","3, 68, CONTENT","133, 144, LOCATION"]}
{"text":"8. The error bars are standard deviations? Based on how many measurements? Were independently prepared membranes used? These should be clarified  in the manuscript.","array_agg":["3, 41, CONTENT","153, 163, LOCATION","135, 144, ACTION","125, 131, MODAL","119, 124, CONTENT","80, 117, CONTENT","75, 79, TRIGGER","43, 73, CONTENT"]}
{"text":"The manuscript by Terraza et al. describes the effect of nanoparticles on PVDF-based mixed matrix membranes. The manuscript is well written, it has a good amount of data presented, and it is of interest to a broad audience working as materials scientists, polymer chemists or chemical engineers. The discussions and the data are of good quality. The work is novel and has a potential to be published in polymers subject to addressing the following concerns:","array_agg":["4, 14, LOCATION","113, 123, LOCATION","300, 311, LOCATION","320, 324, LOCATION","423, 433, ACTION","434, 456, CONTENT"]}
{"text":"1. The panels in Figure 1 need to be labelled“a” to“d” and the figure caption needs to describe each panel for better understanding of the procedure.","array_agg":["7, 25, LOCATION","26, 30, MODAL","37, 45, ACTION","45, 54, CONTENT","63, 77, LOCATION","78, 83, MODAL","87, 95, ACTION","96, 106, LOCATION"]}
{"text":"2. The MMM preparation is somewhat unclear. The 2-10 wt.% refers to the solid content of the final membrane, or the entire dope solution comprising of the polymer, NP and solvent? The composition should be clarified  in the text (line 134).","array_agg":["35, 42, ACTION","230, 238, LOCATION","224, 228, LOCATION","206, 215, ACTION","196, 202, MODAL","180, 195, CONTENT","112, 178, CONTENT","58, 107, CONTENT","109, 111, TRIGGER","48, 57, LOCATION","3, 22, CONTENT"]}
{"text":"3. A more elaborate explanation should be provided on the observation that the NPs are preferably located  in the bulk and not the surface (paragraph 231). Is there a sufficient adhesion of the NPs to the polymer matrix? Are the NPs breaking off the surface? These problems often seen for MMMs when rigid fillers are used. A crosslinking solution has been proposed to achieve robust MMMs, which should be mentioned  by the authors (ACS Appl. Mater. Interfaces, 2018, 10, 16140-16147).","array_agg":["432, 482, CONTENT","140, 153, LOCATION","156, 158, TRIGGER","165, 219, CONTENT","3, 31, CONTENT","32, 38, MODAL","42, 50, ACTION","75, 138, CONTENT","221, 224, TRIGGER","225, 257, CONTENT","323, 387, CONTENT","395, 401, MODAL","405, 414, ACTION"]}
{"text":"4. The molecular weight of the PVDF purchased should be mentioned  under section 2. The purity/grade of the chemicals should also be included under the materials part of the manuscript.","array_agg":["174, 184, LOCATION","133, 141, ACTION","118, 124, MODAL","84, 117, CONTENT","73, 82, LOCATION","56, 65, ACTION","46, 52, MODAL","3, 45, CONTENT","152, 161, LOCATION"]}
{"text":"5. The authors should comments on the mechanical stability of the membranes. They were dried out and not coiled/broken? See line 129.","array_agg":["87, 118, CONTENT","82, 86, TRIGGER","34, 75, CONTENT","124, 132, LOCATION","22, 30, ACTION","15, 21, MODAL"]}
{"text":"6. Line 98: punctuation missing at the end of the sentence; line 180: delete double-punctuation at the end of the paragraph","array_agg":["70, 76, ACTION","39, 58, LOCATION","60, 68, LOCATION","24, 31, ACTION","12, 23, CONTENT","103, 123, LOCATION","3, 10, LOCATION","77, 95, CONTENT"]}
{"text":"7. A space is missing in the title, “ofCU…” and in line 99“characterizeda”, line 102:“acorrelation”","array_agg":["85, 99, LOCATION","2, 10, CONTENT","11, 21, ACTION","29, 34, LOCATION","76, 84, LOCATION","36, 43, LOCATION","51, 58, LOCATION","58, 74, LOCATION"]}
{"text":"8. The symbols are missing in lines 22 and 24, most likely due to pdf conversion issues.","array_agg":["3, 14, CONTENT","30, 45, LOCATION","15, 26, ACTION"]}
{"text":"9. Line 26: Use superscript for“-1”","array_agg":["31, 35, LOCATION","16, 27, CONTENT","12, 15, ACTION","3, 10, LOCATION"]}
{"text":"10. A similar membrane distillation approach of MMM using PVDF but not with Cu-NPs but GO was reported in the literature, which also focus on the effect of the filler, and therefore should be acknowledged  in the introduction around line 93 (J. Membr. Sci., 2018, 554, 309-323).","array_agg":["87, 89, CONTENT","242, 276, CONTENT","233, 240, LOCATION","213, 225, LOCATION","192, 204, ACTION","182, 188, MODAL","83, 86, TRIGGER"]}
{"text":"11. The authors could consider doing  EDX to map the Cu content in the membrane.","array_agg":["38, 79, CONTENT","16, 21, MODAL","22, 36, ACTION"]}
{"text":"13. The conclusion section is weak and does not provide a sufficient discussion on the main conclusions. Elaborate more and add some quantitative statements regarding the main research outcomes. The limitations and drawbacks of the approach as well as future directions (e.g. test the membranes in membrane distillation?) should be briefly mentioned .","array_agg":["105, 114, ACTION","115, 119, CONTENT","340, 349, ACTION","322, 328, MODAL","195, 321, CONTENT","128, 193, CONTENT","124, 127, ACTION","56, 103, CONTENT","39, 55, ACTION","27, 34, ACTION","8, 26, LOCATION"]}
{"text":"The manuscript entitled“The Role of Foods as Dietary Sources of Vitamin D for Ethnic Minority Populations: The Underestimated Challenge” presents interesting issue, but some really major  corrections are needed.","array_agg":["169, 199, CONTENT","23, 136, LOCATION","165, 168, TRIGGER","4, 14, LOCATION","204, 210, ACTION"]}
{"text":"(1)    Major problem associated with applied definitions and improperly formulated title/ aim of the study:","array_agg":["90, 106, LOCATION","83, 88, LOCATION"]}
{"text":"Authors improperly formulated the title and the aim, while compared with the main body of the study, as there seem to be a misunderstanding of some definitions. Authors use the terms such as“ethnic populations”/“ethnic minority”, while they state that there is a problem“due to the skin pigment melanin and/or reduced skin exposure due to coverage required by religious and cultural restrictions”. But the definition of“ethnic populations”/“ethnic minority” is different and incomparable with those applied by Authors. The“ethnic group” is defined as a group of people with the common nation, ancestry, history, language, culture, society, while“ethnic minority” is defined as a group of people with common nation, ancestry, etc., that is different from the majority of population.","array_agg":["48, 51, LOCATION","211, 228, LOCATION","34, 39, LOCATION","8, 29, ACTION","270, 396, LOCATION","190, 210, LOCATION","398, 401, TRIGGER","419, 439, LOCATION","440, 457, LOCATION","522, 536, LOCATION","645, 662, LOCATION","77, 86, LOCATION"]}
{"text":"So, Authors must understand, that“skin pigment melanin and/or reduced skin exposure due to coverage required by religious and cultural restrictions” is typical for only SOME of minorities – e.g. Malaysian minority in Great Britain. But for the British minority in Malaysia, there is totally different problem (e.g. resulting from lack of traditional British products being sources of vitamin D).","array_agg":["17, 27, ACTION","232, 235, TRIGGER","33, 148, LOCATION","12, 16, MODAL"]}
{"text":"It seems, that Authors aimed to assess the minorities in western countries, but is also not so simple, as for French minority in Great Britain the indicated problems also do not exist. So maybe Authors wanted to assess just Middle East, Asian and African minorities? If so, there is not adequate information in the study.","array_agg":["280, 286, ACTION","287, 307, CONTENT","315, 320, LOCATION","209, 265, CONTENT"]}
{"text":"Authors must verify their approach and reformulate their thesis in order to be in agreement with the general definitions. Lack of a broader international perspective and perceiving only the own point of view seem as a lack of political correctness. It should be re-analyzed not only due to communicativeness of the study, but also due to presenting improper beliefs and opinions (western people are ALSO minorities if changing the country).","array_agg":["262, 273, ACTION","8, 12, MODAL","13, 19, ACTION","20, 34, CONTENT","39, 50, ACTION","51, 63, CONTENT","249, 251, CONTENT","252, 258, MODAL"]}
{"text":"The serious flaw of the presented manuscript is associated with the fact, that it presents a highly subjective review, not a systematic review. While the systematic review has a key role for broadening knowledge, the other reviews don’t have such role.","array_agg":["34, 44, LOCATION","4, 16, ACTION"]}
{"text":"Taking into account, that the Materials and methods section is not presented, without any specific information, it is hard to understand which studies were included into review and why. Authors did not present any key words, which were used during literature search, inclusion and exclusion criteria of references, information about the procedure of literature search conducted by them, number of chosen references, as well as information if some of them were excluded from the review and on the basis of which criteria.","array_agg":["60, 76, ACTION","211, 519, CONTENT","194, 209, ACTION","30, 59, LOCATION"]}
{"text":"The manuscript should be prepared  according to the instructions for authors (e.g., running title under title is not needed)","array_agg":["15, 21, MODAL","84, 97, CONTENT","48, 76, CONTENT","104, 109, LOCATION","110, 123, ACTION","25, 33, ACTION","4, 14, LOCATION"]}
{"text":"Authors in their abstract justified their study, but they did not present any other information. On the basis of the Abstract, the readers must get familiar with the aim of the study, the methodology (in the case of review articles also), main observations and conclusions – it must be presented .","array_agg":["117, 125, LOCATION","278, 282, MODAL","162, 272, CONTENT","17, 25, LOCATION","286, 295, ACTION","49, 52, TRIGGER"]}
{"text":"Lines 28-40 – Authors should not present basic or even trivial information about vitamin D, that are well known for the readers of Nutrients journal (e.g.“Humans can obtain vitamin D both from ultraviolet B (UVB) irradiation”).","array_agg":["41, 111, CONTENT","0, 11, LOCATION","22, 32, MODAL","33, 40, ACTION","154, 225, LOCATION"]}
{"text":"Lines 42-46 – information are not related to the aim of the study – should be removed","array_agg":["14, 25, CONTENT","45, 65, CONTENT","0, 11, LOCATION","26, 41, ACTION","68, 74, MODAL","78, 85, ACTION"]}
{"text":"Lines 50-51 – Authors improperly present the sources of vitamin D – Authors should analyze the typical serving  size and the content (e.g. not all the fishes can be perceived  as a source of vitamin D, while the content in yolk is really low in comparison with some species).","array_agg":["91, 274, CONTENT","0, 11, LOCATION","22, 40, ACTION","41, 65, CONTENT","76, 82, MODAL","83, 90, ACTION"]}
{"text":"The section should be presented  (see above).","array_agg":["22, 31, ACTION","4, 11, LOCATION","12, 18, MODAL"]}
{"text":"Lines 56-71 – should be removed , as not associated with the aim of the study – it seems that Authors included this paragraph in order to refer the own study [17] not associated with the aim of the study","array_agg":["0, 11, LOCATION","14, 20, MODAL","158, 162, LOCATION","111, 125, LOCATION","24, 31, ACTION"]}
{"text":"Liners 210-242 – should be removed , as not associated with the aim of the study – it is only weakly associated with the problem of minorities and is rather general than specific – it seems that Authors included this paragraph in order to refer the own study [49] not associated with the aim of the study","array_agg":["17, 23, MODAL","259, 263, LOCATION","212, 226, LOCATION","0, 14, LOCATION","27, 34, ACTION"]}
{"text":"Tables – are the strongest part of the study – may be interesting  and comprehensive, but conducting a systematic review and specifying what do Authors mean by“minorities” is essential","array_agg":["0, 6, LOCATION","86, 89, TRIGGER","159, 171, LOCATION","125, 135, ACTION","90, 100, ACTION"]}
{"text":"Sub-chapter 3 – is quite interesting, but not comprehensive: conducting a systematic review and specifying what do Authors mean by“minorities” is essential","array_agg":["61, 71, ACTION","0, 13, LOCATION","38, 41, TRIGGER","96, 106, ACTION","130, 142, LOCATION","74, 91, CONTENT"]}
{"text":"The formulated conclusions should be directly associated with the conducted  analysis of literature, while Authors should indicate any novelty, with no truisms “Dietary pattern is known to vary between ethnic populations”).","array_agg":["160, 221, LOCATION","0, 26, CONTENT","27, 33, MODAL","46, 56, ACTION","62, 99, CONTENT","115, 121, MODAL","122, 130, ACTION","135, 142, CONTENT"]}
{"text":"The manuscript entitled“The comparative validity and reliability of a non-nutritive sweetener food frequency questionnaire” presents an interesting issue, and in my opinion it is worth to be published, but only after corrections, that are needed.","array_agg":["217, 228, CONTENT","4, 14, LOCATION","23, 123, LOCATION","202, 205, TRIGGER","239, 245, ACTION"]}
{"text":"(1)    While Authors assess the repeated measurements conducted using the same tool, they use the“reliability” term, while“reproducibility” would be better (or“repeatability”) – it should be corrected  for better communicativeness.","array_agg":["181, 187, MODAL","97, 110, LOCATION","122, 139, CONTENT","140, 145, MODAL","146, 155, ACTION","159, 174, CONTENT","191, 200, ACTION"]}
{"text":"(2)    Neither assessment of the difference between results, nor the analysis of correlation is the most recommended method in the validation of the FFQ. The Bland-Altman method is indicated as a“gold standard”, while kappa statistic is indicated as other good method [https://www.ncbi.nlm.nih.gov/pubmed/19079912], and correlation may be used  only in conjunction with other method. It should be reflected  in the Results and Discussion, as Authors present rather other methods than those most prominent (especially 3.3. section).","array_agg":["517, 529, LOCATION","387, 393, MODAL","397, 406, ACTION","415, 422, LOCATION","427, 437, LOCATION","154, 382, CONTENT"]}
{"text":"(3)    Not only the applied questionnaire, but also the recalculation key enabling calculating NNS intake should be presented  (e.g. as a supplementary material).","array_agg":["116, 125, ACTION","43, 47, TRIGGER","52, 105, CONTENT","106, 112, MODAL","138, 160, LOCATION"]}
{"text":"(4)    The study group was very diverse – Authors should at least try to validate the obtained FFQ twice – in two gender groups, instead of one validation in such a diverse group (both male and female respondents, age 18-86, various ethnicity, various BMI, various income, various educational level)","array_agg":["50, 57, MODAL","82, 299, CONTENT","73, 81, ACTION"]}
{"text":"(5)    The text formatting should be corrected  to be according to the instructions for authors (Abstract) and other minor corrections are needed (e.g. line 41, NDSR/ NDS-R)","array_agg":["161, 172, LOCATION","11, 26, CONTENT","27, 33, MODAL","37, 46, ACTION","68, 96, CONTENT","97, 105, LOCATION","111, 134, CONTENT","139, 145, ACTION","152, 159, LOCATION"]}
{"text":"It should be formatted  according to the instructions for authors (“The abstract […] should follow the style of structured abstracts, but without headings”).","array_agg":["37, 65, CONTENT","3, 9, MODAL","13, 23, ACTION","67, 155, LOCATION"]}
{"text":"The results of Bland-Altman index and/ or kappa statistic should be presented  rather than assessment of the difference between results, or the analysis of correlation.","array_agg":["58, 64, MODAL","0, 57, CONTENT","68, 77, ACTION"]}
{"text":"Authors should present the conclusions from the conducted study, without speculative conclusions about improving the quality of the NNS data (lines 29-30 – was it verified?).","array_agg":["142, 153, LOCATION","8, 14, MODAL","15, 22, ACTION","23, 140, CONTENT","160, 171, CONTENT","156, 159, TRIGGER"]}
{"text":"Authors presented legal regulations for USA, but for no other country. If the article is to be published in an international journal, also data for other countries are needed, or information, that there is no country with regulations different than in USA.","array_agg":["139, 163, CONTENT","179, 255, CONTENT","168, 174, ACTION","176, 178, TRIGGER"]}
{"text":"Lines 61-68 – should be removed , as Authors present only basic information – the readers of the“Nutrients” journal have some nutritional knowledge, and it is not needed to explain what the FFQ is","array_agg":["14, 20, MODAL","0, 11, LOCATION","24, 31, ACTION"]}
{"text":"Lines 69-71 – the presented data are not proper! Authors presented the total number of tools (168), while the number of food frequency questionnaires is lower (146 – January 2018)","array_agg":["33, 47, ACTION","49, 98, CONTENT","100, 105, TRIGGER","14, 32, CONTENT","0, 11, LOCATION","106, 179, CONTENT"]}
{"text":"Line 395 - what is formula for accuracy?","array_agg":["16, 39, CONTENT","0, 8, LOCATION","11, 15, TRIGGER"]}
{"text":"A=(N1/N2 )*100% - A- accuracy, N1- test samples recognized properly, N2 - all test samples","array_agg":["74, 90, CONTENT","0, 15, LOCATION","18, 19, LOCATION","21, 29, CONTENT","31, 33, LOCATION","35, 67, CONTENT","69, 71, LOCATION"]}
{"text":"Please add more citations form Web of Science (2016, 2017, 2018, 2019).","array_agg":["11, 70, CONTENT","7, 10, ACTION"]}
{"text":"Recent progress on decoupling diagnosis of hybrid failures in gear transmission systems using vibration sensor signal: A review","array_agg":["0, 127, LOCATION"]}
{"text":"Mechanical Systems and Signal Processing, Volume 117, 2019, Pages 65-80.","array_agg":["0, 71, CONTENT"]}
{"text":"The authors should add block diagram of proposed analysis (good quality).","array_agg":["12, 18, MODAL","23, 72, CONTENT","19, 22, ACTION"]}
{"text":"The authors should add photos of applications - fault diagnosis?? The paper is boring now.","array_agg":["19, 22, ACTION","23, 45, CONTENT","76, 85, ACTION","12, 18, MODAL","48, 63, CONTENT"]}
{"text":"Figures should have better quality.","array_agg":["15, 34, ACTION","8, 14, MODAL","0, 7, LOCATION"]}
{"text":"Please add labels, SI units to axes OX and OY","array_agg":["7, 10, ACTION","11, 27, CONTENT","31, 45, LOCATION"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["34, 40, MODAL","3, 21, LOCATION","41, 44, ACTION","45, 80, CONTENT"]}
{"text":"The authors should cite new references (2016-2019 Web of Science).","array_agg":["12, 18, MODAL","19, 23, ACTION","24, 65, CONTENT"]}
{"text":"Please show that you have new knowledge about motors.","array_agg":["7, 11, ACTION","12, 52, CONTENT"]}
{"text":"The authors should add block diagram of proposed analysis (good quality, step by step).","array_agg":["23, 86, CONTENT","12, 18, MODAL","19, 22, ACTION"]}
{"text":"the article should be more colorful - more colourful images/figures/faults","array_agg":["19, 35, ACTION","4, 11, LOCATION","38, 74, CONTENT","12, 18, MODAL"]}
{"text":"Please add arrows what is what.","array_agg":["23, 30, CONTENT","11, 17, CONTENT","18, 22, TRIGGER","7, 10, ACTION"]}
{"text":"The authors should add photos of applications - The paper is boring now.","array_agg":["12, 18, MODAL","23, 45, CONTENT","61, 67, ACTION","19, 22, ACTION"]}
{"text":"Figures should have better quality.","array_agg":["0, 7, LOCATION","15, 34, ACTION","8, 14, MODAL"]}
{"text":"Please add labels, SI units to axes OX and OY - amplitude perhaps [m/s^2] or normalized amplitude","array_agg":["74, 76, TRIGGER","48, 73, CONTENT","31, 45, LOCATION","11, 27, CONTENT","7, 10, ACTION","77, 97, CONTENT"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["34, 40, MODAL","45, 80, CONTENT","41, 44, ACTION","3, 21, LOCATION"]}
{"text":"The authors should cite new references (2016-2019 Web of Science).","array_agg":["12, 18, MODAL","19, 23, ACTION","24, 65, CONTENT"]}
{"text":"Please show that you have new knowledge.","array_agg":["17, 39, CONTENT","7, 11, ACTION"]}
{"text":"-please add figures with good quality-Add labels to figures, axes OX, OY, SI units -> seconds, Pa/m^2 or something-please add block diagram of proposed research-please add photo of application/measurements of proposed methods-please add some sentences about future analysis-please cite references from 2016-2019 Web of Science (80%), different journals, show knowledge","array_agg":["354, 358, ACTION","8, 11, ACTION","12, 37, CONTENT","38, 41, ACTION","95, 114, CONTENT","122, 125, ACTION","126, 160, CONTENT","168, 171, ACTION","172, 225, CONTENT","233, 236, ACTION","237, 273, CONTENT","281, 285, ACTION","286, 352, CONTENT","359, 368, CONTENT","74, 82, CONTENT","61, 72, LOCATION","52, 59, LOCATION","42, 48, CONTENT"]}
{"text":"The authors should write some more about applications of proposed technique.In conclusion section please write 1-2 sentences about further analysis.","array_agg":["25, 75, CONTENT","19, 24, ACTION","111, 147, CONTENT","105, 110, ACTION","79, 97, LOCATION","12, 18, MODAL"]}
{"text":"There are a few citations from Web of Science (2016, 2017, 2018).some new citations from Web of Science about diagnosis/neural networkfor exampleGlowacz A., Acoustic based fault diagnosis of three-phase induction motor, Applied Acoustics, vol. 137, 2018, pp. 82-89. https://doi.org/10.1016/j.apacoust.2018.03.010 Condition monitoring of planetary gearbox by hardware implementation of artificial neural networksBy:Dabrowski, D (Dabrowski, Dariusz)[ 1 ]MEASUREMENTVolume: 91Pages: 295-308DOI: 10.1016/j.measurement.2016.05.056Published: SEP 2016FAULT DIAGNOSTICS OF ACOUSTIC SIGNALS OF LOADED SYNCHRONOUS MOTOR USING SMOFS-25-EXPANDED AND SELECTED CLASSIFIERSBy:Glowacz, A (Glowacz, Adam)[ 1 ]TEHNICKI VJESNIK-TECHNICAL GAZETTEVolume: 23Issue: 5Pages: 1365-1372DOI: 10.17559/TV-20150328135652Published: OCT 2016  Study on planetary gear fault diagnosis based on entropy feature fusion of ensemble empirical mode decompositionBy:Cheng, G (Cheng, Gang)[ 1 ] ; Chen, XH (Chen, Xihui)[ 1 ] ; Li, HY (Li, Hongyu)[ 1 ] ; Li, P (Li, Peng)[ 1 ] ; Liu, HG (Liu, Houguang)[ 1 ]MEASUREMENTVolume: 91Pages: 140-154DOI: 10.1016/j.measurement.2016.05.059Published: SEP 2016 Diagnosis of the three-phase induction motor using thermal imagingBy:Glowacz, A (Glowacz, Adam)[ 1 ] ; Glowacz, Z (Glowacz, Zygfryd)[ 2 ]INFRARED PHYSICS & TECHNOLOGYVolume: 81Pages: 7-16DOI: 10.1016/j.infrared.2016.12.003Published: MAR 2017  Application of Artificial Neural Network for Damage Detection in Planetary Gearbox of Wind TurbineBy:Straczkiewicz, M (Straczkiewicz, Marcin)[ 1 ] ; Barszcz, T (Barszcz, Tomasz)[ 1 ]SHOCK AND VIBRATIONArticle Number: 4086324DOI: 10.1155/2016/4086324Published: 2016","array_agg":["65, 1666, CONTENT"]}
{"text":"The article should be more colorful - more colourful images/figures","array_agg":["12, 18, MODAL","19, 35, ACTION","38, 67, CONTENT"]}
{"text":"The authors should add block diagram of proposed analysis (good quality).","array_agg":["12, 18, MODAL","19, 22, ACTION","23, 72, CONTENT"]}
{"text":"Why the topic is essential. Please add image.","array_agg":["39, 44, CONTENT","35, 38, ACTION"]}
{"text":"Figures should have better quality.","array_agg":["15, 34, ACTION","8, 14, MODAL","0, 7, LOCATION"]}
{"text":"Figure 7 - please add labels and SI units","array_agg":["0, 8, LOCATION","22, 41, CONTENT","18, 21, ACTION"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["45, 80, CONTENT","34, 40, MODAL","41, 44, ACTION","3, 21, LOCATION"]}
{"text":"The authors should cite new references (2016-2019 Web of Science).","array_agg":["24, 65, CONTENT","12, 18, MODAL","19, 23, ACTION"]}
{"text":"Please show that you have new knowledge.","array_agg":["7, 11, ACTION","12, 39, CONTENT"]}
{"text":"If you put so many formulas you should descibe it better. - what is what/block diagram etc.","array_agg":["19, 27, LOCATION","60, 90, CONTENT","39, 46, ACTION","32, 38, MODAL","0, 2, TRIGGER"]}
{"text":"The author should add block diagram of proposed analysis.","array_agg":["18, 21, ACTION","11, 17, MODAL","22, 56, CONTENT"]}
{"text":"The author should add some more photos of applications of proposed technique. - Now the article is boring.","array_agg":["22, 76, CONTENT","11, 17, MODAL","18, 21, ACTION"]}
{"text":"the results should be tables or charts - it is missing.","array_agg":["12, 18, MODAL","22, 38, CONTENT","19, 21, ACTION","0, 11, CONTENT","44, 54, ACTION"]}
{"text":"In Conclusion section","array_agg":["3, 21, LOCATION"]}
{"text":"The author should add some sentences about future analysis.","array_agg":["18, 21, ACTION","22, 58, CONTENT","11, 17, MODAL"]}
{"text":"Number of selfcitations should be (max 5% of all) 2 or less.","array_agg":["31, 33, ACTION","0, 23, CONTENT","24, 30, MODAL","34, 59, CONTENT"]}
{"text":"The authors should add block diagram of proposed analysis","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 57, CONTENT"]}
{"text":"The authors should add photos of Measurement/photos of experimental setup/photos of faults.","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 90, CONTENT"]}
{"text":"The authors should add 1-3 sentences about future research.","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 58, CONTENT"]}
{"text":"Please add more citations form Web of Science (2016, 2017, 2018, 2019).","array_agg":["7, 10, ACTION","11, 70, CONTENT"]}
{"text":"Figure 4 - what is N (axis OX)","array_agg":["11, 15, TRIGGER","0, 8, LOCATION","22, 29, LOCATION","19, 20, CONTENT"]}
{"text":"It is good idea to add flowchart of proposed technique. (if it exists)","array_agg":["23, 70, CONTENT","19, 22, ACTION"]}
{"text":"The authors should add photos of application of proposed technique.","array_agg":["12, 18, MODAL","22, 66, CONTENT","19, 22, ACTION"]}
{"text":"references should be from web of science (2016, 2017, 2018)","array_agg":["0, 10, CONTENT","26, 59, CONTENT","18, 20, ACTION","11, 17, MODAL"]}
{"text":"when using conventional BPNN algorithm [20]. However SVM is restricted in practical application","array_agg":["45, 52, TRIGGER"]}
{"text":"The rest of this paper is organized as follows. Section 2 introduces the conception of EEMD and","array_agg":["48, 57, LOCATION"]}
{"text":"Section 3 describes the PD signal experiments and calculates the PD parameters. Section 4 evaluates","array_agg":["80, 89, LOCATION","0, 9, LOCATION"]}
{"text":"And Section 5 concludes this paper.","array_agg":["4, 13, LOCATION"]}
{"text":"in the area of signal analysis and processing [12, 13]. However, the mode mixing in EMD degrades","array_agg":["56, 63, TRIGGER"]}
{"text":"the text should be fixed .","array_agg":["19, 24, ACTION","4, 8, LOCATION","9, 15, MODAL"]}
{"text":"axes should be entitled , SI units, Fig. 10","array_agg":["15, 23, ACTION","26, 34, CONTENT","36, 43, LOCATION","0, 4, LOCATION","5, 11, MODAL"]}
{"text":"Fig 9 axis OY - Amplitude? mV, V, or what? Fig. 4 also.","array_agg":["43, 49, LOCATION","6, 13, LOCATION","16, 25, CONTENT","0, 5, LOCATION","27, 41, CONTENT"]}
{"text":"please add some photos of analysed equipment","array_agg":["11, 44, CONTENT","7, 10, ACTION"]}
{"text":"Authors should add 1-2 sentences in Conclusions section about applications of proposed approach.","array_agg":["36, 55, LOCATION","18, 32, CONTENT","8, 14, MODAL","15, 18, ACTION","62, 95, CONTENT"]}
{"text":"There are a few references from Web of Science. It should be fixed .","array_agg":["16, 46, CONTENT","51, 57, MODAL","61, 66, ACTION"]}
{"text":"If you write article to journal with IF (Impact Factor) you should cite other journals with IF or articles","array_agg":["67, 71, ACTION","60, 66, MODAL","72, 106, CONTENT","0, 2, TRIGGER"]}
{"text":"The authors should add block diagram of proposed analysis","array_agg":["23, 57, CONTENT","12, 18, MODAL","19, 22, ACTION"]}
{"text":"Figure 3, 4, 7 - missing SI units/labels on axes OX, OY","array_agg":["44, 55, LOCATION","0, 14, LOCATION","17, 24, ACTION","25, 40, CONTENT"]}
{"text":"The authors should add photos of Measurement/photos of experimental setup/photos of faults.","array_agg":["23, 90, CONTENT","19, 22, ACTION","12, 18, MODAL"]}
{"text":"Please add more citations form Web of Science (2015, 2016, 2017, 2018, 2019).","array_agg":["7, 10, ACTION","11, 76, CONTENT"]}
{"text":"The authors should add some more text and photos of applications/analysed car/experimental setup","array_agg":["12, 18, MODAL","19, 22, ACTION","23, 96, CONTENT"]}
{"text":"In Conclusion section","array_agg":["3, 21, LOCATION"]}
{"text":"The authors should add some sentences about future analysis.","array_agg":["23, 59, CONTENT","19, 22, ACTION","12, 18, MODAL"]}
{"text":"Please add some new references about neural network/fault diagnosis for example.","array_agg":["7, 10, ACTION","16, 79, CONTENT"]}
{"text":"1) Figures should have better quality.","array_agg":["3, 10, LOCATION","18, 37, ACTION","11, 17, MODAL"]}
{"text":"Figure 2 please add arrows to real figure","array_agg":["0, 8, LOCATION","35, 41, LOCATION","20, 26, CONTENT","16, 19, ACTION"]}
{"text":"2) Please add SI units (if any)","array_agg":["10, 13, ACTION","14, 31, CONTENT"]}
{"text":"3) Why the topic is essential. Please add image of application.","array_agg":["42, 62, CONTENT","38, 41, ACTION"]}
{"text":"4) What does it mean Time (10min) it is better to write min or seconds","array_agg":["3, 7, TRIGGER","56, 70, CONTENT","50, 55, ACTION","21, 33, CONTENT"]}
{"text":"5) The authors should cite new references (2016-2019 Web of Science).","array_agg":["22, 26, ACTION","15, 21, MODAL","27, 68, CONTENT"]}
{"text":"Please show that you have new knowledge.","array_agg":["12, 39, CONTENT","7, 11, ACTION"]}
{"text":"The authors should add block diagram of proposed analysis (good quality).","array_agg":["19, 22, ACTION","23, 72, CONTENT","12, 18, MODAL"]}
{"text":"the article should be more colorful - more colourful images/figures","array_agg":["19, 35, ACTION","4, 11, LOCATION","38, 67, CONTENT","12, 18, MODAL"]}
{"text":"Please add arrows what is what.","array_agg":["11, 30, CONTENT","7, 10, ACTION"]}
{"text":"The authors should add photos of applications - The paper is boring now.","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 45, CONTENT"]}
{"text":"Figures should have better quality.","array_agg":["0, 7, LOCATION","8, 14, MODAL","15, 34, ACTION"]}
{"text":"Please add labels, SI units to axes OX and OY","array_agg":["11, 27, CONTENT","7, 10, ACTION","31, 45, LOCATION"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["41, 44, ACTION","45, 80, CONTENT","34, 40, MODAL","3, 21, LOCATION"]}
{"text":"The authors should cite new references (2016-2019 Web of Science).","array_agg":["24, 65, CONTENT","12, 18, MODAL","19, 23, ACTION"]}
{"text":"Please show that you have new knowledge.","array_agg":["7, 11, ACTION","12, 39, CONTENT"]}
{"text":"The authors should add photos of Measurement/photos of experimental setup/applications","array_agg":["12, 18, MODAL","23, 86, CONTENT","19, 22, ACTION"]}
{"text":"Please add flowchart of proposed technique. Step by step.","array_agg":["7, 10, ACTION","11, 57, CONTENT"]}
{"text":"In Conclusion section the authors shoulkd put 1-3 sentences about future research.","array_agg":["42, 45, ACTION","46, 81, CONTENT","3, 21, LOCATION","34, 41, MODAL"]}
{"text":"Please add more citations form Web of Science (2014, 2015, 2016, 2017, 2018, 2019) about wireless communication/appplication of acoustic signals","array_agg":["7, 10, ACTION","11, 144, CONTENT"]}
{"text":"Why are you doing it? add some applications of using acoustic signals.","array_agg":["4, 20, CONTENT","22, 25, ACTION","26, 69, CONTENT","0, 3, TRIGGER"]}
{"text":"1) Please addeasy block diagrams/ step by step what are you analysed, what parameters/values","array_agg":["13, 92, CONTENT","10, 13, ACTION"]}
{"text":"2) Figures should have better quality. Axes should be labeled , SI units (if any)","array_agg":["18, 37, ACTION","64, 81, CONTENT","54, 61, ACTION","44, 50, MODAL","39, 43, LOCATION","11, 17, MODAL","3, 10, LOCATION"]}
{"text":"3) Please add some photos (application/measurement)","array_agg":["10, 13, ACTION","14, 51, CONTENT"]}
{"text":"4) Please add 1-3 sentences about future research","array_agg":["14, 49, CONTENT","10, 13, ACTION"]}
{"text":"5) The authors should cite new references (2016-2019 Web of Science).","array_agg":["22, 26, ACTION","15, 21, MODAL","27, 69, CONTENT"]}
{"text":"1) Figures should have better quality. Axes should be labeled , SI units (if any)","array_agg":["39, 43, LOCATION","18, 37, ACTION","54, 61, ACTION","3, 10, LOCATION","64, 81, CONTENT","44, 50, MODAL","11, 17, MODAL"]}
{"text":"2) Please add some photos (application/measurement)","array_agg":["14, 51, CONTENT","10, 13, ACTION"]}
{"text":"3) What is formula for accuracy?","array_agg":["11, 31, CONTENT","3, 7, TRIGGER"]}
{"text":"4) Please add 1-3 sentences about future research","array_agg":["14, 49, CONTENT","10, 13, ACTION"]}
{"text":"5) The authors should cite new references (2016-2019 Web of Science).","array_agg":["27, 68, CONTENT","15, 21, MODAL","22, 26, ACTION"]}
{"text":"Please show that you have new knowledge about KNN/SVM","array_agg":["7, 11, ACTION","12, 53, CONTENT"]}
{"text":"Please add flowchart of proposed technique. Step by step.","array_agg":["11, 57, CONTENT","7, 10, ACTION"]}
{"text":"Figure 2 is good but the authors should add general flowchart (for example several steps easy to understand)","array_agg":["0, 8, LOCATION","44, 108, CONTENT","40, 43, ACTION","33, 39, MODAL","17, 20, TRIGGER"]}
{"text":"Figure 11 should have better quality","array_agg":["17, 36, ACTION","0, 9, LOCATION","10, 16, MODAL"]}
{"text":"The authors should add labels what signal is analysed: vibration or acoustic","array_agg":["12, 18, MODAL","19, 22, ACTION","23, 76, CONTENT"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["3, 21, LOCATION","34, 40, MODAL","41, 44, ACTION","45, 80, CONTENT"]}
{"text":"Please add more citations form Web of Science (2015, 2016, 2017, 2018, 2019).","array_agg":["7, 10, ACTION","11, 76, CONTENT"]}
{"text":"All figures should be corrected  - bigger fonts","array_agg":["12, 18, MODAL","0, 11, LOCATION","35, 47, CONTENT","22, 31, ACTION"]}
{"text":"especially Fugures 2, 3, 4, 6, 7 should be better quality - bigger fonts of labels","array_agg":["11, 32, LOCATION","40, 57, ACTION","33, 39, MODAL","60, 82, CONTENT"]}
{"text":"The authors should add block diagram of proposed analysis (preprocessing, feature extraction, classification).","array_agg":["23, 109, CONTENT","12, 18, MODAL","19, 22, ACTION"]}
{"text":"The authors should add some more photos of applications of proposed technique OR experimental setup, analysed machine + arrows to sensors (what is what)","array_agg":["23, 152, CONTENT","19, 22, ACTION","12, 18, MODAL"]}
{"text":"The author should add some more photos of applications/analysed machine","array_agg":["11, 17, MODAL","18, 21, ACTION","22, 71, CONTENT"]}
{"text":"Please add arrows to picture of machine - What is what.","array_agg":["11, 54, CONTENT","7, 10, ACTION"]}
{"text":"Line 346, Figure 4 - SI units/label should be on the left side","array_agg":["43, 45, ACTION","0, 8, LOCATION","10, 18, LOCATION","21, 35, CONTENT","36, 42, MODAL","53, 62, LOCATION"]}
{"text":"The author should add block diagram of proposed analysis.","array_agg":["18, 21, ACTION","11, 17, MODAL","22, 56, CONTENT"]}
{"text":"In Conclusion section","array_agg":["3, 21, LOCATION"]}
{"text":"The author should add some sentences about future analysis.","array_agg":["11, 17, MODAL","18, 21, ACTION","22, 58, CONTENT"]}
{"text":"Please add flowchart of proposed technique. Step by step (What methods are used).","array_agg":["11, 80, CONTENT","7, 10, ACTION"]}
{"text":"The authors should add photos of faults, synchronous motor, measurements, experimental setup - The paper is boring now.","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 92, CONTENT"]}
{"text":"Experimental setup should have arrows what is what.","array_agg":["26, 30, ACTION","0, 18, CONTENT","19, 25, MODAL","31, 50, CONTENT"]}
{"text":"The authors should add SI units to figures.","array_agg":["23, 31, CONTENT","12, 18, MODAL","19, 22, ACTION","35, 42, LOCATION"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["41, 44, ACTION","3, 21, LOCATION","34, 40, MODAL","45, 80, CONTENT"]}
{"text":"Please add more citations form Web of Science (2014, 2015, 2016, 2017, 2018).","array_agg":["7, 10, ACTION","11, 76, CONTENT"]}
{"text":"-Figures 8a - is not original. I saw it many times. Put another figure.","array_agg":["1, 11, LOCATION","56, 70, CONTENT","52, 55, ACTION"]}
{"text":"Figure 6 - Amplitude - missing SI units [V]?  or normalized amplitude?","array_agg":["23, 30, ACTION","0, 8, LOCATION","49, 69, CONTENT","46, 48, TRIGGER","31, 43, CONTENT","11, 20, CONTENT"]}
{"text":"Figure 10 - It is good idea to add colormap. Red is what? What range?","array_agg":["35, 43, CONTENT","63, 68, CONTENT","58, 62, TRIGGER","52, 56, TRIGGER","45, 51, CONTENT","0, 9, LOCATION","31, 34, ACTION"]}
{"text":"The authors should add photo of experimental setup OR photo of applications of proposed techniques.","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 98, CONTENT"]}
{"text":"The authors should add photos of damaged bearings etc.","array_agg":["23, 53, CONTENT","12, 18, MODAL","19, 22, ACTION"]}
{"text":"In Conclusion section","array_agg":["3, 21, LOCATION"]}
{"text":"The authors should add some sentences about future analysis.","array_agg":["12, 18, MODAL","19, 22, ACTION","23, 59, CONTENT"]}
{"text":"-please add block diagram of the proposed research-please add photo of application of the proposed research (for example for industry)-add labels and SI units to figures, for example Fig. 9 and others-please add some sentences about future analysis-too many references to J. Acoust. Soc. Am. decrease it, cite other papers from Web of Science-please cite references from 2016-2019 Web of Science (80%), different journals, please show knowledge","array_agg":["8, 11, ACTION","12, 50, CONTENT","58, 61, ACTION","355, 421, CONTENT","350, 354, ACTION","310, 342, CONTENT","305, 309, ACTION","212, 248, CONTENT","208, 211, ACTION","183, 200, LOCATION","162, 169, LOCATION","139, 158, CONTENT","62, 134, CONTENT","135, 138, ACTION"]}
{"text":"The authors should add block diagram of proposed analysis","array_agg":["19, 22, ACTION","12, 18, MODAL","23, 57, CONTENT"]}
{"text":"Figure 4 - Time - missing SI units","array_agg":["0, 8, LOCATION","18, 25, ACTION","26, 34, CONTENT","11, 15, CONTENT"]}
{"text":"Figure 11 is strange. Please put normal image.","array_agg":["29, 32, ACTION","33, 45, CONTENT","0, 9, LOCATION"]}
{"text":"The authors should write something  about Measurement of electrical signal.","array_agg":["42, 74, CONTENT","12, 18, MODAL","19, 24, ACTION"]}
{"text":"The authors should add photos of Measurement/photos of experimental setup/photos of faults.","array_agg":["19, 22, ACTION","23, 90, CONTENT","12, 18, MODAL"]}
{"text":"Please add more citations form Web of Science (2015, 2016, 2017, 2018).","array_agg":["7, 10, ACTION","11, 70, CONTENT"]}
{"text":"I used grammarly software.The text is original.The authors should add reference (1) to formula 1What is the difference between f1 and f2?Formula (5) is not clear. Please write something more about it.Please write something more about Figure 4, equpiment, parameters.Citations are from Web of Science 2016, 2017 buttoo many selfcitations to Energies.You should not cite Energies in Energies (for example I make 0 or 1). Thomson Reuters removed such journals for cheating.Moreover you should not cite one journal too much, for exampleIEEE Transaction on Conversion Energy. Please try to cite 1-3 times one journal (IEEE Transaction on Conversion Energy) no more.","array_agg":["369, 417, CONTENT","30, 34, LOCATION","59, 65, MODAL","66, 69, ACTION","70, 83, LOCATION","87, 96, LOCATION","96, 100, TRIGGER","104, 136, CONTENT","137, 148, CONTENT","149, 161, ACTION","170, 175, ACTION","176, 199, CONTENT","207, 212, ACTION","213, 227, CONTENT","234, 242, LOCATION","245, 265, CONTENT","353, 363, MODAL","364, 368, ACTION","483, 493, MODAL","494, 498, ACTION","499, 569, CONTENT","585, 589, ACTION","590, 659, CONTENT"]}
{"text":"Figure 11, 12, 7 - labels on axes OX, OY should have bigger fonts","array_agg":["53, 65, CONTENT","0, 16, LOCATION","19, 25, LOCATION","29, 40, LOCATION","41, 47, MODAL","48, 52, ACTION"]}
{"text":"The authors should add1-3 sentences about future analysis (in Conclusion Section)","array_agg":["22, 57, CONTENT","12, 18, MODAL","19, 22, ACTION","62, 80, LOCATION"]}
{"text":"Please add more new citations form Web of Science (2016, 2017, 2018, 2019).","array_agg":["7, 10, ACTION","11, 74, CONTENT"]}
{"text":"Formulas should be better described .","array_agg":["9, 15, MODAL","0, 8, LOCATION","16, 35, ACTION"]}
{"text":"Fig 21 - what is on the axis OY. - there are no label, SI units","array_agg":["9, 13, TRIGGER","0, 6, LOCATION","24, 31, LOCATION","41, 47, ACTION","48, 63, CONTENT"]}
{"text":"Fig 24. - what is formula for efficiency?","array_agg":["0, 6, LOCATION","10, 14, TRIGGER","18, 40, CONTENT"]}
{"text":"The authors should add some more text and photos of applications/analysed machine","array_agg":["11, 18, MODAL","19, 22, ACTION","23, 81, CONTENT"]}
{"text":"In Conclusion section","array_agg":["3, 21, LOCATION"]}
{"text":"The author should add some sentences about future analysis.","array_agg":["11, 17, MODAL","17, 21, ACTION","22, 58, CONTENT"]}
{"text":"Figures 9 and 10 should be better descibed .","array_agg":["0, 16, LOCATION","17, 23, MODAL","24, 43, ACTION"]}
{"text":"Figures 13 - lack of labels, SI units","array_agg":["13, 17, ACTION","0, 10, LOCATION","21, 37, CONTENT"]}
{"text":"The authors should add block diagram of proposed approach.","array_agg":["19, 22, ACTION","23, 57, CONTENT","12, 18, MODAL"]}
{"text":"The authors should add some more text and photos of applications/analysed transformer","array_agg":["23, 85, CONTENT","19, 22, ACTION","12, 18, MODAL"]}
{"text":"In Conclusion section","array_agg":["3, 21, LOCATION"]}
{"text":"The authors should add some sentences about future analysis.","array_agg":["12, 18, MODAL","23, 59, CONTENT","19, 22, ACTION"]}
{"text":"the article should be more colorful - more colourful images/figures","array_agg":["4, 11, LOCATION","12, 18, MODAL","19, 35, ACTION","38, 67, CONTENT"]}
{"text":"Please add flowchart of proposed technique. Step by step (What methods are used).","array_agg":["11, 80, CONTENT","7, 10, ACTION"]}
{"text":"The authors should add photos of applications - The paper is boring now.","array_agg":["23, 45, CONTENT","19, 22, ACTION","12, 18, MODAL"]}
{"text":"In Conclusion section the authors should put 1-3 sentences about future research.","array_agg":["3, 21, LOCATION","34, 40, MODAL","41, 44, ACTION","45, 80, CONTENT"]}
{"text":"Please add more citations form Web of Science (2015, 2016, 2017, 2018).","array_agg":["11, 70, CONTENT","7, 10, ACTION"]}
{"text":"about 50% of all. You should cite at least 20-25 references.","array_agg":["22, 28, MODAL","43, 59, CONTENT","29, 33, ACTION"]}
{"text":"Figure 2, figure 3, figure 4, figure 6, figure 7 should have SI units or OX labels.","array_agg":["61, 69, CONTENT","56, 60, ACTION","49, 55, MODAL","40, 48, LOCATION","30, 38, LOCATION","20, 28, LOCATION","10, 18, LOCATION","0, 8, LOCATION","70, 72, TRIGGER","73, 82, CONTENT"]}
{"text":"Table 4 - what is accuracy?","array_agg":["0, 7, LOCATION","15, 26, CONTENT","10, 14, TRIGGER"]}
{"text":"E=N1/N2, E= accuracy of recognition, N1 - number of test samples identified properly, N2 - number of all test samples.","array_agg":["37, 39, LOCATION","86, 88, LOCATION","12, 35, CONTENT","42, 84, CONTENT","91, 117, CONTENT","0, 7, LOCATION","9, 10, LOCATION"]}
{"text":"The authors should write something  more about SVM i BP.","array_agg":["12, 18, MODAL","19, 24, ACTION","25, 56, CONTENT"]}
