{ "text": "3) Rewrite the last sentence “scanning probe ... perovskite family”. The current one is quite confusing.  ", "labels": [[3,10,"ACTION"], [29,44,"LOCATION"], [49,67,"LOCATION"], [85,87,"ACTION"], [94,103,"ACTION"]]}
{ "text": "4) Please also elaborate some implications of the proposed experiment study, for example, by providing some suggestions for the application of the PLD in industry based on the observation in the proposed study.  ", "labels": [[10,14,"TRIGGER"], [15,24,"ACTION"], [93,102,"ACTION"]]}
{ "text": "2) The authors are required to add some in-depth analysis or discussion of the experimental observation from the perspective of theory, for example why the width of the gradient region is a monotonic increasing function of both the partition-film gap and the oxygen pressure during deposition.  ", "labels": [[19,27,"ACTION"], [31,34,"ACTION"], [58,60,"TRIGGER"], [148,151,"TRIGGER"], [223,227,"TRIGGER"], [251,254,"TRIGGER"]]}
{ "text": "1) It is better to present at least one more example, particularly the one that can validate the proposed study with a comparison with some published results;  ", "labels": [[19,26,"ACTION"], [54,66,"TRIGGER"], [75,79,"TRIGGER"]]}
{ "text": "2) The authors should end the manuscript with a conclusion to highlight the proposed study.  ", "labels": [[15,21,"MODAL"], [22,25,"ACTION"], [26,40,"LOCATION"]]}
{ "text": "1\\. In Introduction, author described past work on nanofluid technology, but little comment on the contribution and shortcoming. Author need to provide critical comments on nanofluid technology.  ", "labels": [[7,19,"LOCATION"], [73,76,"TRIGGER"], [77,91,"ACTION"], [112,115,"TRIGGER"], [136,140,"MODAL"], [144,151,"ACTION"]]}
{ "text": "1) Lines 21: “such cooling” should be “such as cooling”.  ", "labels": [[3,11,"LOCATION"], [13,27,"LOCATION"], [28,34,"MODAL"]]}
{ "text": "2) Line 24: “values of parameters” should be “values of the parameters”.  ", "labels": [[3,10,"LOCATION"], [12,34,"LOCATION"], [35,41,"MODAL"]]}
{ "text": "I have clearly pointed out these two issues in the last-round review.  ", "labels": [[51,55,"LOCATION"], [56,68,"LOCATION"]]}
{ "text": "2) It is rare to start an article with a specific work as “someone reported …”, as the authors did in the current form. They should start as below:  ", "labels": [[14,22,"ACTION"], [58,79,"LOCATION"], [125,131,"MODAL"], [132,137,"ACTION"]]}
{ "text": "1) What is “h1” in Line 179 (caption of Fig. 1)?  ", "labels": [[3,7,"TRIGGER"], [11,15,"LOCATION"], [19,27,"LOCATION"], [29,43,"LOCATION"], [45,46,"LOCATION"]]}
{ "text": "2) Make consistent font and font size for all the tables.  ", "labels": [[3,7,"ACTION"], [24,27,"TRIGGER"], [42,56,"LOCATION"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "Although the authors claimed that they had modified the English writing where necessary in the text, the English writing still needs further improvement, particularly the redundant writing style. For example:  ", "labels": [[29,33,"TRIGGER"], [127,132,"MODAL"], [141,152,"ACTION"], [154,166,"TRIGGER"]]}
{ "text": "1) Line 176: There are two “in the study” right one after the other;  ", "labels": [[3,11,"LOCATION"], [27,40,"LOCATION"]]}
{ "text": "3) Lines 248~251: Just write “Figure 4 illustrates a satisfying agreement of our proposed model and the model obtained by Parvin et al. [12].”  ", "labels": [[3,12,"LOCATION"], [13,16,"LOCATION"], [29,95,"LOCATION"], [96,99,"TRIGGER"], [100,134,"LOCATION"], [137,139,"LOCATION"]]}
{ "text": "The current form of the manuscriptis a highly ill-structured and tedious text. I will not consider publication of it until a major revision fully following my comments is made.  ", "labels": [[61,64,"TRIGGER"], [81,89,"MODAL"], [90,98,"ACTION"], [171,175,"ACTION"]]}
{ "text": "Drug development used to be quite cost and time-consuming with a large number of experimental trial and error assays [some references]. Thus, QSAR (Quantitative Structure-ActivityRelationship) has been developed to reduce the cost without synthesis or extraction [some references]. As a result, computational chemistry and virtual screening have become essentialstrategies for drug development, introducing machine learning, which has been found in many industrial applications [Fractals, 2020, 28 (2): 2050029; SPE Production & Operations, 2018, 33(4): 770-783], as a key tool in pharmaceutical research [some references].  ", "labels": [[39,42,"TRIGGER"], [100,103,"TRIGGER"], [136,140,"TRIGGER"], [231,238,"TRIGGER"], [249,251,"TRIGGER"], [319,322,"TRIGGER"]]}
{ "text": "Line 41, Page 1: “chemically stability” should be “chemical stability”;  ", "labels": [[0,7,"LOCATION"], [9,15,"LOCATION"], [17,39,"LOCATION"], [40,46,"MODAL"], [50,69,"LOCATION"]]}
{ "text": "Line 44, Page 1: “the unstable of foam system” should be “the instability of …”  ", "labels": [[0,7,"LOCATION"], [9,15,"LOCATION"], [17,46,"LOCATION"], [47,53,"MODAL"]]}
{ "text": "Line 48, Page 2: “Gel begin to be used” should be “Gel begins to be used”  ", "labels": [[0,7,"LOCATION"], [9,15,"LOCATION"], [17,39,"LOCATION"], [40,46,"MODAL"]]}
{ "text": "They are only a few examples of the fundamental errors. The authors need to go through the whole paper to correct all the mistakes.  ", "labels": [[68,72,"MODAL"], [76,86,"ACTION"], [91,102,"LOCATION"]]}
{ "text": "The authors use a number of attributive clauses in the paper, but most of themare used incorrectly. For example:  ", "labels": [[55,60,"LOCATION"], [62,65,"TRIGGER"], [74,98,"ACTION"]]}
{ "text": "This is only one example of the misuse throughout the whole article. The authors need to go through all the attributive clauses, and make necessary revisions carefully.  ", "labels": [[60,67,"LOCATION"], [81,85,"MODAL"], [89,99,"ACTION"], [129,132,"TRIGGER"], [133,137,"ACTION"]]}
{ "text": "It seems that the authors get used to connecting a few short sentences with a few commas. As a result, the sentence is presented in an awkward and incoherent manner. For example:  ", "labels": [[9,13,"TRIGGER"], [143,146,"TRIGGER"]]}
{ "text": "Line 185-187, Page 6:  ", "labels": [[0,8,"LOCATION"], [9,12,"LOCATION"], [14,20,"LOCATION"]]}
{ "text": "“The higher the viscosity modulus, the higherthe membrane viscoelasticity is, the greater the mechanical strength of the membrane is, and thestronger the self-repairing ability is.” (Original statement)  ", "labels": [[0,33,"LOCATION"], [35,76,"LOCATION"], [78,132,"LOCATION"], [134,137,"TRIGGER"], [138,158,"LOCATION"], [159,179,"LOCATION"], [180,181,"LOCATION"]]}
{ "text": "It would be better to write:  ", "labels": [[3,8,"MODAL"], [22,27,"ACTION"]]}
{ "text": "The revised sentence is concise and clearly presents the causality.  ", "labels": [[4,20,"LOCATION"], [21,31,"ACTION"], [32,35,"TRIGGER"], [44,52,"ACTION"]]}
{ "text": "Line 209-211, Page 6:  ", "labels": [[0,8,"LOCATION"], [9,12,"LOCATION"], [14,20,"LOCATION"]]}
{ "text": "“A stable gel with an appropriate strengthincreases the viscoelasticity of gelled foam, increases the structural strength of the foam liquid film, and improves the stability of the foam” (Original statement)  ", "labels": [[0,86,"LOCATION"], [88,145,"LOCATION"], [147,150,"TRIGGER"], [151,186,"LOCATION"]]}
{ "text": "A stable gel with an appropriate strength increases the viscoelasticity of the gelled foam and the strength of the foam liquid film, improving the stability of the foam consequently.  ", "labels": [[91,94,"TRIGGER"], [169,181,"TRIGGER"]]}
{ "text": "Such sentences are filled in the paper. The authors need to go through the whole paper and to make necessary revisions accordingly.  ", "labels": [[33,38,"LOCATION"], [52,56,"MODAL"], [60,70,"ACTION"], [87,90,"TRIGGER"], [94,98,"ACTION"], [119,130,"TRIGGER"]]}
{ "text": "Equations in a journal paper should be:  ", "labels": [[29,35,"MODAL"], [36,38,"ACTION"]]}
{ "text": "a) numbered consistently: some equations are numbered as “2-1”, some others are numbered as “1”, “2”, and some are not numbered (Page 5);  ", "labels": [[57,59,"LOCATION"], [60,61,"LOCATION"], [92,94,"LOCATION"], [97,100,"LOCATION"], [102,105,"TRIGGER"], [111,127,"ACTION"], [129,135,"LOCATION"]]}
{ "text": "b) presented with citations unless they are originally proposed in the paper. None of the equations in the paper are cited accordingly.  ", "labels": [[28,34,"TRIGGER"], [71,76,"LOCATION"], [107,112,"LOCATION"], [113,122,"ACTION"], [123,134,"TRIGGER"]]}
{ "text": "b) Neither Fig. 2 nor Fig. 6 is stated in the text.  ", "labels": [[11,14,"LOCATION"], [16,17,"LOCATION"], [18,21,"TRIGGER"], [22,25,"LOCATION"], [27,28,"LOCATION"], [32,38,"ACTION"], [46,50,"LOCATION"]]}
{ "text": "The introduction is not a simple pile-up of previous works. The coherence is required to link different works, and consequently to introduce the novelty and necessity of the proposed work. The authors need to:  ", "labels": [[4,16,"LOCATION"], [77,85,"ACTION"], [111,114,"TRIGGER"], [131,140,"ACTION"], [153,156,"TRIGGER"], [201,205,"MODAL"]]}
{ "text": "(1) Foam stabilization mechanism (Line 241-262, Page 9)  ", "labels": [[34,42,"LOCATION"], [43,46,"LOCATION"], [48,54,"LOCATION"]]}
{ "text": "The subtitle should start with “3”.  ", "labels": [[4,12,"LOCATION"], [13,19,"MODAL"], [20,25,"ACTION"]]}
{ "text": "(2) Please describe the “double sand pack physical model” used in Section 3.3.  ", "labels": [[11,19,"ACTION"], [24,57,"LOCATION"], [66,75,"LOCATION"], [76,77,"LOCATION"]]}
{ "text": "(3) Please elaborate Section 3.4. For example, how the proposed method cleans the crude oil.  ", "labels": [[11,20,"ACTION"], [21,30,"LOCATION"], [31,32,"LOCATION"], [47,50,"TRIGGER"]]}
{ "text": "The current form of manuscript is an awful presentation without clear structure, coherent statements, accurate presentation, or appropriate references. A major revision fully according to my comments below is required before my consideration of its publication.  ", "labels": [[20,30,"LOCATION"], [56,63,"TRIGGER"], [125,127,"TRIGGER"], [209,217,"ACTION"]]}
{ "text": "(2) The term “leak-off” has been typed as “leak of” frequently in the text, implying the authors’ carelessness.  ", "labels": [[13,18,"LOCATION"], [19,22,"LOCATION"], [70,74,"LOCATION"]]}
{ "text": "(3) Redraw all the figures to improve their quality, excluding the ones obtained by calculation. It is better to keep consistent or similar font and font size in them.  ", "labels": [[4,10,"ACTION"], [113,117,"ACTION"], [129,131,"TRIGGER"], [145,148,"TRIGGER"]]}
{ "text": "It helps the authors reorganize the literature review by answering the following questions: Why are these works relevant? Which specific problems were addressed? How are the previous results related with the proposed work? What are the outstanding, unresolved, research issues? Does the proposed study address any of the issues? Answering the questions leads to the novelty of the proposed study naturally.  ", "labels": [[92,95,"TRIGGER"], [122,127,"TRIGGER"], [162,165,"TRIGGER"], [223,227,"TRIGGER"], [278,282,"TRIGGER"], [302,309,"ACTION"]]}
{ "text": "Thus, the authors are required to make a thorough rewriting of the introduction.  ", "labels": [[0,4,"TRIGGER"], [22,30,"ACTION"], [34,38,"ACTION"]]}
{ "text": "This section includes all the necessary equations to construct the proposed model for simulation. The authors need to make the following revisions:  ", "labels": [[0,12,"LOCATION"], [110,114,"MODAL"], [118,122,"ACTION"]]}
{ "text": "(2) The authors need to clearly state that what kind of fracture model they have been used. Is it PKN or other 2D models?  ", "labels": [[16,20,"MODAL"], [32,37,"ACTION"], [38,47,"TRIGGER"], [102,104,"TRIGGER"]]}
{ "text": "(3) The authors also need to clearly state the assumptions made for simplification during the simulation, such as ignoring the proppant;  ", "labels": [[16,20,"TRIGGER"], [21,25,"MODAL"], [37,42,"ACTION"], [114,122,"ACTION"]]}
{ "text": "(4) It is astonishing to me that the authors have missed the work [API-57-2610], well known as the Carter’s model and the first equation to address leak-off. The authors should add it in the reference.  ", "labels": [[28,32,"TRIGGER"], [45,56,"ACTION"], [114,117,"TRIGGER"], [170,176,"MODAL"], [177,180,"ACTION"], [191,200,"LOCATION"]]}
{ "text": "It is quite uncomfortable to read such an awfully cumbersome English writing in the current form, including but not limited to ill sentence (Lines 17 to 18: there is no predicate in the sentence), inappropriate phrasing (Line 12), redundant word, etc. Therefore, a thorough revision of the English writing is required.  ", "labels": [[108,111,"TRIGGER"], [112,123,"ACTION"], [141,155,"LOCATION"], [221,228,"LOCATION"], [247,250,"TRIGGER"], [252,261,"TRIGGER"], [309,317,"ACTION"]]}
{ "text": "5\\. The enhancement of thermal conductivity should be figured in manuscript.  ", "labels": [[44,50,"MODAL"], [54,61,"ACTION"], [65,75,"LOCATION"]]}
{ "text": "The authors have implemented some existed methods, such as long-wavelength approximation and the subroutine of Matlab, to investigate the entropy generation in peristaltic flow of nanofluid. Although they have claimed the novelty at the end of the introduction, the current form of the manuscript is still too simple to be considered as a scientific journal paper for publication. The authors are thus required to conduct a major revision by following my comments below.  ", "labels": [[89,92,"TRIGGER"], [237,260,"LOCATION"], [306,309,"TRIGGER"], [397,401,"TRIGGER"], [414,421,"ACTION"]]}
{ "text": "The title is not sufficiently specific to present the feature of the current form of the manuscript. The viscous dissipation is a key feature of the proposed work. Thus, it is better to include “viscous dissipation” in the title.  ", "labels": [[4,9,"LOCATION"], [13,38,"ACTION"], [89,99,"LOCATION"], [164,168,"TRIGGER"], [186,193,"ACTION"], [194,215,"LOCATION"], [223,228,"LOCATION"]]}
{ "text": "3) As stated by the author themselves, the peristaltic flow is important in many applications, thus it is better to cite one or two more relative references to substantiate the statement. It is better to write the beginning of the introduction as:  ", "labels": [[95,99,"TRIGGER"], [116,120,"ACTION"], [125,127,"TRIGGER"], [204,209,"ACTION"], [214,243,"LOCATION"]]}
{ "text": "“Peristaltic flow is induced by travelling sinusoidal waves on channel walls [1]. It is found to serve in a number of applications, for example biomedical industry [2, 3], fractals porous media (Fractals, 2018, 26(2): 1840015 and Fractals, 2017, 25(3): 1750030), petroleum engineering (SPE Journal, 2017, 22(2): 645-659; SPE Production & Operations, 2018, 33(4): 770-783), and fuel- cell industry (International Journal of Hydrogen Energy, 2018, 43(37): 17880-17888), etc.”  ", "labels": [[0,76,"LOCATION"], [78,79,"LOCATION"], [226,229,"TRIGGER"], [373,376,"TRIGGER"], [449,451,"LOCATION"], [468,471,"TRIGGER"]]}
{ "text": "The font and font size of the symbols in the equations and text must be consistent.  ", "labels": [[9,12,"TRIGGER"], [45,54,"LOCATION"], [55,58,"TRIGGER"], [59,63,"LOCATION"], [64,68,"MODAL"], [72,82,"ACTION"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "4) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner, making the whole text uncomfortable to read.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"], [227,232,"LOCATION"]]}
{ "text": "The authors do need to improve their cumbersome English writing that confuses me during reading the manuscript. Following are some suggestions:  ", "labels": [[15,19,"MODAL"], [23,30,"ACTION"], [64,68,"TRIGGER"]]}
{ "text": "2) Make sure to use phrases correctly, for example “lead for” should be “lead to” (Line 100)  ", "labels": [[3,12,"ACTION"], [51,61,"LOCATION"], [62,68,"MODAL"], [83,91,"LOCATION"]]}
{ "text": "3) Construct the sentence in a clear and concise manner. For example, it reads in Lines 102 to 103:  ", "labels": [[3,12,"ACTION"], [37,40,"TRIGGER"], [82,98,"LOCATION"]]}
{ "text": "“Bejan number describing the relationship between the irreversibility of heat transfer and entropy production as a whole, is mathematically defined by Eqn. 24.”  ", "labels": [[0,1,"LOCATION"], [1,13,"ACTION"], [14,86,"LOCATION"], [87,90,"TRIGGER"], [91,120,"LOCATION"], [122,154,"LOCATION"], [156,158,"LOCATION"]]}
{ "text": "Bejan number, defined in Eqn. 24, describes the relationship between the irreversibility of heat transfer and entropy production.  ", "labels": [[0,12,"ACTION"], [14,21,"ACTION"], [25,28,"LOCATION"], [30,32,"LOCATION"], [106,109,"TRIGGER"]]}
{ "text": "The authors should carefully recheck their English, and improve it throughout the whole manuscript.  ", "labels": [[12,18,"MODAL"], [29,36,"ACTION"], [52,55,"TRIGGER"], [56,63,"ACTION"], [82,98,"LOCATION"]]}
{ "text": "In a word, the authors need to fully implement my comments to revise the manuscript. I will not consider the publication until the major revisions are made.  ", "labels": [[23,27,"MODAL"], [37,46,"ACTION"], [87,91,"MODAL"], [92,104,"ACTION"]]}
{ "text": "The topic is interesting and the results and discussion seems well. The following comments must be addressed before this manuscript is accepted. Here are the specific points that the author need to address:  ", "labels": [[25,28,"TRIGGER"], [41,44,"TRIGGER"], [91,95,"MODAL"], [99,108,"ACTION"], [174,178,"TRIGGER"], [190,194,"MODAL"], [198,205,"ACTION"]]}
{ "text": "1\\. Abstract is too lengthy. There is no focus, readers hardly understand the novelty of the paper.  ", "labels": [[4,15,"LOCATION"], [16,19,"TRIGGER"], [20,27,"LOCATION"], [38,46,"ACTION"], [56,73,"ACTION"]]}
{ "text": "3\\. In order to verify the validity of current results, authors need to compare their results with reported experimental data and models in literatures.  ", "labels": [[64,68,"MODAL"], [72,79,"ACTION"], [126,129,"TRIGGER"]]}
{ "text": "6\\. The writing English is very poor and must be improved.  ", "labels": [[24,36,"ACTION"], [37,40,"TRIGGER"], [41,45,"MODAL"], [49,57,"ACTION"]]}
{ "text": "This manuscript is written in a miserably poor manner, particularly for the grammar, word choice, and structure of sentences. As a consequence, the information is conveyed incoherently. The authors are recommended to improve their English-writing significantly, before the manuscript is considered for publication.  ", "labels": [[5,15,"LOCATION"], [55,67,"TRIGGER"], [98,101,"TRIGGER"]]}
{ "text": "The issues are summarized, but not limited, as follows:  ", "labels": [[27,30,"TRIGGER"], [31,42,"ACTION"]]}
{ "text": "a) Line 134, Page 4: it reads“..more accord with..”  ", "labels": [[3,11,"LOCATION"], [13,19,"LOCATION"], [29,30,"LOCATION"], [32,48,"LOCATION"]]}
{ "text": "The word “accord” is used as a verb or noun. It should be “more consistent with”.  ", "labels": [[9,16,"LOCATION"], [36,38,"TRIGGER"], [48,54,"MODAL"]]}
{ "text": "(3) “And” in a negative sentence:  ", "labels": [[4,5,"LOCATION"], [5,8,"TRIGGER"], [8,9,"LOCATION"]]}
{ "text": "The two “and” should be “or”.  ", "labels": [[8,9,"LOCATION"], [9,12,"TRIGGER"], [12,13,"LOCATION"], [14,20,"MODAL"], [25,27,"TRIGGER"]]}
{ "text": "a) Line 330, Page 13: it reads “There is also a certain of residual water distributes or remains ..”  ", "labels": [[3,11,"LOCATION"], [13,20,"LOCATION"], [31,40,"LOCATION"], [41,45,"TRIGGER"], [46,85,"LOCATION"], [86,88,"TRIGGER"], [89,96,"LOCATION"]]}
{ "text": "It should be “There is also a certain of residual water that distributes…”  ", "labels": [[3,9,"MODAL"], [23,27,"TRIGGER"], [56,60,"TRIGGER"]]}
{ "text": "b) Line 372, Page 14: it reads “..channels need to consumes ..”  ", "labels": [[3,11,"LOCATION"], [13,20,"LOCATION"], [31,32,"LOCATION"], [34,59,"LOCATION"]]}
{ "text": "c) Line 380, Page 15: it reads “..water is mainly occurs..”  ", "labels": [[3,11,"LOCATION"], [13,20,"LOCATION"], [31,32,"LOCATION"], [34,56,"LOCATION"]]}
{ "text": "a) Line 345, Page 14: it reads“..water film is not easy to be driven out..”  ", "labels": [[3,11,"LOCATION"], [13,20,"LOCATION"], [30,31,"LOCATION"], [33,72,"LOCATION"]]}
{ "text": "It should be: it is not easy to drive out water film…  ", "labels": [[3,9,"MODAL"], [10,12,"ACTION"]]}
{ "text": "b) Line 377-378, Page 15: it reads “ This part of… is difficult to participate ..”  ", "labels": [[3,11,"LOCATION"], [12,15,"LOCATION"], [17,24,"LOCATION"]]}
{ "text": "It should be: it is difficult for this part of … to participate…  ", "labels": [[3,9,"MODAL"], [10,12,"ACTION"]]}
{ "text": "(6) The word “given”:  ", "labels": [[13,14,"LOCATION"], [14,19,"ACTION"]]}
{ "text": "The authors use “given” for a number of times throughout the manuscript. On my first review, I have no idea what those words “given” mean. After a few iterations, I think I figure it out. For example:  ", "labels": [[61,71,"LOCATION"], [95,107,"ACTION"], [108,112,"TRIGGER"], [173,179,"LOCATION"], [180,186,"ACTION"]]}
{ "text": "The authors use numerous attributive clauses in the paper, but few are used correctly. For example:  ", "labels": [[52,57,"LOCATION"], [59,62,"TRIGGER"]]}
{ "text": "This is only one example of the misuse throughout the whole article. The authors need to go through all the attributive clauses, and make necessary revisions carefully.  ", "labels": [[60,67,"LOCATION"], [81,85,"MODAL"], [89,99,"ACTION"], [129,132,"TRIGGER"], [133,137,"ACTION"]]}
{ "text": "The authors use oral words frequently in the article, which is supposed to be a technical journal paper. As a result, the manuscript would benefit from appropriate word choice. For example:  ", "labels": [[122,132,"LOCATION"], [133,138,"MODAL"], [139,146,"ACTION"]]}
{ "text": "It is more appropriate to replace the underlined part with some written English word, such as: consequently, as a result, etc.  ", "labels": [[26,33,"ACTION"], [122,125,"TRIGGER"]]}
{ "text": "The sentences in the manuscript are generally written in an awful way.Particularly, the authors simply put some sentencesmechanically without coherence. As a result, the logic chain of the paper breaks into segments. Here are some examples:  ", "labels": [[21,31,"LOCATION"], [36,45,"TRIGGER"], [46,53,"ACTION"], [70,82,"TRIGGER"], [103,106,"ACTION"], [134,141,"TRIGGER"]]}
{ "text": "tow should be two  ", "labels": [[4,10,"MODAL"], [11,13,"ACTION"]]}
{ "text": "The two “after setting the threshold” are redundant.  ", "labels": [[8,37,"LOCATION"], [38,51,"ACTION"]]}
{ "text": "The above issues are only small portions of the writing issues of the manuscript. The authors need to carefully revise the writing before it can be reconsidered for publication.  ", "labels": [[21,25,"TRIGGER"], [66,80,"LOCATION"], [94,98,"MODAL"], [112,118,"ACTION"], [141,144,"MODAL"]]}
{ "text": "1) Line 11: change “under the investigation” to “in the investigation”.  ", "labels": [[3,10,"LOCATION"], [12,18,"ACTION"], [19,44,"LOCATION"], [48,49,"LOCATION"], [52,69,"LOCATION"]]}
{ "text": "2) Line 15: I cannot understand the sentence until I finish reading the manuscript. It should be “… parameters decrease the entropy generation and Bejan number, except …”  ", "labels": [[3,10,"LOCATION"], [14,20,"MODAL"], [21,31,"ACTION"], [87,93,"MODAL"], [97,142,"LOCATION"], [143,146,"TRIGGER"], [147,159,"LOCATION"]]}
{ "text": "4) The author’s English writing is quite cumbersome throughout the manuscript, from the abstract to the conclusion. See the “English writing” part below for details.  ", "labels": [[41,51,"ACTION"], [67,77,"LOCATION"], [88,96,"LOCATION"], [116,119,"ACTION"]]}
{ "text": "2) The author also needs to rewrite Lines 35~40 for a concise introduction of entropy-generation. It is unnecessary to elaborate the fundamentals in such a detailed way in a scientific journal paper.  ", "labels": [[14,18,"TRIGGER"], [28,35,"ACTION"], [36,44,"LOCATION"], [45,47,"LOCATION"], [104,115,"ACTION"]]}
{ "text": "4) An introduction is not a simple pile-up of the previous works. The authors need to present the works done by others coherently. It helps to answer some of the following questions: Why are these works relevant? Which specific problems were addressed? How previous results are related with the proposed work? What are the outstanding, unresolved, research questions?  ", "labels": [[78,82,"MODAL"], [86,93,"ACTION"], [143,149,"ACTION"], [183,186,"TRIGGER"], [213,218,"TRIGGER"], [253,256,"TRIGGER"], [310,314,"TRIGGER"]]}
{ "text": "5) In Line 64, change “presented” to “concluded”.  ", "labels": [[6,13,"LOCATION"], [15,21,"ACTION"], [22,33,"LOCATION"]]}
{ "text": "1) Cite a reference to an equation, unless the equation is originally proposed.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "3) Merge Sections 2~4 to a single section called “mathematical modeling”, since they are all about the modeling. The original three sections may be set as subsections in the new section.  ", "labels": [[3,8,"ACTION"], [9,19,"LOCATION"], [20,21,"LOCATION"], [74,79,"TRIGGER"], [141,144,"MODAL"], [148,151,"ACTION"], [174,185,"LOCATION"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "3) I think it is better to put the “table discussion” prior to the discussion of the results of the proposed models, since it has validated the proposed model. One has to validate the proposed model at first, and then examine the effects of various parameters by using the model.  ", "labels": [[27,30,"ACTION"], [35,53,"LOCATION"], [117,122,"TRIGGER"], [209,212,"TRIGGER"], [218,225,"ACTION"]]}
{ "text": "The authors have presented quite an awful English writing in the manuscript. It seems that the author lacks some very fundamental English grammar. They have to improve it by following the comments below.  ", "labels": [[65,75,"LOCATION"], [86,90,"TRIGGER"], [102,107,"ACTION"], [160,167,"ACTION"]]}
{ "text": "1) Capitalize the initial letter of a sentence! (Line 67)  ", "labels": [[3,13,"ACTION"], [49,56,"LOCATION"]]}
{ "text": "2) There is no comma in the objective attributive. (Line 31, etc.).  ", "labels": [[12,14,"ACTION"], [52,59,"LOCATION"], [61,64,"TRIGGER"]]}
{ "text": "5) As stated previously, use written words for a coherent and clear text.  ", "labels": [[25,28,"ACTION"], [58,61,"TRIGGER"]]}
{ "text": "In a word, I am not going to reconsider the manuscript for publication unless major revisions have been made accordingly.  ", "labels": [[29,39,"ACTION"], [71,77,"TRIGGER"], [109,120,"TRIGGER"]]}
{ "text": "The authors have presented a detailed study on the entropy analysis of MHD stagnation point flow of Casson-type nanofluid with variable thermal conductivity by using some well-known methods, such as self-similarity to transfer PDE to ODE and HAM. The current form of the manuscript, however, still needs major revisions to make it appropriate for publication. Below are my specific comments:  ", "labels": [[238,241,"TRIGGER"], [271,281,"LOCATION"], [283,290,"TRIGGER"], [298,303,"MODAL"]]}
{ "text": "Line 23: “resulting” should be “the resultant”  ", "labels": [[0,7,"LOCATION"], [9,20,"LOCATION"], [21,27,"MODAL"]]}
{ "text": "3) Although the authors have introduced many previous works, they need to present the works coherently. Answering some of the following questions helps the improvement: Why are these works relevant? Which specific problems were addressed? How previous results are related with the proposed work? What are the outstanding, unresolved, research questions?  ", "labels": [[66,70,"MODAL"], [74,81,"ACTION"], [169,172,"TRIGGER"], [199,204,"TRIGGER"], [239,242,"TRIGGER"], [296,300,"TRIGGER"]]}
{ "text": "1) An equation must be cited to a reference, unless it is originally proposed in the manuscript.  ", "labels": [[15,19,"MODAL"], [23,28,"ACTION"], [45,51,"TRIGGER"], [85,95,"LOCATION"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "1) A figure or table should be presented after it is introduced for the first time (Fig. 1 and Table 1).  ", "labels": [[12,14,"TRIGGER"], [21,27,"MODAL"], [31,40,"ACTION"], [84,87,"LOCATION"], [89,90,"LOCATION"], [91,94,"TRIGGER"], [95,102,"LOCATION"]]}
{ "text": "4) The authors write a few sentences in the way “Figure shows that…”. I have no idea what figure is the one shows something. The authors need to make the statements clear.  ", "labels": [[48,70,"LOCATION"], [123,131,"ACTION"], [130,134,"TRIGGER"], [178,182,"MODAL"], [182,186,"ACTION"]]}
{ "text": "The authors have made a number of mistakes in fundamental English grammar. They need to improve it according to the following comments:  ", "labels": [[80,84,"MODAL"], [88,95,"ACTION"]]}
{ "text": "In a word, a major revision according to my comments above is required to make me reconsider the manuscript for publication.  ", "labels": [[62,70,"ACTION"], [82,92,"ACTION"], [97,107,"LOCATION"]]}
{ "text": "The proposed study has presented interesting methods to fabricate nanofibers containing HA. Unfortunately, the current manuscript fails to present the study in a clear, concise, and coherent manner. Thus, a major revision fully according to my following comments, thus, is required for my reconsideration of publication.  ", "labels": [[92,105,"TRIGGER"], [119,129,"LOCATION"], [130,146,"ACTION"], [178,181,"TRIGGER"], [264,268,"TRIGGER"]]}
{ "text": "1) Line 10: move “respectively” to the end of the sentence.  ", "labels": [[3,10,"LOCATION"], [17,30,"LOCATION"], [35,58,"LOCATION"]]}
{ "text": "1) The introduction starts with quite an awful English writing. The authors have chosen a number of short sentences that form a cumbersome writing. It will be more coherent to start as:  ", "labels": [[7,19,"LOCATION"], [116,120,"TRIGGER"], [151,155,"MODAL"], [159,172,"ACTION"]]}
{ "text": "Electrospinning, firstly described in 1902 [1-2] and based on several electro- hydrodynamic phenomena [3], is a well-established method to fabricate nanofibers. The method utilizes the Taylor cone that is produced in a strong electric field and remains stable due to capillary forces.  ", "labels": [[49,52,"TRIGGER"], [197,201,"TRIGGER"], [241,244,"TRIGGER"]]}
{ "text": "In addition, it is inappropriate to just write “Further information is to be found in Refs...”. The authors are supposed to elaborate the coherence of the developments of the related studies.  ", "labels": [[19,35,"ACTION"], [47,82,"LOCATION"], [86,90,"LOCATION"], [93,94,"LOCATION"]]}
{ "text": "2) Nanofibrous mats are found to be widely applied for various applications. The authors, thus, should add one to two statements at the start of the second paragraph to emphasize its importance, for example:  ", "labels": [[90,94,"TRIGGER"], [96,102,"MODAL"], [103,106,"ACTION"], [129,165,"LOCATION"]]}
{ "text": "“Nanofibrous mats are found to serve in a wide range of industrial applications, for example porous materials [Powder Technology, 2019, 349:92-98; Fractals, 2019, 27(4):1950062; International Journal of Heat and Mass Transfer, 2019, 137:365-371], fuel-cell industry [International Journal of Hydrogen Energy, 2018, 43(37): 17880-17888；Fractals, 2019, 27(2):1950012], petroleum engineering [SPE Journal, 2017, 22(2): 645-659; SPE Production & Operations, 2018, 33(4): 770-783], and particularly the biomedical treatment [2 to 3 references], such as wound dressing, drug delivery or tissue engineering.  ", "labels": [[208,211,"TRIGGER"], [642,656,"TRIGGER"], [709,711,"TRIGGER"]]}
{ "text": "All the results look “making sense”. The current form, however, reads more like an experimental report, instead of a scientific journal paper. The following revisions are required.  ", "labels": [[21,22,"LOCATION"], [22,34,"ACTION"], [55,62,"TRIGGER"], [75,79,"TRIGGER"], [171,179,"ACTION"]]}
{ "text": "1) A figure or table should be presented after it is introduced in the text for the first time. The authors do not follow the basic rule of scientific writing.  ", "labels": [[12,14,"TRIGGER"], [21,27,"MODAL"], [31,40,"ACTION"], [71,75,"LOCATION"], [108,121,"ACTION"]]}
{ "text": "2) It is better to label different curves in Fig. 2 with different colors, since curves A and C overlap each other.  ", "labels": [[19,24,"ACTION"], [45,48,"LOCATION"], [50,51,"LOCATION"], [75,80,"TRIGGER"], [90,93,"TRIGGER"]]}
{ "text": "4) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner, such as “this is likely due to...”  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"], [224,246,"LOCATION"]]}
{ "text": "Above are only a few examples of the awful English writing. The author needs to go through the whole manuscript for better English writing.  ", "labels": [[71,76,"MODAL"], [80,90,"ACTION"], [95,111,"LOCATION"]]}
{ "text": "In a word, I shall not reconsider the publication until a major revision fully according to my comments has been made.  ", "labels": [[13,18,"MODAL"], [19,33,"ACTION"]]}
{ "text": "The manuscript has proposed an interesting measure to characterize polyurethane foam in an inexpensive and efficient manner. The current form, however, fails to present the proposed study in a clear, coherent, and concise manner. I will not reconsider the publication until a major revision fully according to my comments is made.  ", "labels": [[4,14,"LOCATION"], [103,106,"TRIGGER"], [143,150,"TRIGGER"], [158,168,"ACTION"], [210,213,"TRIGGER"], [232,236,"MODAL"], [237,251,"ACTION"]]}
{ "text": "1) Change “understanding” to “to understand” (Line 16);  ", "labels": [[3,9,"ACTION"], [10,11,"LOCATION"], [24,25,"LOCATION"], [29,32,"LOCATION"], [46,53,"LOCATION"]]}
{ "text": "2) Change “with” to “by” (Line 20);  ", "labels": [[3,9,"ACTION"], [10,16,"LOCATION"], [20,23,"LOCATION"], [26,33,"LOCATION"]]}
{ "text": "3) Delete the statements that present the detailed results (The pore characteristic obtained ... 0.070);  ", "labels": [[3,9,"ACTION"], [25,29,"TRIGGER"], [97,98,"LOCATION"], [99,102,"LOCATION"]]}
{ "text": "4) Rewrite the last sentence, particularly the part “the fabrication ... treatment.” The original one is quite confusing.  ", "labels": [[3,10,"ACTION"], [30,42,"TRIGGER"], [52,68,"LOCATION"], [73,82,"LOCATION"], [83,84,"LOCATION"], [111,120,"ACTION"]]}
{ "text": "3\\. Materials and methods  ", "labels": [[4,13,"LOCATION"], [14,17,"TRIGGER"]]}
{ "text": "Delete the subtitle of subsection 2.1, since there is no following subsection.  ", "labels": [[0,6,"ACTION"], [11,35,"LOCATION"], [36,37,"LOCATION"], [39,44,"TRIGGER"]]}
{ "text": "1) Please change the title of this section to “Results and discussion”, since the authors do make some discussion of the difference of the results.  ", "labels": [[10,16,"ACTION"], [30,42,"LOCATION"], [46,54,"LOCATION"], [55,58,"TRIGGER"], [59,70,"LOCATION"], [72,77,"TRIGGER"]]}
{ "text": "3) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"]]}
{ "text": "4) The authors have emphasized the “significant accuracy” of the results obtained by black box in abstract compared to those obtained by well-known scanner imaging tool. I, however, cannot find the comparison.  ", "labels": [[48,56,"LOCATION"], [98,106,"LOCATION"], [173,180,"TRIGGER"], [182,188,"MODAL"], [189,193,"ACTION"]]}
{ "text": "1) Please change the title of this section to “Remarks”, since the authors have made the discussion here more from the perspective of the evaluation of the methods  ", "labels": [[10,16,"ACTION"], [30,42,"LOCATION"], [46,54,"LOCATION"], [57,62,"TRIGGER"]]}
{ "text": "It is a detailed and interesting review/survey to investigate the energy efficient envelope solutions in green office buildings. The current form of manuscript, however, still requires a major revision according to my following comments for a clearer and more-coherent presentation.  ", "labels": [[17,20,"TRIGGER"], [149,159,"LOCATION"], [161,168,"TRIGGER"], [176,184,"ACTION"], [251,254,"TRIGGER"]]}
{ "text": "The concepts of LEED and BREEAM are involved throughout the whole original introduction, after which the terminologies are elaborated. Thus, it is better to merge the two sections into one and adjust the order of different terms for a more- coherent introduction.  ", "labels": [[21,24,"TRIGGER"], [60,87,"LOCATION"], [135,139,"TRIGGER"], [157,162,"ACTION"], [189,192,"TRIGGER"], [193,199,"ACTION"]]}
{ "text": "The authors are also suggested adding a few statements to present some attempts that have been implemented to minimize the environmental risk and climate change. A key feature is the development of unconventional energies, such as fuel cell [International Journal of Hydrogen Energy, 2018, 43(37): 17880-17888; Powder Technology, 2019, 349:92-98], shale gas [Fractals, 2019, 27(4):1950062; SPE Production & Operations, 2018, 33(4): 770-783]. Then, they shrink and concentrate the scope to the proposed study.  ", "labels": [[16,20,"TRIGGER"], [80,84,"TRIGGER"], [142,145,"TRIGGER"], [442,446,"TRIGGER"], [453,459,"ACTION"], [460,463,"TRIGGER"], [464,475,"ACTION"]]}
{ "text": "2) I am interested whether there are any mathematical, analytical, or numerical models that can investigate the POE in different conditions, particularly in indoor climate comfort conditions.  ", "labels": [[19,26,"TRIGGER"], [67,69,"TRIGGER"], [87,91,"TRIGGER"], [141,153,"TRIGGER"]]}
{ "text": "It is odd to read a scientific journal paper without a conclusion. The authors should make it by presenting the highlights of the studies concisely.  ", "labels": [[13,17,"ACTION"], [45,52,"TRIGGER"], [79,85,"MODAL"], [86,90,"ACTION"]]}
{ "text": "It is interesting to conduct an entropy analysis of CNT-based nanofluid flow with thermal radiation. The current form of manuscript, however, fails to present the proposed study in a clear and coherent manner. A major revision fully according to my following comments is then required before my reconsideration for publication.  ", "labels": [[133,140,"TRIGGER"], [142,158,"ACTION"], [189,192,"TRIGGER"]]}
{ "text": "The cumbersome introduction in the current form fails to present neither the coherence nor the novelty of the proposed work clearly.  ", "labels": [[48,64,"ACTION"], [65,72,"TRIGGER"], [87,90,"TRIGGER"]]}
{ "text": "After the short start, the authors should start the literature review, i.e. what they wrote from Line 61.  ", "labels": [[35,41,"MODAL"], [42,47,"ACTION"], [76,80,"TRIGGER"], [97,104,"LOCATION"]]}
{ "text": "4) Again, I feel quite uncomfortable reading the manuscript. The authors should improve their English writing.  ", "labels": [[3,8,"TRIGGER"], [73,79,"MODAL"], [80,87,"ACTION"]]}
{ "text": "1) Inconsistency in font size is found, for example Lines 142 to 143. I guess the authors use mathtype to type some symbols in the text. I suggest their typing the text and using mathtype only for the equations.  ", "labels": [[33,38,"ACTION"], [52,68,"LOCATION"], [131,135,"LOCATION"], [169,172,"TRIGGER"]]}
{ "text": "2) Cite a reference to an equation, unless it is originally proposed here.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "1) Table 2 is quite important to validate the proposed model. Thus, the validation should be presented before any analysis is made based on the proposed model.  ", "labels": [[3,10,"LOCATION"], [62,66,"TRIGGER"], [83,89,"MODAL"], [93,102,"ACTION"]]}
{ "text": "3) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner, for example “it is because that...” (Line 178), making the whole text uncomfortable to read.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"], [228,229,"LOCATION"], [235,247,"TRIGGER"], [253,261,"LOCATION"], [275,285,"LOCATION"]]}
{ "text": "4) Inconsistence in font size (Lines 167 to 171) and line spacing (Lines 190 to 201) are found again.  ", "labels": [[31,47,"LOCATION"], [49,52,"TRIGGER"], [67,83,"LOCATION"], [95,100,"TRIGGER"]]}
{ "text": "In a word, major revisions fully according to my comments are required before my reconsideration the manuscript for publication. The authors need to improve both the technical content and the English writing.  ", "labels": [[141,145,"MODAL"], [149,156,"ACTION"], [157,161,"TRIGGER"], [184,187,"TRIGGER"]]}
{ "text": "The scaling equations (Page 3) should also be listed separately and labeled with index number as are done for other equations.  ", "labels": [[23,29,"LOCATION"], [31,37,"MODAL"], [38,42,"TRIGGER"], [46,52,"ACTION"], [64,67,"TRIGGER"], [68,75,"ACTION"]]}
{ "text": "Label the inlet and the outlet in Fig. 3, making it appear more direct.  ", "labels": [[0,5,"ACTION"], [16,19,"TRIGGER"], [31,37,"LOCATION"], [39,40,"LOCATION"]]}
{ "text": "Line 162-163: Please elaborate why the heat convection is more intensive in a circular microchannel than that in square microchannel.  ", "labels": [[0,8,"LOCATION"], [9,12,"LOCATION"], [21,30,"ACTION"], [31,34,"TRIGGER"], [100,109,"TRIGGER"]]}
{ "text": "Line 180-181: From the figure we can know that …  ", "labels": [[0,8,"LOCATION"], [9,12,"LOCATION"], [23,29,"LOCATION"]]}
{ "text": "Simply write “The figure shows that/illustrates/demonstrates…”  ", "labels": [[13,30,"LOCATION"], [31,35,"TRIGGER"], [36,47,"LOCATION"]]}
{ "text": "Similar redundancy is full of the manuscript. The authors should check the whole manuscript and remove all the unnecessary words to make it concise.  ", "labels": [[58,64,"MODAL"], [65,70,"ACTION"], [81,91,"LOCATION"], [92,95,"TRIGGER"], [96,102,"ACTION"]]}
{ "text": "Line 257: “slightly larger” is more appropriate than “a little larger” in the original manuscript.  ", "labels": [[0,8,"LOCATION"], [10,27,"LOCATION"], [28,47,"ACTION"], [78,97,"LOCATION"]]}
{ "text": "The authors should go through the whole manuscript and replace all the oral words with formal written-style words accordingly.  ", "labels": [[12,18,"MODAL"], [19,29,"ACTION"], [40,50,"LOCATION"], [51,54,"TRIGGER"], [55,62,"ACTION"], [114,125,"TRIGGER"]]}
{ "text": "The authors use numerous attributive clauses in the paper, but few are used correctly. For example in Line 243-245:  ", "labels": [[52,57,"LOCATION"], [59,62,"TRIGGER"], [102,110,"LOCATION"], [111,114,"LOCATION"]]}
{ "text": "Figure 9 illustrates decreases in both the sensitivity coefficient of the Nu and the decline-rate of the sensitivity with an increase in the Ha, when the Ha ranges from 0.01 to 0.1, indicating a stronger regulating ability of the Ha at smaller Ha number.  ", "labels": [[0,8,"LOCATION"], [34,38,"TRIGGER"], [77,80,"TRIGGER"], [145,149,"TRIGGER"]]}
{ "text": "The revised sentence is more concise and contains all the information the authors want to present.  ", "labels": [[4,20,"LOCATION"], [29,36,"ACTION"], [37,40,"TRIGGER"]]}
{ "text": "Above are only a few examples to demonstrate the authors’misuse of the AC. The authors need to go through the whole paper to revise all the ACs accordingly.  ", "labels": [[33,44,"ACTION"], [87,91,"MODAL"], [95,97,"ACTION"], [110,121,"LOCATION"], [125,131,"ACTION"], [144,155,"TRIGGER"]]}
{ "text": "There are many extraordinarily long sentences in the manuscript. I personally categorize them into two types:  ", "labels": [[53,63,"LOCATION"], [78,88,"ACTION"]]}
{ "text": "The sentence is quite redundant and cumbersome. It is better to write:  ", "labels": [[22,31,"ACTION"], [32,35,"TRIGGER"], [36,46,"ACTION"], [64,69,"ACTION"]]}
{ "text": "Therefore, we must find a reasonable andeffective heat dissipation method to control the temperature of the electronic device for better stability andsafety during operation.  ", "labels": [[0,9,"TRIGGER"], [14,18,"MODAL"], [19,23,"ACTION"]]}
{ "text": "As shown in Figure 5, the Nu numberincreases with the Ha number at different aspect ratio of square microchannel and circularmicrochannel, because when Ha number increase, electromagnetically driving force increase, andthe flow speed of the electrolyte solution increase, and then convection heat transfer in themicrochannel is enhanced.  ", "labels": [[12,20,"LOCATION"], [113,116,"TRIGGER"], [139,151,"TRIGGER"], [272,275,"TRIGGER"]]}
{ "text": "Figure 5 demonstrates an increase in the Nu number with an increase in the Ha number regardless of the shape or aspect ratio. The latter increase results in increases in the electromagnetically driving force and the consequent flow speed of the solution, enhancing the heat convection characterized bythe Nu number.  ", "labels": [[0,8,"LOCATION"], [109,111,"TRIGGER"], [208,211,"TRIGGER"]]}
{ "text": "Similar issues are also at Line 191-192, 199-201, etc.  ", "labels": [[19,23,"TRIGGER"], [27,35,"LOCATION"], [36,39,"LOCATION"], [41,44,"LOCATION"], [45,48,"LOCATION"], [50,53,"TRIGGER"]]}
{ "text": "The authors need to check the whole paper to revise all the ill-structured sentences accordingly.  ", "labels": [[12,16,"MODAL"], [20,25,"ACTION"], [85,96,"TRIGGER"]]}
{ "text": "In a word, I cannot reconsider the publication of the manuscript until the revisions are made accordingly.  ", "labels": [[13,19,"MODAL"], [20,30,"ACTION"], [94,105,"TRIGGER"]]}
{ "text": "3.Fibers have been widely used in the industry. Fibers are found to serve in many practical applications, such as porous materials, (see [Powder Technology, 2019, 349:92-98; International Journal of Heat and Mass Transfer, 2019, 137:365-371). Authors should introduce some related knowledge to readers. I think this is essential to keep the interest of the reader.  ", "labels": [[59,64,"ACTION"], [204,207,"TRIGGER"], [251,257,"MODAL"], [258,267,"ACTION"]]}
{ "text": "The references, particularly the ASME one authored by Choi, should be cited to support the statements.  ", "labels": [[4,14,"LOCATION"], [16,28,"TRIGGER"], [60,66,"MODAL"], [70,75,"ACTION"], [79,86,"ACTION"]]}
{ "text": "The manuscript is full of jumbled statements due to incoherence, meaningless sentences due to awful English writing, and frequently-found typing mistakes due to carelessness. I feel quite uncomfortable to read the manuscript. Thus, a major revision fully according to my comments is required before my reconsideration of publication.  ", "labels": [[4,14,"LOCATION"], [117,120,"TRIGGER"], [226,230,"TRIGGER"]]}
{ "text": "1) The English writing is even too miserably awkward to make a short abstract clear to me. I can hardly get a clue of what the authors have done in their proposed study.  ", "labels": [[31,34,"TRIGGER"], [93,103,"MODAL"], [104,107,"ACTION"], [118,122,"TRIGGER"]]}
{ "text": "2) It may help to highlight the key findings of the proposed study in the abstract. On the contrary, the authors only wrote what they did, instead of something interest they found through their study.  ", "labels": [[6,9,"MODAL"], [74,82,"LOCATION"], [91,99,"TRIGGER"], [124,128,"TRIGGER"], [139,149,"TRIGGER"]]}
{ "text": "Inside the brackets are necessary references to support the statement of the applications. The authors should cite 2~3 references for each application, instead of citing a number of old references dating back over 100 years ago for the purpose of general science. Keep that in mind: this is a scientific journal paper. Concise essence is required.  ", "labels": [[103,109,"MODAL"], [110,114,"ACTION"], [152,162,"TRIGGER"], [269,273,"TRIGGER"], [338,346,"ACTION"]]}
{ "text": "2) Cite a reference to an equation, unless it is proposed here originally. The authors only did it for some of the equations.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"], [87,95,"ACTION"]]}
{ "text": "2) Make the font and font size consistent for all the equations.  ", "labels": [[3,7,"ACTION"], [17,20,"TRIGGER"]]}
{ "text": "3) What is the symbol “^” in Eq. (1)? It should be cross-product “×”.  ", "labels": [[3,7,"TRIGGER"], [22,23,"LOCATION"], [29,31,"LOCATION"], [34,35,"LOCATION"], [41,47,"MODAL"], [51,56,"ACTION"]]}
{ "text": "4) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "1) Name the section “Results and discussion”.  ", "labels": [[3,7,"ACTION"], [20,28,"LOCATION"], [29,32,"TRIGGER"], [33,44,"LOCATION"]]}
{ "text": "3) A number of “Error! Reference resource not found” is found in the section, due to the improper cross references after modification of the figures. The authors, however, are assumed to ensure the correct format before submitting the manuscript. Such mistakes explicitly indicate the authors’ carelessness.  ", "labels": [[15,21,"LOCATION"], [23,52,"LOCATION"], [56,61,"ACTION"], [69,76,"LOCATION"], [163,170,"TRIGGER"], [176,183,"ACTION"], [272,280,"ACTION"]]}
{ "text": "The authors have presented a miserably awkward English writing in the current form. They need to make a thorough revision for the improvement, otherwise no one finds it easy to understand the text.  ", "labels": [[89,93,"MODAL"], [97,101,"ACTION"], [143,152,"TRIGGER"]]}
{ "text": "The proposed study in the current form has not presented sufficiently significant mathematical essence, although it is, for sure, of interesting potential for many practical applications. Thus, a major revision fully according to my comments below is required before my consideration of its publication.  ", "labels": [[39,56,"ACTION"], [104,112,"TRIGGER"], [188,192,"TRIGGER"], [251,259,"ACTION"]]}
{ "text": "The authors should add one sentence to summarize the conclusion of the comparisons to demonstrate the advantage of their methods.  ", "labels": [[12,18,"MODAL"], [19,22,"ACTION"]]}
{ "text": "Although the results look “making sense”, the authors should dig more from what have already been demonstrated from the figures (results).  ", "labels": [[54,60,"MODAL"], [61,69,"ACTION"], [75,79,"TRIGGER"]]}
{ "text": "Secondly, the authors should present an error analysis of the method.  ", "labels": [[22,28,"MODAL"], [29,36,"ACTION"]]}
{ "text": "6 Please expand the motivation, the problem context, clarify the problem description, and (if possible) add specific objectives.  ", "labels": [[9,15,"ACTION"], [53,60,"ACTION"], [86,89,"TRIGGER"], [104,107,"ACTION"]]}
{ "text": "7\\. Please, expand the conclusions in relation to the specific goals and the future work.  ", "labels": [[12,18,"ACTION"], [23,34,"LOCATION"], [69,72,"TRIGGER"]]}
{ "text": "8\\. There are also some grammar issues in the text. The authors are required to make a revision throughout the whole manuscript to improve the English writing thoroughly and carefully.  ", "labels": [[14,18,"TRIGGER"], [46,50,"LOCATION"], [68,76,"ACTION"], [111,127,"LOCATION"], [131,138,"ACTION"], [170,173,"TRIGGER"]]}
{ "text": "The current form of manuscript is a piece of awkward presentation without clear structure, sufficient mathematical essence, or coherent statements. A major revision fully according to my comments below is required before my consideration of its publication.  ", "labels": [[20,30,"LOCATION"], [66,73,"TRIGGER"], [124,126,"TRIGGER"], [205,213,"ACTION"]]}
{ "text": "There is no background of the related study in the current introduction, for example the formation damage that has been intensively considered for developments of porous media [Powder Technology, 2019, 349: 92-98; Fractals, 2020, 28 (2): 2050029], unconventional oil and gas [SPE Production & Operations, 2018, 33(4):]. The authors need to add some background of the issues, such as formation damage, underbalanced drilling, etc.  ", "labels": [[9,22,"ACTION"], [59,71,"LOCATION"], [106,110,"TRIGGER"], [267,270,"TRIGGER"], [332,336,"MODAL"], [340,343,"ACTION"], [425,428,"TRIGGER"]]}
{ "text": "Thus, the authors are required to make a thorough rewriting of the introduction.  ", "labels": [[0,4,"TRIGGER"], [22,30,"ACTION"], [34,38,"ACTION"]]}
{ "text": "The whole section mainly repeats what the figures have already demonstrated, without an in-depth discussion of the parametric study, such as why a change in this parameter leads to a consequent change in that parameter. The authors are required to add such a discussion as a result.  ", "labels": [[4,17,"LOCATION"], [33,37,"TRIGGER"], [77,84,"TRIGGER"], [141,144,"TRIGGER"], [204,208,"TRIGGER"], [236,244,"ACTION"]]}
{ "text": "I feel confused once finishing reading the current form of the manuscript, since the novelty or significance of the proposed work has not been clearly presented in it. The authors must address the issue in the revised form. Below are some other issues that also require addressing.  ", "labels": [[16,20,"TRIGGER"], [75,80,"TRIGGER"], [93,95,"TRIGGER"], [130,160,"ACTION"], [180,184,"MODAL"], [185,192,"ACTION"], [252,261,"TRIGGER"]]}
{ "text": "The authors are required to rewrite the abstract, so that it includes the following information:  ", "labels": [[16,24,"ACTION"], [28,35,"ACTION"], [40,48,"LOCATION"], [53,57,"TRIGGER"]]}
{ "text": "The current introduction is a simple pile-up of background information. The authors are required to rewrite it with consideration of the following perspectives:  ", "labels": [[12,24,"LOCATION"], [88,96,"ACTION"], [100,107,"ACTION"]]}
{ "text": "(1) Appropriate citation is required at the beginning, for example no citation is presented to support the statements in the first paragraph. The authors should list a few citations to support the background information, particularly the very first sentence, for example [Fractals, 2020, 28 (2): 2050029; SPE Production & Operations, 2018, 33(4): 770-783] show some applications of coatings in porous media and oil industry.  ", "labels": [[28,36,"ACTION"], [44,53,"LOCATION"], [125,140,"LOCATION"], [154,160,"MODAL"], [161,165,"ACTION"], [221,233,"TRIGGER"], [407,410,"TRIGGER"]]}
{ "text": "It is interesting to investigate the features of MHD thin-film Casson nanofluid flow. Unfortunately, the current form fails to present the study in a coherent and clear manner. Thus, the authors are required to make a major revision by fully according to my following comments before my reconsideration of publication.  ", "labels": [[21,32,"ACTION"], [86,99,"TRIGGER"], [118,134,"ACTION"], [159,162,"TRIGGER"], [199,207,"ACTION"]]}
{ "text": "1) Line 11: “present work” to “the present work”;  ", "labels": [[3,10,"LOCATION"], [12,26,"LOCATION"]]}
{ "text": "2) Line 12: Give the full name of MHD and then use the short name throughout the whole manuscript, as what is done for CNT;  ", "labels": [[3,10,"LOCATION"], [12,16,"ACTION"], [38,41,"TRIGGER"], [47,50,"ACTION"], [87,97,"LOCATION"], [102,106,"TRIGGER"]]}
{ "text": "3) Line 15: “forced” to “conducted”;  ", "labels": [[3,10,"LOCATION"], [12,20,"LOCATION"], [24,25,"LOCATION"]]}
{ "text": "4) Line 22: I have no idea what the sentence is talking about. It is a highly ill- structured sentence.  ", "labels": [[3,10,"LOCATION"], [14,26,"ACTION"], [27,31,"TRIGGER"]]}
{ "text": "5) There are too many (seven) key words, make it no more than five.  ", "labels": [[9,12,"ACTION"], [13,16,"TRIGGER"], [17,21,"ACTION"], [41,45,"ACTION"], [57,61,"TRIGGER"]]}
{ "text": "In addition, the English writing is awkward. See the “English writing” part for revision.  ", "labels": [[33,43,"ACTION"], [45,48,"ACTION"]]}
{ "text": "1) Don’t put an independent equation inside text (for example, Line 96);  ", "labels": [[3,12,"ACTION"], [63,70,"LOCATION"]]}
{ "text": "2) Since Line 122, the authors presented some theoretical models, which should be moved to “Introduction”;  ", "labels": [[9,17,"LOCATION"], [72,78,"MODAL"], [82,87,"ACTION"], [91,104,"LOCATION"]]}
{ "text": "3) Put Section 2.1 (Dimensionless parameters) into “Solution methodology”, since the involved transformation is a typical method to solve non-linear PDEs;  ", "labels": [[3,6,"ACTION"], [7,16,"LOCATION"], [17,18,"LOCATION"], [51,73,"LOCATION"], [75,80,"TRIGGER"]]}
{ "text": "4) Cite a reference to an equation, unless it is proposed here originally. The authors only did it for some of the equations.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"], [87,95,"ACTION"]]}
{ "text": "5\\. Graphical results and discussion  ", "labels": [[4,21,"LOCATION"], [22,25,"TRIGGER"]]}
{ "text": "1) Redraw all the figures of results, making the font size does not differ too much in a single figure;.  ", "labels": [[3,9,"ACTION"], [59,63,"TRIGGER"], [68,74,"ACTION"], [75,78,"TRIGGER"], [79,83,"ACTION"]]}
{ "text": "Only the highlights of the key findings are needed in conclusion. The authors presented too much unnecessary information here, including self-evaluation of the novelty of the proposed study (the last item).  ", "labels": [[44,50,"ACTION"], [54,64,"LOCATION"], [88,91,"TRIGGER"], [97,108,"ACTION"], [121,125,"LOCATION"]]}
{ "text": "The authors have presented a miserably awkward English writing in the current form. They need to make a thorough revision for the improvement, particularly some fundamental mistake. For example:  ", "labels": [[89,93,"MODAL"], [97,101,"ACTION"], [143,155,"TRIGGER"]]}
{ "text": "1) Line 22: highly ill-structured sentences should be revised;  ", "labels": [[3,10,"LOCATION"], [44,50,"MODAL"], [54,61,"ACTION"]]}
{ "text": "2) Line 30: “have produce” should be “have produced”;  ", "labels": [[3,10,"LOCATION"], [12,26,"LOCATION"], [27,33,"MODAL"]]}
{ "text": "3) Line 31: “which form” should be “formed by”;  ", "labels": [[3,10,"LOCATION"], [12,24,"LOCATION"], [25,31,"MODAL"], [35,42,"ACTION"]]}
{ "text": "4) Line 38: “nanliquids” should be “nanoliquid”. Such a typo implies the authors’ carelessness.  ", "labels": [[3,10,"LOCATION"], [12,24,"LOCATION"], [25,31,"MODAL"], [35,46,"LOCATION"]]}
{ "text": "Above are only a few examples of the authors’ awful English writing. They need to check the whole manuscript and then make any necessary revisions.  ", "labels": [[74,78,"MODAL"], [82,87,"ACTION"], [98,108,"LOCATION"], [109,112,"TRIGGER"], [118,122,"ACTION"]]}
{ "text": "1\\. In Introduction, author described past work on thermal conductivity, but little comment on the contribution and shortcoming. Author need to provide critical comments on thermal conductivity.  ", "labels": [[7,19,"LOCATION"], [73,76,"TRIGGER"], [112,115,"TRIGGER"], [136,140,"MODAL"], [144,151,"ACTION"]]}
{ "text": "2\\. The author should give the key detailed experiments.  ", "labels": [[15,21,"MODAL"], [22,26,"ACTION"]]}
{ "text": "An introduction should firstly emphasize the importance of the proposed or related work. For example, it is better to start as:  ", "labels": [[3,15,"LOCATION"], [16,22,"MODAL"], [31,40,"ACTION"], [72,74,"TRIGGER"], [118,123,"ACTION"]]}
{ "text": "The subsequent sections are presented like an experimental report. The results themselves are not as import as the analysis of them. It is inappropriate to repeat what the figures have already illustrated. On the other hand, the implication based on the analysis of the results is the most valuable part in a scientific journal paper.  ", "labels": [[4,23,"LOCATION"], [38,42,"TRIGGER"], [94,100,"ACTION"], [139,162,"ACTION"], [163,167,"TRIGGER"]]}
{ "text": "As a result, the conclusion is not what a conclusion is supposed to be presented in a scientific journal paper.  ", "labels": [[13,27,"LOCATION"], [28,34,"ACTION"], [35,39,"TRIGGER"]]}
{ "text": "In addition, the English writing is cumbersomely redundant. The author is strongly suggested reading some scientific journal papers before writing one to get some basic idea how to construct it appropriately.  ", "labels": [[33,58,"ACTION"], [74,92,"ACTION"], [174,177,"TRIGGER"]]}
{ "text": "1) Line 8: “... rate was found reduce with …” There are two verbs in a single sentence. It should be “… rate was reduced with …”  ", "labels": [[3,9,"LOCATION"], [11,12,"LOCATION"], [16,128,"LOCATION"], [153,159,"MODAL"]]}
{ "text": "2) Line 11: “… exists which is …”. See the “English writing” part below for revision.  ", "labels": [[3,10,"LOCATION"], [12,60,"LOCATION"], [84,87,"ACTION"]]}
{ "text": "4) An introduction is not a simple pile-up of the previous works. The authors need to present the works done by others coherently. It helps to answer some of the following questions: Why are these works relevant? Which specific problems were addressed? How previous results are related with the proposed work? What are the outstanding, unresolved, research questions?  ", "labels": [[78,82,"MODAL"], [86,93,"ACTION"], [143,149,"ACTION"], [183,186,"TRIGGER"], [213,218,"TRIGGER"], [253,256,"TRIGGER"], [310,314,"TRIGGER"]]}
{ "text": "3\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "2) The authors need to use different written words or phrases to express causality to describe the results clearly, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner and, as a result, makes the whole text miserably uncomfortable to read.  ", "labels": [[15,19,"MODAL"], [23,26,"ACTION"], [51,53,"TRIGGER"], [172,175,"TRIGGER"], [247,250,"TRIGGER"], [275,285,"LOCATION"]]}
{ "text": "4) Line 147 reads “… therefore effects the hat transfer irreversibility which is…” I have no idea what it is talking about.  ", "labels": [[3,11,"LOCATION"], [18,23,"LOCATION"], [22,31,"TRIGGER"], [31,84,"LOCATION"], [96,101,"ACTION"], [100,104,"TRIGGER"]]}
{ "text": "The authors have presented an awful English writing in the manuscript. They have to improve it by following the comments below.  ", "labels": [[59,69,"LOCATION"], [84,91,"ACTION"]]}
{ "text": "In a word, I am not going to reconsider the manuscript for publication unless major revisions have been made accordingly. Particularly, an in-depth analysis of the results and an improved English writing are required.  ", "labels": [[16,25,"ACTION"], [29,39,"ACTION"], [71,77,"TRIGGER"], [109,120,"TRIGGER"], [122,134,"TRIGGER"], [172,175,"TRIGGER"], [208,216,"ACTION"]]}
{ "text": "1) Delete “keep this in mind” (Line 19), which makes the current form look like an informal story, instead of a formal scientific journal paper.  ", "labels": [[10,29,"LOCATION"], [31,38,"LOCATION"], [41,46,"TRIGGER"], [75,79,"TRIGGER"]]}
{ "text": "3) It is better for the authors to provide a few specific examples in engineering applications of the related works in the very beginning of the introduction, instead of simply listing a number of theoretical terms. The practical implications enhance the importance of theoretical works. The authors may find Fractals, 2018, 26(2):1840015 and SPE Journal, 2017, 22(2): 645-659 helpful to incorporate the engineering applications of the viscous dissipation in nanofluids behavior.  ", "labels": [[35,42,"ACTION"], [128,157,"LOCATION"], [159,169,"TRIGGER"], [300,303,"MODAL"], [304,308,"ACTION"], [339,342,"TRIGGER"]]}
{ "text": "2) An equation must be cited to a reference unless it is originally proposed. Some of the existed equations are not properly cited, for example Eqs. 1 to 3.  ", "labels": [[15,19,"MODAL"], [23,28,"ACTION"], [44,50,"TRIGGER"], [108,130,"ACTION"], [144,147,"LOCATION"], [149,155,"LOCATION"]]}
{ "text": "3\\. The results and discussion  ", "labels": [[4,15,"LOCATION"], [16,19,"TRIGGER"]]}
{ "text": "and in Line 167-168:  ", "labels": [[7,15,"LOCATION"], [16,19,"LOCATION"]]}
{ "text": "“Physically,with increasing mass injection the velocity and thermal gradients reduces which intern minimizethe entropy generation inside the boundary layer.”  ", "labels": [[0,11,"LOCATION"], [12,55,"LOCATION"], [56,59,"TRIGGER"], [60,155,"LOCATION"]]}
{ "text": "I have no idea what the sentences are talking about on earth. The authors need to revise the English writing in this part thoroughly and carefully. Here, I give some examples for the improvements:  ", "labels": [[15,19,"TRIGGER"], [74,78,"MODAL"], [82,88,"ACTION"], [133,136,"TRIGGER"], [156,160,"ACTION"]]}
{ "text": "(a) “the section is devoted to present…” (Line 84);  ", "labels": [[4,42,"LOCATION"], [42,49,"LOCATION"]]}
{ "text": "Simply write: the section presents …  ", "labels": [[7,12,"ACTION"], [14,25,"LOCATION"]]}
{ "text": "(b) “(gw>0) is to bring …” (Line 140)  ", "labels": [[4,5,"LOCATION"], [6,8,"LOCATION"], [9,10,"LOCATION"], [12,27,"LOCATION"], [28,36,"LOCATION"]]}
{ "text": "The authors need to use phrases expressing causality, such as: as a result, lead to, result in, etc. to explain the results/figures. Don’t use oral words like “so” as the initial word of a sentence (Line 99). For example, the authors wrote:  ", "labels": [[12,16,"MODAL"], [20,23,"ACTION"], [96,99,"TRIGGER"], [137,142,"ACTION"], [159,160,"LOCATION"], [199,206,"LOCATION"]]}
{ "text": "The statement above is awkward and undermines the coherence consequently. It is better to write:  ", "labels": [[20,30,"ACTION"], [31,34,"TRIGGER"], [35,45,"ACTION"], [60,72,"TRIGGER"], [90,95,"ACTION"]]}
{ "text": "An increase in Ec number leads to increases in temperature of both types ofnanofluids inside the boundary layer, because the former enhances the frictions between the adjacent layers. As a result, the kinetic energy is converted to the internal energy and the conversion is characterized by an increase in temperature.  ", "labels": [[62,66,"TRIGGER"], [113,120,"TRIGGER"], [252,255,"TRIGGER"]]}
{ "text": "The revised statement is more concise, and more coherent.  ", "labels": [[22,37,"ACTION"], [39,42,"TRIGGER"], [43,56,"ACTION"]]}
{ "text": "Above are only a few examples to improve the English writing, the authors need to revise the whole section accordingly, carefully and thoroughly.  ", "labels": [[74,78,"MODAL"], [82,88,"ACTION"], [93,106,"LOCATION"], [107,118,"TRIGGER"], [130,133,"TRIGGER"]]}
{ "text": "1) Heat transfer includes conduction, convection and radiation. The authors listed a number of “heat transfer” in the text. They need to specify which kind of “heat transfer” accordingly throughout the text;  ", "labels": [[49,52,"TRIGGER"], [95,110,"LOCATION"], [118,122,"LOCATION"], [129,133,"MODAL"], [137,144,"ACTION"], [175,186,"TRIGGER"], [202,206,"LOCATION"]]}
{ "text": "In a word, the authors need to revise the current manuscript by following the comments above. I will not reconsider the publication until the major revision has been made.  ", "labels": [[23,27,"MODAL"], [31,37,"ACTION"], [96,100,"MODAL"], [101,115,"ACTION"]]}
{ "text": "It is interesting to see a study of the entropy generation of CNT flow in a rotating channel with Hall and ion slip effects by using some existed models. The current form of the manuscript, however, looks more like a simple report of the results, instead of a scientific journal paper that requires in-depth discussion and analysis of the results. I am not going to consider the publication until major revisions are made according to my following comments.  ", "labels": [[103,106,"TRIGGER"], [178,188,"LOCATION"], [190,197,"TRIGGER"], [210,214,"TRIGGER"], [247,257,"TRIGGER"], [285,289,"TRIGGER"], [319,322,"TRIGGER"]]}
{ "text": "1) Lines 18 and 19: “differential equations” should be “ordinary differential equations”.  ", "labels": [[3,11,"LOCATION"], [12,15,"TRIGGER"], [16,18,"LOCATION"], [20,44,"LOCATION"], [45,51,"MODAL"]]}
{ "text": "Inside the parentheses are necessary references to support the wide applications of nanofluid. Then the authors can quickly move to the CNT nanofluid for specific introductions.  ", "labels": [[95,99,"TRIGGER"], [112,115,"MODAL"], [124,128,"ACTION"]]}
{ "text": "2) The font and font size of all the equations must be consistent.  ", "labels": [[12,15,"TRIGGER"], [29,46,"LOCATION"], [47,51,"MODAL"], [55,65,"ACTION"]]}
{ "text": "3) Merge Sections 2 to 5 to a single section named “mathematical modeling”. The four original sections can be subsections in the new section.  ", "labels": [[3,8,"ACTION"], [9,24,"LOCATION"], [103,106,"MODAL"], [107,109,"ACTION"], [129,140,"LOCATION"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "4) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner and, as a result, makes the whole text uncomfortable to read.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"], [215,218,"TRIGGER"], [243,253,"LOCATION"]]}
{ "text": "The authors have presented miserably awful English writing in the manuscript, implying that they even lack some fundamentals of English grammar. They have to improve it by following the comments below.  ", "labels": [[66,76,"LOCATION"], [87,91,"TRIGGER"], [158,165,"ACTION"]]}
{ "text": "In a word, I am not going to reconsider the manuscript for publication unless major revisions have been made according to my comments fully.  ", "labels": [[29,39,"ACTION"], [71,77,"TRIGGER"]]}
{ "text": "The homogeneous freezing of water is of great importance for a range of fields, but there remains a great deal of variability in the representation of the homogeneous freezing of water in the literature. The development of new instrumentation, such as droplet microfluidic platforms, may help to constrain our understanding of the kinetics of homogeneous freezing via the analysis of monodisperse, size-selected water droplets in temporally and spatially controlled environments. In this paper, the authors have presented an elaborated work on homogeneous freezing of water with microfluids. The topic is important, the results are interesting and the methodology followed is appropriate, while the content falls well within the scope of this Journal. In general the paper makes fair impression and my recommendation is that it merits publication in this Journal, after the following major revision:  ", "labels": [[80,83,"TRIGGER"], [284,287,"MODAL"], [441,444,"TRIGGER"], [644,647,"TRIGGER"], [689,694,"TRIGGER"], [795,798,"TRIGGER"], [820,824,"TRIGGER"]]}
{ "text": "Line 50-51, Page 2: the authors use “although” and “but” in a single sentence;  ", "labels": [[0,7,"LOCATION"], [8,10,"LOCATION"], [12,18,"LOCATION"], [36,45,"LOCATION"], [51,55,"LOCATION"]]}
{ "text": "Line 86-88, Page 2: the authors use two linking verbs in a single sentence;  ", "labels": [[0,7,"LOCATION"], [8,10,"LOCATION"], [12,18,"LOCATION"]]}
{ "text": "Line 279-280, Page 12: the authors use “because” and “so” in a single sentence;  ", "labels": [[0,8,"LOCATION"], [9,12,"LOCATION"], [14,21,"LOCATION"], [39,40,"LOCATION"], [40,47,"TRIGGER"], [53,56,"LOCATION"]]}
{ "text": "Line 283, Page 12: “maybe” should be “may be”.  ", "labels": [[0,8,"LOCATION"], [10,17,"LOCATION"], [19,26,"LOCATION"], [27,33,"MODAL"]]}
{ "text": "The authors use numerous attributive clauses in the paper, but few are used correctly. For example:  ", "labels": [[52,57,"LOCATION"], [59,62,"TRIGGER"]]}
{ "text": "This is only one example of the misuse throughout the whole article. The authors need to go through all the attributive clauses, and make necessary revisions carefully.  ", "labels": [[60,67,"LOCATION"], [81,85,"MODAL"], [89,99,"ACTION"], [129,132,"TRIGGER"], [133,137,"ACTION"]]}
{ "text": "In addition, it is cumbersome to use two consecutive attributive clauses in a single sentence in scientific writing, as the author did in Line 82-83, Page 1. It is better to rewrite the clauses as an independent sentence. For example: The agent is seldom affected by high salinity, and plugs the channel in the way of coating- absorbing on the rock skeleton.  ", "labels": [[138,145,"LOCATION"], [146,148,"LOCATION"], [150,156,"LOCATION"], [174,181,"ACTION"], [282,285,"TRIGGER"]]}
{ "text": "From Figure 6, an increase in the mass fraction of the retarder significantly prolongs the gelation time. The addition of the retarder increases the rate of chain transfer, and decreases the activity of the newly-generated free radicals consequently, leading to decreases in both rate and degree of polymerization. As a result, more time is required for gelation. In addition, the reduction in polymerization degree also shortens the chain length, resulting in a decrease in the composite modulus after cross-linking.  ", "labels": [[5,13,"LOCATION"], [173,176,"TRIGGER"], [275,279,"TRIGGER"], [285,288,"TRIGGER"], [416,420,"TRIGGER"]]}
{ "text": "2) Figures are presented without sufficient information.  ", "labels": [[3,10,"LOCATION"], [25,32,"TRIGGER"]]}
{ "text": "There are G’, G’’, and G* in Figure 3. The authors do not explicitly state that what the three symbols represent respectively, and neither does Figures 4~6.  ", "labels": [[19,22,"TRIGGER"], [29,37,"LOCATION"], [51,74,"ACTION"], [75,84,"TRIGGER"], [127,143,"TRIGGER"], [144,153,"LOCATION"], [154,155,"LOCATION"]]}
{ "text": "4) Equations should be presented with citation if they are not developed by the authors themselves.  ", "labels": [[13,19,"MODAL"], [23,32,"ACTION"]]}
{ "text": "5) It is better to discuss what the advantages the proposed results are, and how they can be used in practical applications. The authors should be cautious when writing this part. Don’t make the writing as awkward as the original manuscript, for example“the advantage of … is ..., because…, and the disadvantage of ... is ..., this is because …”  ", "labels": [[19,26,"ACTION"], [27,31,"TRIGGER"], [73,80,"TRIGGER"], [137,143,"MODAL"], [147,155,"ACTION"], [156,160,"TRIGGER"], [345,348,"TRIGGER"]]}
{ "text": "6) In order to verify the validity of current results, authors need to compare their results with reported experimental data and models in literatures.  ", "labels": [[63,67,"MODAL"], [71,78,"ACTION"], [125,128,"TRIGGER"]]}
{ "text": "The current form of the manuscript has presented a detailed experimental study of a new AEM synthesized by cross-linking PPO and functionalized cellulose. The authors, however, fail to present their work in a clear or coherent manner; therefore a revision according to my following comments is required before my reconsideration of publication.  ", "labels": [[24,34,"LOCATION"], [125,128,"TRIGGER"], [168,175,"TRIGGER"], [177,192,"ACTION"], [215,217,"TRIGGER"], [235,244,"TRIGGER"]]}
{ "text": "Line 17: “-1” in the unit should be subscript;  ", "labels": [[0,7,"LOCATION"], [9,10,"LOCATION"], [11,13,"LOCATION"], [26,32,"MODAL"], [33,45,"ACTION"]]}
{ "text": "Line 17 and 20: There two “good”, change one to “satisfactory”.  ", "labels": [[0,7,"LOCATION"], [8,11,"TRIGGER"], [12,14,"LOCATION"], [26,32,"LOCATION"], [34,40,"ACTION"]]}
{ "text": "The very first sentence has claimed some advantages of fuel cell, while the authors have not cited any references to support such a controversial claim. For example, the unconventional oil and gas have overwhelms fuel cell in the US. The statement makes sense to some extent, but it needs some citation for support.  ", "labels": [[66,71,"TRIGGER"], [89,98,"ACTION"], [189,192,"TRIGGER"], [276,279,"TRIGGER"], [283,288,"MODAL"]]}
{ "text": "Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[0,4,"ACTION"], [33,39,"TRIGGER"], [55,59,"LOCATION"]]}
{ "text": "The proposed study on the optimization of the system for 2D rotating shallow water with γ>2 can provide some interesting insights for the related research works. Unfortunately, the current form of the manuscript fails to present the study in a clear, concise, and coherent manner. As a result, a major revision fully according to my following comments is required before my reconsideration of the publication.  ", "labels": [[92,95,"MODAL"], [96,103,"ACTION"], [162,175,"TRIGGER"], [201,211,"LOCATION"], [212,228,"ACTION"], [260,263,"TRIGGER"]]}
{ "text": "1) Line 2: “equation” should be “equations”;  ", "labels": [[3,9,"LOCATION"], [11,21,"LOCATION"], [22,28,"MODAL"]]}
{ "text": "2) Revise the abstract accordingly, as a validation and a practical implementation are required in the following comments.  ", "labels": [[3,9,"ACTION"], [14,22,"LOCATION"], [23,34,"TRIGGER"], [52,55,"TRIGGER"], [87,95,"ACTION"]]}
{ "text": "1) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "2) I feel it necessary to present a comparison of the results obtained by the proposed model and that by the published model in some particular cases, for example γ=2. A satisfying match will validate the proposed work.  ", "labels": [[26,33,"ACTION"], [93,101,"TRIGGER"], [163,164,"LOCATION"]]}
{ "text": "3) It is also necessary and interesting to implement the proposed theory for a practical application. Theory with feasible applications, such as those introduced in the revised introduction above, attracts more attention and gains higher significance. At least, the author should briefly discuss how the proposed theory can be applied in practice.  ", "labels": [[9,13,"TRIGGER"], [24,27,"TRIGGER"], [43,52,"ACTION"], [221,224,"TRIGGER"], [273,279,"MODAL"], [288,295,"ACTION"], [296,299,"TRIGGER"]]}
{ "text": "1) Some basic grammatical issues are frequently found, for example incorrect form (Line 2), missing period (Line 63), and two-predicates in a single sentence (Line 160), etc.  ", "labels": [[83,89,"LOCATION"], [92,99,"ACTION"], [108,115,"LOCATION"], [118,121,"TRIGGER"], [159,167,"LOCATION"], [170,173,"TRIGGER"]]}
{ "text": "Above are only a few examples of the poor English-writing, the author is required to check the whole manuscript for improvements.  ", "labels": [[73,81,"ACTION"], [85,90,"ACTION"], [101,111,"LOCATION"]]}
{ "text": "The full range of the pages is required in the reference, if any. The author seems only writing the starting page.  ", "labels": [[31,39,"ACTION"], [47,56,"LOCATION"]]}
{ "text": "In a word, I shall not reconsider the publication until a major revision fully according to my comments has been made.  ", "labels": [[13,18,"MODAL"], [19,33,"ACTION"]]}
{ "text": "1) The abstract should be rewritten for a concise but clear panorama. From one hand, the statements need rewriting and reorganizing (see the English-writing part for detailed comments); from the other hand, add at most two statements to present the key results of the proposed work briefly.  ", "labels": [[7,15,"LOCATION"], [16,22,"MODAL"], [26,35,"ACTION"], [100,104,"MODAL"], [105,114,"ACTION"], [115,118,"TRIGGER"], [207,210,"ACTION"]]}
{ "text": "1) Redraw Fig. 1, it is way too unclear.  ", "labels": [[3,9,"ACTION"], [10,13,"LOCATION"], [15,16,"LOCATION"], [28,31,"TRIGGER"], [32,39,"ACTION"]]}
{ "text": "2) All the equations must be cited to a reference, unless it is originally proposed in the manuscript.  ", "labels": [[21,25,"MODAL"], [29,34,"ACTION"], [51,57,"TRIGGER"], [91,101,"LOCATION"]]}
{ "text": "It seems that the authors are used to writing English in a redundant manner, for example the first three sentences of the abstract. It is better to state:  ", "labels": [[9,13,"TRIGGER"], [93,130,"LOCATION"], [148,153,"ACTION"]]}
{ "text": "Other examples include but are not limited by the writing style as “something that is due to…” Simply write “something due to…”  ", "labels": [[15,22,"ACTION"], [27,42,"ACTION"], [67,77,"LOCATION"], [78,82,"TRIGGER"], [83,127,"LOCATION"]]}
{ "text": "Such a style of writing is filled in the present manuscript. The authors need a thorough revision on the issue.  ", "labels": [[41,59,"LOCATION"], [73,77,"MODAL"], [89,97,"ACTION"]]}
{ "text": "In a word, I cannot reconsider the publication of the manuscript until the revisions are made accordingly, thoroughly, and carefully.  ", "labels": [[13,19,"MODAL"], [20,30,"ACTION"], [94,105,"TRIGGER"], [119,122,"TRIGGER"]]}
{ "text": "2) Delete “As a mean … following survey”. Such a statement is too redundant. The authors have mentioned “the related study has attracted considerable attentions in the literature”. Then it is natural to start the literature review afterwards.  ", "labels": [[10,40,"LOCATION"], [59,61,"ACTION"], [62,65,"TRIGGER"], [66,75,"ACTION"], [104,179,"LOCATION"], [231,241,"TRIGGER"]]}
{ "text": "This section is overall clear, except two issues:  ", "labels": [[0,12,"LOCATION"], [16,23,"TRIGGER"], [31,37,"TRIGGER"]]}
{ "text": "1) a citation is required for each equation, unless it is originally proposed;  ", "labels": [[17,25,"ACTION"], [45,51,"TRIGGER"]]}
{ "text": "2) a formula should be listed as an independent equation, for example those in Lines 117 and 124.  ", "labels": [[13,19,"MODAL"], [23,29,"ACTION"], [79,88,"LOCATION"], [89,92,"TRIGGER"], [93,96,"LOCATION"]]}
{ "text": "4\\. Results and Discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "and in Line 248-249:  ", "labels": [[7,15,"LOCATION"], [16,19,"LOCATION"]]}
{ "text": "“The average Nusselt number, Fig. 12, manifests noticeable the influence of the number of undulation for a still cylinder,.”  ", "labels": [[0,27,"LOCATION"], [29,32,"LOCATION"], [34,36,"LOCATION"], [38,121,"LOCATION"]]}
{ "text": "5) “lesser” in Line 243 should be “less”.  ", "labels": [[3,11,"LOCATION"], [15,23,"LOCATION"], [24,30,"MODAL"]]}
{ "text": "2) It is more accurate to write “effect is less significant” than “effect is less” (Line 305).  ", "labels": [[32,60,"LOCATION"], [66,81,"LOCATION"], [84,92,"LOCATION"]]}
{ "text": "It is also rare to use two consecutive ACs in a single sentence, for example (Line 254-255):  ", "labels": [[6,10,"TRIGGER"], [78,86,"LOCATION"], [87,90,"LOCATION"]]}
{ "text": "The authors seem prefer a redundant writing style which is a critical issue of the current manuscript. For example, in Line 90~91:  ", "labels": [[119,126,"LOCATION"], [127,129,"LOCATION"]]}
{ "text": "Another example is in Line 162~163:  ", "labels": [[22,30,"LOCATION"], [31,34,"LOCATION"]]}
{ "text": "“for all computations in this paper for similar problems to this subsection, the G6 uniform grid is employed.”  ", "labels": [[0,75,"LOCATION"], [77,108,"LOCATION"]]}
{ "text": "This sentence is too awful to read, just write:  ", "labels": [[14,16,"ACTION"], [17,20,"TRIGGER"], [21,26,"ACTION"], [41,46,"ACTION"]]}
{ "text": "the G6 uniform grid is employed for all computations in this paper.  ", "labels": [[23,31,"ACTION"], [56,66,"LOCATION"]]}
{ "text": "In a word, the authors need to revise the current manuscript by following the comments above. I will not reconsider the publication until the major revision has been made.  ", "labels": [[23,27,"MODAL"], [31,37,"ACTION"], [96,100,"MODAL"], [101,115,"ACTION"]]}
{ "text": "It is an interesting study to investigate the effects of magnetic field on unsteady free convection of nanofluid in an inclined U-shaped cavity with discrete heating source. The current form of manuscript, however, fails to be presented in a clear, concise, and coherent manner. A major revision fully according to my following comments, thus, is required for my reconsideration of publication.  ", "labels": [[194,204,"LOCATION"], [206,213,"TRIGGER"], [215,223,"ACTION"], [227,236,"ACTION"], [258,261,"TRIGGER"], [338,342,"TRIGGER"]]}
{ "text": "One statement of the background or the significance of the study should be added at the beginning of the abstract. The author should not start the abstract with the proposed study directly.  ", "labels": [[32,34,"TRIGGER"], [65,71,"MODAL"], [75,80,"ACTION"], [84,113,"LOCATION"], [126,132,"MODAL"], [133,142,"ACTION"], [147,155,"LOCATION"]]}
{ "text": "Inside the brackets are some necessary recent references to support the statement. Each application should be cited by 2 to 3 references.  ", "labels": [[100,106,"MODAL"], [110,115,"ACTION"]]}
{ "text": "Another issue of the introduction in the current form is the inappropriate citation. For example, it is quite astonishing to cite 21 references at a single place (the last second paragraph of the introduction). The authors are required to either only keep 2 to 3 key references or to elaborate the presented references.  ", "labels": [[21,33,"LOCATION"], [110,121,"ACTION"], [167,208,"LOCATION"], [227,235,"ACTION"], [239,245,"TRIGGER"], [278,280,"TRIGGER"]]}
{ "text": "The last paragraph should also be rewritten. A scientific journal paper is seldom presented in such a manner. A concise introduction of the structure of the whole manuscript is usually presented here.  ", "labels": [[4,18,"LOCATION"], [19,25,"MODAL"], [26,30,"TRIGGER"], [34,43,"ACTION"], [72,91,"ACTION"], [185,194,"ACTION"], [195,199,"LOCATION"]]}
{ "text": "1) Make consistent font and font size in the manuscript. The statements in the equations are from those in the texts.  ", "labels": [[3,7,"ACTION"], [24,27,"TRIGGER"], [45,55,"LOCATION"], [79,88,"LOCATION"]]}
{ "text": "2) Cite a reference to an equation, unless it is originally proposed here.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "The authors should cite a reference to support their claim that the relaxation factor is reported to be 0.7.  ", "labels": [[12,18,"MODAL"], [19,23,"ACTION"], [59,63,"TRIGGER"]]}
{ "text": "3) There is a large number of confusing statements such as “A increases with B”. The authors should make it clear that A increases with an increase or decrease in B.  ", "labels": [[59,79,"LOCATION"], [93,99,"MODAL"], [100,113,"ACTION"], [114,118,"TRIGGER"], [148,150,"TRIGGER"]]}
{ "text": "The authors have presented an awkward English writing in the current form. They need to make a thorough revision for the improvement, particularly some fundamental mistake. For example:  ", "labels": [[80,84,"MODAL"], [88,92,"ACTION"], [134,146,"TRIGGER"]]}
{ "text": "2) No period between sentences, e.g. the second line of the first paragraph in the introduction.  ", "labels": [[3,12,"ACTION"], [41,95,"LOCATION"]]}
{ "text": "Above are only a few examples of the awful English writing. The author needs to check the whole manuscript and then make any necessary revisions.  ", "labels": [[71,76,"MODAL"], [80,85,"ACTION"], [96,106,"LOCATION"], [107,110,"TRIGGER"], [116,120,"ACTION"]]}
{ "text": "The current introduction is nothing but a pile-up of background information. The authors are required to rewrite it with consideration of the three perspectives:  ", "labels": [[12,24,"LOCATION"], [25,35,"ACTION"], [105,112,"ACTION"]]}
{ "text": "(1) Appropriate citation is required at the beginning, for example no citation is presented to support the statement that plastic material is found from 1870.  ", "labels": [[28,36,"ACTION"], [117,121,"TRIGGER"]]}
{ "text": "In addition, the three advanced packaging technologies are all derived from the artificial intelligence technology associated with recent advances of the computer science. The authors should write one paragraph to introduce it briefly, for example:  ", "labels": [[184,190,"MODAL"], [191,196,"ACTION"], [214,223,"ACTION"]]}
{ "text": "The artificial intelligence technology, associated with recent advances of the computer science, are found to serve in a number of practical applications, for example: porous materials [Fractals, 2020, 28 (2): 2050029; medical science [2 to 3 references], and food industry, which is our concentration of in the paper.  ", "labels": [[101,106,"ACTION"], [256,259,"TRIGGER"]]}
{ "text": "The current form of manuscript has presented a detailed experimental study of the wear behavior of PVD coated carbide tools during Ti6A14V machining with intensive BUE formation. The whole text, however, reads like an experimental report or manual on the application of the PVD CrN coating for very specific material machining. I feel a major revision should be made for publication of such a work as a scientific journal paper:  ", "labels": [[20,30,"LOCATION"], [183,193,"LOCATION"], [195,202,"TRIGGER"], [210,214,"TRIGGER"], [238,240,"TRIGGER"], [352,358,"MODAL"], [362,366,"ACTION"]]}
{ "text": "The authors have presented a cumbersome English writing in the current form, making the manuscript hard to understand.  ", "labels": [[88,98,"LOCATION"], [99,117,"ACTION"]]}
{ "text": "The current form of the manuscript has presented a detailed work on optimizing encapsulation of the inhibitor BRP-187. The coherence, however, is not clear in the current form. A thorough revision is thus required for my reconsideration of the publication.  ", "labels": [[24,34,"LOCATION"], [134,141,"TRIGGER"], [143,155,"ACTION"], [200,204,"TRIGGER"]]}
{ "text": "1) The authors need to reorganize the current introduction, which normally consists of three parts at least: background, literature review, brief of the proposed work. The current one is nothing but a literature review. Some background should be added at the beginning, such as a short introduction of nanofluid, for example:  ", "labels": [[15,19,"MODAL"], [46,58,"LOCATION"], [236,242,"MODAL"], [246,251,"ACTION"], [255,268,"LOCATION"]]}
{ "text": "Although the results look “making sense”, the current form reads like a lab report. The authors should dig deeper in the results by presenting some in- depth discussion, such as implications of the results.  ", "labels": [[26,27,"LOCATION"], [27,33,"ACTION"], [34,39,"LOCATION"], [65,69,"TRIGGER"], [96,102,"MODAL"], [103,113,"ACTION"], [121,128,"LOCATION"]]}
{ "text": "2\\. Heat transport in geo-materials is known of dual-phase-lagging type. The Fourier’s law of heat conduction is valid only for some limiting cases. The author may consider acknowledge this limitation in this paper.  ", "labels": [[4,21,"LOCATION"], [160,163,"MODAL"], [173,184,"ACTION"]]}
{ "text": "Based on proposed pathway of energy transfer and thermal-electrical analogy concepts, an alternative approach to determine the TOT is obtained. The topic may be interesting and the results and discussion seems well. The following comments should be addressed before this manuscript is accepted.  ", "labels": [[45,48,"TRIGGER"], [173,176,"TRIGGER"], [189,192,"TRIGGER"], [239,245,"MODAL"], [249,258,"ACTION"]]}
{ "text": "1\\. In Introduction, author described past work on TOT and HST, but little comment on the contribution and shortcoming. Author need to provide critical comments on TOT and HST.  ", "labels": [[7,19,"LOCATION"], [55,58,"TRIGGER"], [64,67,"TRIGGER"], [103,106,"TRIGGER"], [127,131,"MODAL"], [135,142,"ACTION"], [168,171,"TRIGGER"]]}
{ "text": "3\\. Heat transport in geo-materials is known of dual-phase-lagging type. The Fourier’s law of heat conduction is valid only for some limiting cases. The author may consider acknowledge this limitation in this paper.  ", "labels": [[4,21,"LOCATION"], [160,163,"MODAL"], [173,184,"ACTION"]]}
{ "text": "It is overall an interesting study to investigate the entropy generation of 3D non- Newtonian MHD nanofluids with simultaneous effects of chemical species and non- linear thermal radiation past an exponential stretched surface. The current form of the manuscript, however, still needs major revisions to make it suitable for publication as a scientific journal paper. Please see the comments below for revisions.  ", "labels": [[6,13,"TRIGGER"], [38,49,"ACTION"], [155,158,"TRIGGER"], [252,262,"LOCATION"], [264,271,"TRIGGER"], [279,284,"MODAL"], [375,378,"ACTION"]]}
{ "text": "4) It is quite inappropriate to make such a self-evaluation claiming that “our study is novel” in the last paragraph. In addition, the English is also cumbersome. I write a new paragraph for the authors’ reference:  ", "labels": [[15,28,"ACTION"], [69,73,"TRIGGER"], [74,94,"LOCATION"], [102,116,"LOCATION"], [146,150,"TRIGGER"], [165,170,"ACTION"]]}
{ "text": "The literature review above indicates that few studies has been made on three- dimensional viscoelastic nanofluid flows associated with entropy generation and nonlinear thermal radiation past an exponential stretched surface. Therefore, we present our study on such an investigation by solving the proposed model analytically with three dimensionless parameters (Section 2); and examining the effects of different parameters (Section 3).  ", "labels": [[38,42,"TRIGGER"], [155,158,"TRIGGER"], [226,235,"TRIGGER"], [363,372,"LOCATION"], [375,378,"TRIGGER"], [379,388,"ACTION"], [426,435,"LOCATION"]]}
{ "text": "5) The font size is inconsistent in the introduction (Line 84~91).  ", "labels": [[17,32,"ACTION"], [40,52,"LOCATION"], [54,61,"LOCATION"], [62,64,"LOCATION"]]}
{ "text": "6) Give the full name of the abbreviation MHD when it is firstly presented.  ", "labels": [[3,7,"ACTION"], [46,50,"TRIGGER"]]}
{ "text": "1) All the equations must be cited to a reference, unless it is originally proposed in the manuscript.  ", "labels": [[21,25,"MODAL"], [29,34,"ACTION"], [51,57,"TRIGGER"], [91,101,"LOCATION"]]}
{ "text": "2) Keep the font size consistent in all the equations.  ", "labels": [[3,7,"ACTION"], [36,53,"LOCATION"]]}
{ "text": "3) Redraw Fig. 1, since the significant difference of the font size makes it uncomfortable to read it.  ", "labels": [[3,9,"ACTION"], [10,13,"LOCATION"], [15,16,"LOCATION"], [18,23,"TRIGGER"]]}
{ "text": "4) Merge Sections 2 to 5 into a single section, since they are all about the model, i.e. the tool to make the “entropy analysis”. The authors may rename the new section if they feel necessary.  ", "labels": [[3,8,"ACTION"], [9,24,"LOCATION"], [48,53,"TRIGGER"], [110,128,"LOCATION"], [142,145,"MODAL"], [146,152,"ACTION"]]}
{ "text": "3\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "Although the results look “making sense” and the authors made their efforts to explain the results from the perspective of physics, the explanations are given in quite an awful way. Thorough revisions are required for this part.  ", "labels": [[26,27,"LOCATION"], [27,33,"ACTION"], [34,39,"LOCATION"], [41,44,"TRIGGER"], [205,213,"ACTION"]]}
{ "text": "2) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner and, as a result, makes the whole text miserably uncomfortable to read.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"], [215,218,"TRIGGER"], [243,253,"LOCATION"]]}
{ "text": "The authors may rewrite the sentence by following the original way:  ", "labels": [[12,15,"MODAL"], [16,23,"ACTION"]]}
{ "text": "The authors need to rewrite this section by improving the English writing accordingly, thoroughly, and carefully.  ", "labels": [[12,16,"MODAL"], [20,27,"ACTION"], [28,40,"LOCATION"], [74,85,"TRIGGER"], [99,102,"TRIGGER"]]}
{ "text": "The font is inconsistent in this section. Some are Times New Roman and others seem Calibri. The author MUST make the font and font size consistent in the text!  ", "labels": [[28,40,"LOCATION"], [67,70,"TRIGGER"], [103,107,"MODAL"], [108,112,"ACTION"], [122,125,"TRIGGER"], [154,158,"LOCATION"]]}
{ "text": "In a word, I am not going to reconsider the manuscript for publication unless major revisions have been made accordingly.  ", "labels": [[29,39,"ACTION"], [71,77,"TRIGGER"], [109,120,"TRIGGER"]]}
{ "text": "1\\. In Introduction, author described past work, but little comment on the contribution and shortcoming. Author need to provide critical comments.  ", "labels": [[7,19,"LOCATION"], [49,52,"TRIGGER"], [60,67,"ACTION"], [88,91,"TRIGGER"], [112,116,"MODAL"], [120,127,"ACTION"]]}
{ "text": "2\\. In order to verify the validity of current results, authors need to compare their results with reported experimental data and models in literatures.  ", "labels": [[64,68,"MODAL"], [72,79,"ACTION"], [126,129,"TRIGGER"]]}
{ "text": "4\\. The format of References should be united.  ", "labels": [[29,35,"MODAL"], [39,45,"ACTION"]]}
{ "text": "The current form of the manuscript indicates that the authors have no idea on how to construct a scientific journal paper in appropriate written English. A thorough revision is thus required for my reconsideration of the publication.  ", "labels": [[24,34,"LOCATION"], [45,49,"TRIGGER"], [78,81,"TRIGGER"], [177,181,"TRIGGER"]]}
{ "text": "The abstract needs rewriting, since the current one is presented without coherence and in cumbersome English.  ", "labels": [[4,12,"LOCATION"], [13,18,"MODAL"], [19,28,"ACTION"], [30,35,"TRIGGER"], [65,72,"TRIGGER"], [83,86,"TRIGGER"]]}
{ "text": "1) The references should be cited from 1, instead of 19. In addition, the authors should present the current references in Russian (e.g. Ref. #6) in English.  ", "labels": [[18,24,"MODAL"], [28,33,"ACTION"], [42,52,"TRIGGER"], [82,88,"MODAL"], [89,96,"ACTION"], [137,140,"LOCATION"], [143,144,"LOCATION"]]}
{ "text": "3) Besides the literature review, some background information should also be presented. For example, the authors should introduce some examples of applications of constructional polymer, such as in porous materials [Fractals, 2020, 28 (2): 2050029] and petroleum engineering [SPE Production & Operations, 2018, 33(4): 770-783;].  ", "labels": [[3,10,"TRIGGER"], [62,68,"MODAL"], [69,73,"TRIGGER"], [77,86,"ACTION"], [113,119,"MODAL"], [120,129,"ACTION"], [249,252,"TRIGGER"]]}
{ "text": "Although the results look “making sense”, the current form reads like a simple lab report at graduate level. The authors should dig deeper in the results by presenting some in-depth discussion.  ", "labels": [[26,40,"LOCATION"], [65,69,"TRIGGER"], [121,127,"MODAL"], [128,138,"ACTION"], [146,153,"LOCATION"]]}
{ "text": "The current English writing is awfully cumbersome. The authors need to get a native English speaker for the thorough revision.  ", "labels": [[63,67,"MODAL"], [71,74,"ACTION"]]}
{ "text": "Change the “energy dissipation” to “viscous dissipation”, since the latter is more specific.  ", "labels": [[0,6,"ACTION"], [11,31,"LOCATION"], [35,55,"LOCATION"], [58,63,"TRIGGER"]]}
{ "text": "1) All the equations must be cited to a reference, unless it is originally proposed in the manuscript.  ", "labels": [[21,25,"MODAL"], [29,34,"ACTION"], [51,57,"TRIGGER"], [91,101,"LOCATION"]]}
{ "text": "1) Change the name of this section to “Results and discussion”. The authors are discussing the results essentially, instead of “graphs”.  ", "labels": [[3,9,"ACTION"], [22,34,"LOCATION"], [38,46,"LOCATION"], [47,50,"TRIGGER"], [51,62,"LOCATION"], [116,123,"TRIGGER"], [127,135,"LOCATION"]]}
{ "text": "In a word, major revisions have to be made accordingly before the manuscript can be reconsidered for publication.  ", "labels": [[38,42,"ACTION"], [43,54,"TRIGGER"], [55,76,"LOCATION"], [77,80,"MODAL"], [84,96,"ACTION"]]}
{ "text": "2\\. In order to verify the validity of current experimental results, authors need to compare their results with reported experimental data and models in literatures.  ", "labels": [[77,81,"MODAL"], [85,92,"ACTION"], [139,142,"TRIGGER"]]}
{ "text": "The proposed study has demonstrated some interesting results for heat transfer and entropy generation in conventional and hybrid nanoflows. The current manuscript, however, fails to present the formulation and the parametric study in a clear, concise, and coherent manner. A major revision fully according to my following comments, thus, is required for my reconsideration of publication.  ", "labels": [[79,82,"TRIGGER"], [118,121,"TRIGGER"], [164,171,"TRIGGER"], [179,189,"ACTION"], [206,209,"TRIGGER"], [252,255,"TRIGGER"], [332,336,"TRIGGER"]]}
{ "text": "1) Line 18: delete “advanced”. The concept of hybrid nanofluid is not “advanced”.  ", "labels": [[3,10,"LOCATION"], [19,29,"LOCATION"], [70,71,"LOCATION"], [79,80,"LOCATION"]]}
{ "text": "The introduction has been presented in an incoherent and insufficient manner. There are some major issues that need addressing for the introduction.  ", "labels": [[4,16,"LOCATION"], [53,56,"TRIGGER"], [106,110,"TRIGGER"], [111,115,"MODAL"], [116,126,"ACTION"], [131,147,"LOCATION"]]}
{ "text": "2) The authors should also answer some basic questions, particularly why nanofluid is preferred in the related study? Thus, it is better to insert the following statements in the introduction of nanofluid:  ", "labels": [[15,21,"MODAL"], [22,26,"TRIGGER"], [27,33,"ACTION"], [56,72,"TRIGGER"], [118,122,"TRIGGER"], [140,146,"ACTION"], [179,191,"LOCATION"]]}
{ "text": "“Nanofluid, pioneered by Choi [20] who discovered its significant increase in heat-transfer properties compared to conventional engineered fluid, has found to serve in a wide range of engineering applications, for example porous materials [Powder Technology, 2019, 349:92-98], fuel-cell industry [International Journal of Hydrogen Energy, 2018, 43(37): 17880-17888], petroleum engineering [SPE Journal, 2017, 22(2): 645-659], and coolants for devices.  ", "labels": [[0,10,"LOCATION"], [12,29,"LOCATION"], [31,33,"LOCATION"], [35,38,"TRIGGER"], [426,429,"TRIGGER"]]}
{ "text": "The applications listed help improve the significance of the proposed work, and inside the brackets are necessary references to support the statements.  ", "labels": [[29,36,"ACTION"], [76,79,"TRIGGER"]]}
{ "text": "1) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "3) Lines 111 to 112 is in a larger font size, make it the same as the text.  ", "labels": [[3,19,"LOCATION"], [46,50,"ACTION"]]}
{ "text": "4) Where does Eq. 7 come from? There is no introduction information of the equation.  ", "labels": [[3,13,"TRIGGER"], [14,16,"LOCATION"], [18,19,"LOCATION"], [40,67,"ACTION"], [75,83,"LOCATION"]]}
{ "text": "Results and discussion  ", "labels": [[0,7,"LOCATION"], [8,11,"TRIGGER"]]}
{ "text": "1) delete the “physical” in the title.  ", "labels": [[3,9,"ACTION"], [14,24,"LOCATION"], [32,37,"LOCATION"]]}
{ "text": "Above are only a few examples of the awful English writing. The author needs to go through the whole manuscript for better English writing.  ", "labels": [[71,76,"MODAL"], [80,90,"ACTION"], [95,111,"LOCATION"]]}
{ "text": "In a word, I shall not reconsider the publication until a major revision fully according to my comments has been made.  ", "labels": [[13,18,"MODAL"], [19,33,"ACTION"]]}
{ "text": "Organophosphorus compounds (OP), i.e., organophosphates, organophosphonates, organophosphinates, organoposphine oxide, and organophosphites, are currently being intensively investigated as flame retardant alternatives for polymeric substrates to persistent, bioaccumulative, and toxic (PBT) halogenated flame retardants for application in polymeric substrates. In this paper, the aim of this investigation was to evaluate the antibacterial and antifungal activity, cytotoxicity, leaching and ecotoxicity of novel flame retardant polyamide 6 (PA6) textile fibers developed by the  ", "labels": [[119,122,"TRIGGER"], [275,278,"TRIGGER"], [364,374,"LOCATION"], [440,443,"TRIGGER"], [488,491,"TRIGGER"]]}
{ "text": "5.The thermal conductivity increases for all samples cured under pressure, but the mechanism responsible depends on the composite system: for epoxy-diamine composites, the increase results principally from a reduction in the void content; for the epoxy-thiol system with BN platelets, the increase results from an improved matrix-particle interface; for the epoxy-thiol system with BN ag- glomerates, which has a thermal conductivity greater than 10W/mKat 44.7 vol.% filler content, the agglomerates are deformed to give a significantly increased area of contact. The authors should give some explanation on above results and analyze the physical mechanism in detail.  ", "labels": [[75,78,"TRIGGER"], [442,446,"TRIGGER"], [576,582,"MODAL"], [583,587,"ACTION"], [622,625,"TRIGGER"], [626,633,"ACTION"]]}
{ "text": "6 Please expand the motivation, the problem context, clarify the problem description, and (if possible) add specific objectives.  ", "labels": [[9,15,"ACTION"], [53,60,"ACTION"], [86,89,"TRIGGER"], [104,107,"ACTION"]]}
{ "text": "Incoherence, cumbersome English writing, typos are frequently found in the manuscript, which needs a thorough revision to make it suitable for publication. The author should follow my comments fully for the revisions.  ", "labels": [[75,85,"LOCATION"], [87,92,"TRIGGER"], [93,98,"MODAL"], [110,118,"ACTION"], [167,173,"MODAL"], [174,180,"ACTION"]]}
{ "text": "The abstract is presented without focuses that explicitly show the key findings of the proposed study. The author simply lists some parameters that have been examined. In addition, the small abstract is full of surprising grammar issues. See the English writing part below for details.  ", "labels": [[4,12,"LOCATION"], [26,33,"TRIGGER"], [42,46,"TRIGGER"], [58,62,"ACTION"], [143,147,"TRIGGER"], [238,241,"ACTION"]]}
{ "text": "It is also astonishing to me that the author has missed the last reference above mentioned by me. The reference authored by Choi is widely accepted as the first publication that introduces the concept of “nanofluid”. Any study on nanofluid should not miss this reference. The author has definitely presented an incomplete literature review by doing so; even he/she lists a number of studies after the start.  ", "labels": [[6,10,"TRIGGER"], [29,33,"TRIGGER"], [45,55,"ACTION"], [60,74,"LOCATION"], [173,177,"TRIGGER"], [240,250,"MODAL"], [251,255,"ACTION"]]}
{ "text": "The procedure looks “making sense”. On the other hand, the author needs to pay attention to some fundamentals of writing an English scientific paper.  ", "labels": [[20,34,"LOCATION"], [66,71,"MODAL"], [75,88,"ACTION"]]}
{ "text": "1) Make consistent font and font size in the manuscript. The symbols used for mathematical operations are quite different from the texts.  ", "labels": [[3,7,"ACTION"], [24,27,"TRIGGER"], [45,55,"LOCATION"], [102,121,"ACTION"]]}
{ "text": "2) Cite a reference to an equation, unless it is originally proposed here.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "3) Adjust the location of the figures to ensure there is not almost half-page blank (below Line 100).  ", "labels": [[3,9,"ACTION"], [91,99,"LOCATION"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "1) Enlarge the font size of texts in the legends and the numbers on the axes in Figs 2 to 15. They are too small to read clearly.  ", "labels": [[3,10,"ACTION"], [41,48,"LOCATION"], [49,52,"TRIGGER"], [72,92,"LOCATION"], [99,102,"ACTION"], [103,106,"TRIGGER"], [107,112,"ACTION"]]}
{ "text": "The authors have presented a miserably awkward English writing in the current form. They need to make a thorough revision for the improvement, particularly some fundamental mistake. For example:  ", "labels": [[89,93,"MODAL"], [97,101,"ACTION"], [143,155,"TRIGGER"]]}
{ "text": "1) Lines 15-16: no predicate in a sentence;  ", "labels": [[3,11,"LOCATION"], [12,14,"LOCATION"]]}
{ "text": "2) Lines 21: “is decreases” should be “decreases”;  ", "labels": [[3,11,"LOCATION"], [13,27,"LOCATION"], [28,34,"MODAL"]]}
{ "text": "3) Lines 30-31: two predicates in a sentence;  ", "labels": [[3,11,"LOCATION"], [12,14,"LOCATION"]]}
{ "text": "There are also some annoying typos, for example “naofluid” should be nanofluid (Line 10), ODES should be ODEs. Such typos imply the author’s carelessness.  ", "labels": [[10,14,"TRIGGER"], [48,58,"LOCATION"], [59,65,"MODAL"], [69,78,"ACTION"], [80,87,"LOCATION"], [95,101,"MODAL"], [122,127,"ACTION"]]}
{ "text": "Above are only a few examples of the awful English writing. The author needs to check the whole manuscript and then make any necessary revisions.  ", "labels": [[71,76,"MODAL"], [80,85,"ACTION"], [96,106,"LOCATION"], [107,110,"TRIGGER"], [116,120,"ACTION"]]}
{ "text": "The manuscript has proposed a detailed laboratory study on the high-frequency pressure oscillation of combustion of DI diesel engine. The current form, however, fails to present the study in a coherent, clear, and concise manner. A major revision fully according to my following comments, thus, is required for my reconsideration of publication.  ", "labels": [[4,14,"LOCATION"], [152,159,"TRIGGER"], [161,177,"ACTION"], [210,213,"TRIGGER"], [289,293,"TRIGGER"]]}
{ "text": "1) delete “the help of” in Line 14;  ", "labels": [[10,11,"LOCATION"], [15,23,"LOCATION"], [27,34,"LOCATION"]]}
{ "text": "2) add one or two statement at the end to highlight the conclusions;  ", "labels": [[3,6,"ACTION"], [11,13,"TRIGGER"]]}
{ "text": "4) The authors may add several statements at the beginning to present some methods that have been implemented to reduce the issues of using diesel, for example the development of porous materials [Powder Technology, 2019, 349:92-98; Fractals, 2019, 27(4):1950062], the development of unconventional shale gas [SPE Production & Operations, 2018, 33(4): 770-783], the development of fuel cell [International Journal of Hydrogen Energy, 2018, 43(37): 17880-17888].  ", "labels": [[15,18,"MODAL"], [19,22,"ACTION"], [49,58,"LOCATION"], [83,87,"TRIGGER"]]}
{ "text": "Change “illustrated” to “presented” in Line 140. The word is usually used with a figure.  ", "labels": [[7,19,"LOCATION"], [24,35,"LOCATION"], [39,47,"LOCATION"]]}
{ "text": "2) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "3) The authors need to learn how to use written words expressing causality appropriately, for example, leads to, result in, as a consequence, etc.  ", "labels": [[15,19,"MODAL"], [23,28,"ACTION"], [29,32,"TRIGGER"], [142,145,"TRIGGER"]]}
{ "text": "The authors have presented an awkward English writing in the current form that requires a thorough revision. For example:  ", "labels": [[74,78,"TRIGGER"], [79,87,"MODAL"], [99,107,"ACTION"]]}
{ "text": "1) The authors have abused the attributive clause (AC) throughout the current form. The very first sentence of the abstract is a good example. What does the word “which” refer to? It refers to “combustion process” instead of “components”. It is correct to write:  ", "labels": [[115,123,"LOCATION"], [143,152,"TRIGGER"], [214,221,"TRIGGER"], [225,237,"LOCATION"]]}
{ "text": "It is difficult to decompose the in-cylinder pressure of combustion of the DI diesel engine, a transient process associated with complicated oscillation components, because of its steep property.  ", "labels": [[3,28,"ACTION"], [165,172,"TRIGGER"]]}
{ "text": "2) Some phrases are frequently found in the current form, for example “due to”, “a lot of jobs/studies have been done”, etc. The authors should learn to express similar statements in different forms.  ", "labels": [[70,77,"LOCATION"], [80,94,"LOCATION"], [95,118,"LOCATION"], [120,123,"TRIGGER"], [137,143,"MODAL"], [144,149,"ACTION"]]}
{ "text": "The current form of manuscript presents a trace element analysis of Australian honey with the methods published previously. The whole manuscript reads like an experimental report. Thus, a major revision followed by my comments below is required before my reconsideration of its publication.  ", "labels": [[20,30,"LOCATION"], [128,144,"LOCATION"], [151,155,"TRIGGER"], [180,184,"TRIGGER"], [236,244,"ACTION"]]}
{ "text": "In addition, the samples are purchased in a duration that ranges almost 2 years. Will the time affect the analysis? The authors should at least make a discussion on it.  ", "labels": [[53,57,"TRIGGER"], [128,134,"MODAL"], [135,143,"TRIGGER"], [144,148,"ACTION"]]}
{ "text": "The English writing in the current form requires a further polish. Some sentences read cumbersome, for example Line 46-47, which is better in the following manner:  ", "labels": [[59,65,"ACTION"], [111,118,"LOCATION"], [119,121,"LOCATION"]]}
{ "text": "Forager bees can fly up to 5-10 km, continuously interacting with the environment surrounding the hive, including areas of industry, residence, gardens, etc. in cities.  ", "labels": [[13,16,"MODAL"], [153,156,"TRIGGER"]]}
{ "text": "It is interesting to conduct a numerical study of the MHD unsteady flow over a shrinking sheet with the proposed methods. The authors, however, fail to present the work in a coherent and clear manner. Thus, a major revision fully according to my following comments is required for publication.  ", "labels": [[135,142,"TRIGGER"], [144,159,"ACTION"], [183,186,"TRIGGER"]]}
{ "text": "1) delete “for the first time in the literature” in Line 15;  ", "labels": [[10,48,"LOCATION"], [52,59,"LOCATION"]]}
{ "text": "2) “More exactly” should be “Based on the solutions” in Line 15 for better coherence;  ", "labels": [[3,17,"LOCATION"], [18,24,"MODAL"], [28,51,"LOCATION"], [56,63,"LOCATION"]]}
{ "text": "3) “noticed” should be “studied” in Line 21;  ", "labels": [[3,12,"LOCATION"], [13,19,"MODAL"], [23,31,"LOCATION"], [36,43,"LOCATION"]]}
{ "text": "4) The last sentence should be “Our results are demonstrated in a satisfying agreement with some published work”.  ", "labels": [[21,27,"MODAL"], [31,112,"LOCATION"]]}
{ "text": "4) The literature review ends with an introduction of the proposed work. Then, the last paragraph of an introduction is the brief introduction of the proposed work, for example, “Problem formulation is presented in Section 2. Results and discussion are illustrated in Section 3. …”  ", "labels": [[73,77,"TRIGGER"], [83,116,"LOCATION"], [199,224,"LOCATION"], [226,233,"LOCATION"], [234,237,"TRIGGER"], [238,277,"LOCATION"]]}
{ "text": "3) Cite a reference to an equation, unless it is originally proposed here.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "3) Redraw Fig. 7, which is quite different from other figures in terms of aspect ratio and font size in legends.  ", "labels": [[3,9,"ACTION"], [10,13,"LOCATION"], [15,16,"LOCATION"], [87,90,"TRIGGER"]]}
{ "text": "Rewrite the last sentence, since I find it hard to understand what it is talking about.  ", "labels": [[0,7,"ACTION"], [27,32,"TRIGGER"], [62,66,"TRIGGER"]]}
{ "text": "The authors need to improve their cumbersome English writing that undermines the coherence of the manuscript and confuses me during reading it as a consequence. For example:  ", "labels": [[12,16,"MODAL"], [20,27,"ACTION"], [61,65,"TRIGGER"], [109,112,"TRIGGER"]]}
{ "text": "1) there are a number of “it is worth to mention that” throughout the text. It should be “it is worth mentioning that”.  ", "labels": [[25,48,"LOCATION"], [49,53,"TRIGGER"], [70,74,"LOCATION"], [79,85,"MODAL"], [113,117,"TRIGGER"]]}
{ "text": "2) The validation in Page 5 is presented in a miserable way. In Line 140, it should be “equal to their results, validating our proposed methods”. In Line 141, the attributive clause is used incorrectly, it should be “for the second solution, indicating” directly.  ", "labels": [[21,27,"LOCATION"], [64,72,"LOCATION"], [77,83,"MODAL"], [88,93,"LOCATION"], [112,143,"LOCATION"], [149,157,"LOCATION"], [206,212,"MODAL"]]}
{ "text": "In a word, the authors need to fully implement my comments to revise the manuscript. I will not consider the publication until such a major revision is made.  ", "labels": [[23,27,"MODAL"], [37,46,"ACTION"], [87,91,"MODAL"], [92,104,"ACTION"]]}
{ "text": "1\\. Abstract is too lengthy. There is no focus, readers hardly understand the novelty of the paper. The background information can be introduced later.  ", "labels": [[4,12,"LOCATION"], [13,15,"ACTION"], [16,19,"TRIGGER"], [41,46,"ACTION"], [127,130,"MODAL"], [134,144,"ACTION"]]}
{ "text": "2\\. There are some equations coming from other paper’s theories and published works. The author should cite them.  ", "labels": [[64,67,"TRIGGER"], [96,102,"MODAL"], [103,107,"ACTION"]]}
{ "text": "3\\. In Introduction, author described past work on VIPs, but little comment on the contribution and shortcoming. Author need to provide critical comments on thermal conductivity on VIPs.  ", "labels": [[7,19,"LOCATION"], [57,60,"TRIGGER"], [61,75,"ACTION"], [96,99,"TRIGGER"], [120,124,"MODAL"], [128,135,"ACTION"]]}
{ "text": "4\\. Eq.(17) is obtained from the Fourier’s law. Heat transport in geo- materials is known of dual-phase-lagging type. The Fourier’s law of heat conduction is valid only for some limiting cases. The author may consider acknowledge this limitation in this paper.  ", "labels": [[4,6,"LOCATION"], [8,10,"LOCATION"], [205,208,"MODAL"], [209,229,"ACTION"]]}
{ "text": "﻿The authors use some existed methods to investigate the entropy generation and the optimization of rarified nanofluid flows in a square cavity with two fins at the hot wall. Although they have claimed the novelty at the end of the introduction, the current form of the manuscript is still too simple to be considered as a scientific journal paper for publication. The authors are thus required to conduct a major revision by following my comments below.  ", "labels": [[76,79,"TRIGGER"], [221,244,"LOCATION"], [290,293,"TRIGGER"], [294,300,"ACTION"], [381,385,"TRIGGER"], [386,394,"ACTION"], [398,405,"ACTION"]]}
{ "text": "Change “an enclosure” to “a square cavity (or enclosure)”, since the current form focuses on the “square cavity” instead of an enclosure of arbitrary shape.  ", "labels": [[7,21,"LOCATION"], [25,41,"LOCATION"], [43,45,"TRIGGER"], [46,55,"LOCATION"], [56,57,"LOCATION"], [59,64,"TRIGGER"], [113,123,"TRIGGER"]]}
{ "text": "1) Lines 21 to 22: delete “those found in the”.  ", "labels": [[3,17,"LOCATION"], [26,46,"LOCATION"]]}
{ "text": "2) Line 24: “parameters’ values” should be “values of the parameters”.  ", "labels": [[3,10,"LOCATION"], [12,32,"LOCATION"], [33,39,"MODAL"]]}
{ "text": "3) Line 25: “length of the fins” should be a start of a new sentence.  ", "labels": [[3,10,"LOCATION"], [12,32,"LOCATION"], [33,39,"MODAL"]]}
{ "text": "4) Lines 32 to 33: delete the specific expression of the proposed correlation. It is unnecessary in the abstract.  ", "labels": [[3,17,"LOCATION"], [19,25,"ACTION"], [85,96,"ACTION"], [104,112,"LOCATION"]]}
{ "text": "5) There are six key words. Make the number no more than five.  ", "labels": [[28,32,"ACTION"], [52,56,"TRIGGER"]]}
{ "text": "2) It is quite rare to state that a technology is widely used in many applications without references to support the statement, as the authors did (Lines 38 to 40). The manuscript should start as below:  ", "labels": [[15,19,"ACTION"], [29,33,"TRIGGER"], [83,90,"TRIGGER"], [148,162,"LOCATION"], [169,179,"LOCATION"], [180,186,"MODAL"], [187,192,"ACTION"]]}
{ "text": "3) Line 225: “Figure 1” should be “Figure 4”.  ", "labels": [[3,11,"LOCATION"], [13,23,"LOCATION"], [24,30,"MODAL"]]}
{ "text": "5\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "1) Change the section name to “Results and discussion”, since the discussion of the results is usually more important than the results themselves.  ", "labels": [[3,9,"ACTION"], [31,38,"LOCATION"], [39,42,"TRIGGER"], [43,54,"LOCATION"], [56,61,"TRIGGER"], [118,122,"TRIGGER"]]}
{ "text": "4) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner and, making the whole text uncomfortable to read.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"], [215,218,"TRIGGER"], [231,241,"LOCATION"]]}
{ "text": "I strongly recommend the authors to itemize the conclusions with bullet points, since they presented the conclusions in quite a cumbersome manner.  ", "labels": [[36,43,"ACTION"], [80,85,"TRIGGER"], [101,116,"LOCATION"]]}
{ "text": "The authors have presented a miserably awkward English writing in the current form, particularly the tedious way to present information. They have to improve it by following the comments below.  ", "labels": [[84,96,"TRIGGER"], [150,157,"ACTION"]]}
{ "text": "1) Some sentences do NOT have predicate, for example Line 46.  ", "labels": [[18,29,"ACTION"], [53,60,"LOCATION"]]}
{ "text": "The authors need to check the whole text to make any necessary revisions.  ", "labels": [[12,16,"MODAL"], [20,25,"ACTION"], [30,40,"LOCATION"]]}
{ "text": "Line 22:“which” see the “attributive clause (AC)” issue below;  ", "labels": [[0,7,"LOCATION"], [8,15,"LOCATION"], [24,43,"LOCATION"], [45,47,"LOCATION"], [48,49,"LOCATION"]]}
{ "text": "Line 27: see the “also” issue below;  ", "labels": [[0,7,"LOCATION"], [9,12,"ACTION"], [18,22,"TRIGGER"], [30,35,"LOCATION"]]}
{ "text": "Line 29: replace “from that” with phrases indicating causality, for example, as a result.  ", "labels": [[0,7,"LOCATION"], [23,27,"TRIGGER"]]}
{ "text": "I feel quite uncomfortable reading the main text, because the authors’ poorly cumbersome writing makes me almost lost. The text is full of ill-structured sentences and awkward coherence. This part should be rewritten. Please see the comments in the “English writing” part.  ", "labels": [[50,57,"TRIGGER"], [123,127,"LOCATION"], [164,167,"TRIGGER"], [187,196,"LOCATION"], [197,203,"MODAL"], [207,216,"ACTION"], [225,228,"ACTION"]]}
{ "text": "The authors use numerous attributive clauses in the paper, but few are used correctly. For example:  ", "labels": [[52,57,"LOCATION"], [59,62,"TRIGGER"]]}
{ "text": "Another example is in Line 44-45: low enthalpy geothermal systems can be installed almosteverywhere which enables… energy  ", "labels": [[22,29,"LOCATION"], [30,32,"LOCATION"], [66,69,"MODAL"], [73,82,"ACTION"]]}
{ "text": "It should be “low enthalpy geothermal systems can be installed almosteverywhere, enabling… energy”, since what enables energy is the low enthalpy geothermal systems everywhere.  ", "labels": [[3,9,"MODAL"], [13,14,"LOCATION"], [46,49,"LOCATION"], [53,62,"ACTION"], [124,132,"TRIGGER"]]}
{ "text": "Another example is in Line 36: “also geothermal energy becomes progressively important”. It should be “geothermal energy also becomes progressively important”.  ", "labels": [[22,29,"LOCATION"], [31,32,"LOCATION"], [32,36,"TRIGGER"], [37,87,"LOCATION"], [92,98,"MODAL"], [121,125,"TRIGGER"]]}
{ "text": "Line 64-65: Regarding the mineralogy quartz has a significant better thermal conductivity than clay minerals.  ", "labels": [[0,7,"LOCATION"], [8,10,"LOCATION"], [90,94,"TRIGGER"]]}
{ "text": "Another example is in Line 85-86:  ", "labels": [[22,29,"LOCATION"], [30,32,"LOCATION"]]}
{ "text": "The authors seem preferring starting sentences with preposition phrases. It is ok to do so, but it requires particular cautions to deal with different components of a sentence to make it clear. For example, the authors wrote in Line 120:  ", "labels": [[92,95,"TRIGGER"], [99,107,"ACTION"], [228,236,"LOCATION"]]}
{ "text": "Another issue that results in the ill-structure is the redundant style of writing. For example, in Line 421-422: For calculating the thermal conductivity with the mentioned formulas, using the regular bulk density is fitting best, whereas by using the effective bulk density the thermalconductivities will be overestimated.  ", "labels": [[14,18,"TRIGGER"], [55,64,"ACTION"], [99,107,"LOCATION"], [108,111,"LOCATION"], [231,238,"TRIGGER"], [301,305,"MODAL"], [309,322,"ACTION"]]}
{ "text": "Just write the sentence as: Regular bulk density provides the best fitting with the formulas to calculate the thermal conductivity, whereas the effective bulk density leads to overestimation.  ", "labels": [[0,10,"ACTION"], [132,139,"TRIGGER"]]}
{ "text": "The authors start a few sentences with “there,”. I have no idea what these “there” refer to, for example Line 265 and 271.  ", "labels": [[56,63,"ACTION"], [64,68,"TRIGGER"], [75,76,"LOCATION"], [105,113,"LOCATION"], [114,117,"TRIGGER"], [118,121,"LOCATION"]]}
{ "text": "Line 73: “considered, that” should be “considered that” (no comma);  ", "labels": [[0,7,"LOCATION"], [9,20,"LOCATION"], [22,27,"LOCATION"], [28,34,"MODAL"], [39,49,"ACTION"], [50,54,"TRIGGER"]]}
{ "text": "Line 172 and 174: “you” should be “we”  ", "labels": [[0,8,"LOCATION"], [9,12,"TRIGGER"], [13,16,"LOCATION"], [18,23,"LOCATION"], [24,30,"MODAL"]]}
{ "text": "Line 210: The authors have missed the number of the long table. Here should be Table 2.  ", "labels": [[0,8,"LOCATION"], [69,75,"MODAL"], [76,78,"ACTION"], [79,86,"LOCATION"]]}
{ "text": "In general the paper makes fair impression and my recommendation is that it merits publication in this Journal, after the following major revision:  ", "labels": [[43,46,"TRIGGER"], [68,72,"TRIGGER"]]}
{ "text": "1\\. The authors need to reorganize the current introduction, which normally consists of three parts at least: background, literature review, brief of the proposed work. The current one is nothing but a literature review. Why their work is important comparing to previous reports? I think this is essential to keep the interest of the reader.  ", "labels": [[16,20,"MODAL"], [185,195,"ACTION"], [196,199,"TRIGGER"], [221,224,"TRIGGER"]]}
{ "text": "2\\. The results here presented demonstrate the production of Ag-functionalized PCL mats through an easy, flexible and effective way with interesting antimicrobial properties, suggesting their potential use in different applications such as biomedical devices, medical PPE, food packaging, bioremediation and antifouling coatings in filtration. What the authors meant is not clear to reader. The authors should give some explanation on above results.  ", "labels": [[114,117,"TRIGGER"], [304,307,"TRIGGER"], [344,348,"TRIGGER"], [367,379,"ACTION"], [403,409,"MODAL"], [410,414,"ACTION"]]}
{ "text": "3\\. Experiment part. Although the results look “making sense”, the current form reads like a simple lab report. The authors should dig deeper in the results by presenting some in-depth discussion.  ", "labels": [[4,19,"LOCATION"], [47,60,"LOCATION"], [86,90,"TRIGGER"], [124,130,"MODAL"], [131,141,"ACTION"], [149,156,"LOCATION"]]}
{ "text": "4\\. In Fig.7, the authors should give the explanations for the difference of picture and data collected from different sources.  ", "labels": [[7,10,"LOCATION"], [11,12,"LOCATION"], [26,32,"MODAL"], [33,37,"ACTION"], [85,88,"TRIGGER"]]}
{ "text": "6\\. Please, expand the conclusions in relation to the specific goals and the future work.  ", "labels": [[12,18,"ACTION"], [69,72,"TRIGGER"]]}
{ "text": "6.The simulated results reveal that the aspect ratio and the blockage play an important role in accelerating mixing process. While the mixing angle can affect the mixing quality in diffusion length. The best mixing performance of mixer is obtained when the aspect ratio equaled 1 and the inflow angle was 90°. The square obstacle performs better than cylindrical obstacle due to the stronger vortex. Moreover, the surface effect, which makes the disturbance of fluid flow by roughness more obvious, is considered. Three types of rough elements bring benefit for enhancing mixing quality. The authors should give some explanation on above conclusions.  ", "labels": [[31,35,"TRIGGER"], [53,56,"TRIGGER"], [248,252,"TRIGGER"], [280,283,"TRIGGER"], [346,350,"TRIGGER"], [600,606,"MODAL"], [607,611,"ACTION"]]}
{ "text": "The current form of the manuscript has presented a detailed work on optimizing the axial resistance profile of SHFM. The novelty of the work, however, is not demonstrated sufficiently for publication. A thorough revision is thus required for my reconsideration of the publication.  ", "labels": [[24,34,"LOCATION"], [142,149,"TRIGGER"], [151,170,"ACTION"], [224,228,"TRIGGER"]]}
{ "text": "1) Delete the statements claiming the work is “for the first time”. The proposed work is no more than an addition to an established model, according to the current form. Such statements over-claim the novelty of the work.  ", "labels": [[3,9,"ACTION"], [46,47,"LOCATION"], [51,66,"LOCATION"], [86,96,"ACTION"], [97,101,"TRIGGER"]]}
{ "text": "2) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "Although the results look “making sense”, the authors should dig deeper in the results by presenting some in-depth discussion, such as implications of the results. For example, the term cake filtration is a critical factor, known as leak-off, in porous materials to stimulate heat transport through porous media [Fractals, 2020, 28 (2): 2050029] and in hydraulic fracturing to stimulate oil production in petroleum engineering [SPE Production & Operations, 2018, 33(4): 770-783]. Such a factor decreases the efficiency of the fracturing. Can the work proposed here be applied to address this issue? There could be some interesting discussion on it.  ", "labels": [[54,60,"MODAL"], [61,64,"ACTION"], [346,349,"TRIGGER"], [538,541,"MODAL"], [568,575,"ACTION"], [579,586,"ACTION"], [605,610,"MODAL"]]}
{ "text": "Long sentences are frequently found throughout the current form, for example, the one takes up 5 lines (Lines 75-79) in Page 4. I feel quite confusing while reading such cumbersome statements. In addition, there are some oral words and incorrect attributive clauses (e.g. Line 9, Page 1).  ", "labels": [[104,112,"LOCATION"], [113,115,"LOCATION"], [120,126,"LOCATION"], [151,156,"TRIGGER"], [232,235,"TRIGGER"], [272,278,"LOCATION"], [280,286,"LOCATION"]]}
{ "text": "This manuscript has presented a novel approach on based on an improved belief entropy and entropy distance. The topic may be important, the results are interesting and the methodology followed is appropriate, while the content falls well within the scope of this Journal. In general the paper makes fair impression and my recommendation is that it merits publication in this Journal, after the following major revision:  ", "labels": [[5,15,"LOCATION"], [86,89,"TRIGGER"], [164,167,"TRIGGER"], [209,214,"TRIGGER"], [315,318,"TRIGGER"], [340,344,"TRIGGER"]]}
{ "text": "The authors have presented a cumbersome English writing in the current form, making the manuscript hard to understand.  ", "labels": [[88,98,"LOCATION"], [99,117,"ACTION"]]}
{ "text": "Shale gas is a potential substitute for the gradually-depleted conventional oil and gas resources. Therefore, it is urgent to study the microscopic behavior of shale gas in nano-slits and to investigate the mechanisms involved. As a result, this paper uses the model of graphite layers to provide insights into microscopic details of shale gas occurrence behavior in organic−rich nano−slits from the viewpoint of molecular interactions by molecular simulation.  ", "labels": [[80,83,"TRIGGER"], [99,108,"TRIGGER"], [126,131,"ACTION"], [184,187,"TRIGGER"]]}
{ "text": "Line 25: add “respectively” at the end of this line. The authors made serious mistake when using respectively. Please see the following example for more details.  ", "labels": [[0,7,"LOCATION"], [35,51,"LOCATION"], [86,90,"TRIGGER"], [118,121,"ACTION"]]}
{ "text": "I feel quite uncomfortable reading the main text, because the authors’ poorly cumbersome writing makes me almost lost. The interpretation of the results (figures) are presented in a totally incoherent manner, making the text hardly readable. I will list a few examples and comments for the authors. They need to rewrite the whole main text for a more coherent explanation of the results.  ", "labels": [[50,57,"TRIGGER"], [244,248,"MODAL"], [249,253,"ACTION"], [269,272,"TRIGGER"], [304,308,"MODAL"], [312,319,"ACTION"], [324,339,"LOCATION"]]}
{ "text": "The four above issues are full of the whole text. After each set of results, the authors wrote the interpretation in this way. The authors should revise all the text accordingly, thoroughly, and carefully.  ", "labels": [[38,48,"LOCATION"], [139,145,"MODAL"], [146,152,"ACTION"], [161,165,"LOCATION"], [166,177,"TRIGGER"], [191,194,"TRIGGER"]]}
{ "text": "Line 485-486: Combining Figures 16 and 17, it is known that, for different gas districts, AIIE only take an advantage over AIE by other gas for FAL at 1 and 11 MPa.  ", "labels": [[0,8,"LOCATION"], [9,12,"LOCATION"], [24,34,"LOCATION"], [35,38,"TRIGGER"], [39,41,"LOCATION"], [55,59,"TRIGGER"], [153,156,"TRIGGER"]]}
{ "text": "Comparisons of Figures 16 and 17 demonstrates that AIIE only take an advantage over AIE for FAL at 1 and 11 MPa.  ", "labels": [[15,25,"LOCATION"], [26,29,"TRIGGER"], [30,32,"LOCATION"], [46,50,"TRIGGER"], [101,104,"TRIGGER"]]}
{ "text": "The authors need to go through the whole manuscript, and revise all these ill- structured sentences.  ", "labels": [[41,51,"LOCATION"], [53,56,"TRIGGER"], [57,63,"ACTION"]]}
{ "text": "3) Make the same scale when comparing figures.  ", "labels": [[3,7,"ACTION"], [23,27,"TRIGGER"]]}
{ "text": "In a word, the authors lack fundamentals of technical writing in English, and have presented the information in a miserably awkward manner, making the manuscript totally incoherent. Thus, a major revision is required before it can be reconsidered for publication.  ", "labels": [[74,77,"TRIGGER"], [151,161,"LOCATION"], [208,216,"ACTION"], [227,230,"MODAL"], [234,246,"ACTION"]]}
{ "text": "The current form of the manuscript has presented an experimental work on fluctuating airflow fields for melt-blowing slot-die nozzles. The topic is important, the results are interesting and the methodology followed is appropriate, while the content falls well within the scope of this Journal. In general the paper makes fair impression and my recommendation is that it merits publication in this Journal, after the following revision:  ", "labels": [[24,34,"LOCATION"], [187,190,"TRIGGER"], [232,237,"TRIGGER"], [338,341,"TRIGGER"], [363,367,"TRIGGER"]]}
{ "text": "(2) Fig1. (b) should appear after Fig 1.(a) for the first time in the text.  ", "labels": [[4,8,"LOCATION"], [11,12,"LOCATION"], [14,20,"MODAL"], [21,27,"ACTION"], [34,39,"LOCATION"], [41,42,"LOCATION"], [70,74,"LOCATION"]]}
{ "text": "Please check all Equations double. The authors have presented a cumbersome English writing in the current form, making the manuscript hard to understand. The issues include, but are not limited to, some quite basic grammatical issues (e.g. no predicate in the sentence in Lines 167-169), abuse of attributive clauses, and ill-structured sentences.  ", "labels": [[7,12,"ACTION"], [123,133,"LOCATION"], [134,152,"ACTION"], [182,193,"ACTION"], [272,281,"LOCATION"], [282,285,"LOCATION"], [318,321,"TRIGGER"]]}
{ "text": "The manuscript is by no means acceptable as a scientific journal paper, since there is no specific scientific essence in it. The whole text is presented in a way of a general science article for public. The editor then asked me whether it is acceptable as an editorial article. After another review, however, I found it still unacceptable for publication the current form even as an editorial article. A major revision fully according to my comments is required before my reconsideration.  ", "labels": [[4,14,"LOCATION"], [21,40,"ACTION"], [72,77,"TRIGGER"], [129,139,"LOCATION"], [228,235,"TRIGGER"], [300,307,"TRIGGER"], [453,461,"ACTION"]]}
{ "text": "1) The focus on the article is still “plastics”, instead of “bio”. Bio- plastics are the extension of plastics, as the consequence of the combination of plastics and biology. Thus, the article should start with a brief introduction of “plastics”, after which the “bio” terminology is presented. For example, it is better to start as:  ", "labels": [[49,56,"TRIGGER"], [60,65,"LOCATION"], [162,165,"TRIGGER"], [193,199,"MODAL"], [200,205,"ACTION"], [324,329,"ACTION"]]}
{ "text": "2) The English writing is miserably cumbersome in the current form of text. It is frequently to see basic grammar issues, ill-structured sentence, and incoherent statements throughout the text. For example:  ", "labels": [[147,150,"TRIGGER"], [188,192,"LOCATION"]]}
{ "text": "Line 10: “innovation” should be “innovations”, since “do” is used here.  ", "labels": [[0,7,"LOCATION"], [9,21,"LOCATION"], [22,28,"MODAL"], [32,44,"LOCATION"], [53,56,"LOCATION"], [58,65,"ACTION"], [66,70,"LOCATION"]]}
{ "text": "Line 12: capable of doing something, instead of capable to do something.  ", "labels": [[0,7,"LOCATION"], [37,47,"TRIGGER"]]}
{ "text": "Line 19: what does it mean by writing “one of the most used”? The word “used” is NOT a noun.  ", "labels": [[0,7,"LOCATION"], [9,18,"TRIGGER"], [38,60,"LOCATION"]]}
{ "text": "The English writing makes the whole text unreadable. The author must make a thorough revision!  ", "labels": [[30,40,"LOCATION"], [64,68,"MODAL"], [69,73,"ACTION"]]}
{ "text": "3) I have no idea why there are a few blank lines in Page 5.  ", "labels": [[18,21,"TRIGGER"], [53,59,"LOCATION"]]}
{ "text": "In a word, I will not reconsider the manuscript for publication until a major revision fully according to my comments is made.  ", "labels": [[13,21,"MODAL"], [22,32,"ACTION"]]}
{ "text": "It is interesting to investigate the effects of double diffusion convection on third grade nanofluid through a curved compliant peristaltic channel. Unfortunately, the current form fails to present the study in a coherent and clear manner. Thus, the authors are required to make a major revision by fully according to my following comments before my reconsideration of publication.  ", "labels": [[21,32,"ACTION"], [149,162,"TRIGGER"], [181,197,"ACTION"], [222,225,"TRIGGER"], [262,270,"ACTION"]]}
{ "text": "It is also astonishing to me that the author has missed the last reference above mentioned by me. The reference authored by Choi is widely accepted as the first publication that introduces the concept of “nanofluid”. Any study on nanofluid should not miss this reference. The author has definitely presented an incomplete literature review by doing so; even he/she lists a number of studies after the start.  ", "labels": [[6,10,"TRIGGER"], [29,33,"TRIGGER"], [45,55,"ACTION"], [60,74,"LOCATION"], [173,177,"TRIGGER"], [240,250,"MODAL"], [251,255,"ACTION"]]}
{ "text": "This manuscript can be accepted after a major revision according to following comments:  ", "labels": [[5,15,"LOCATION"], [16,19,"MODAL"], [23,31,"ACTION"]]}
{ "text": "1\\. In Introduction, author described past work on MCHS, but little comment on the contribution and shortcoming. Author need to provide critical comments on MCHS.  ", "labels": [[7,19,"LOCATION"], [57,60,"TRIGGER"], [96,99,"TRIGGER"], [120,124,"MODAL"], [128,135,"ACTION"]]}
{ "text": "4\\. For “Solving the Numerical Model” part, the author should give some key details.  ", "labels": [[8,37,"LOCATION"], [55,61,"MODAL"], [62,66,"ACTION"]]}
{ "text": "5\\. Does the Brownian motion have effects on heat transfer of nanofluid?  ", "labels": [[4,8,"TRIGGER"], [9,61,"LOCATION"]]}
{ "text": "The current manuscript presented a review on fixed grid numerical methods for simulation of solidification and melting of PCMs. Although the content of review is comprehensive, the authors fail to present it in a clear, concise, and coherent manner. A major revision fully according to my following comments, thus, is required for my reconsideration of publication.  ", "labels": [[12,22,"LOCATION"], [107,110,"TRIGGER"], [189,204,"ACTION"], [229,232,"TRIGGER"], [309,313,"TRIGGER"]]}
{ "text": "1) Line 35: “compile” should be “compare”;  ", "labels": [[3,10,"LOCATION"], [12,21,"LOCATION"], [22,28,"MODAL"], [32,33,"LOCATION"], [33,40,"ACTION"]]}
{ "text": "2) Lines 38 to 40 are quite confusing. The authors need to rewrite the statements, making it clear and easy to understand;  ", "labels": [[3,17,"LOCATION"], [18,37,"ACTION"], [51,55,"MODAL"], [59,66,"ACTION"], [99,102,"TRIGGER"]]}
{ "text": "On the other hand, it is better to present a little more details of the applications of PCM. It is better to rewrite Lines 63 to 65 as:  ", "labels": [[35,42,"ACTION"], [109,116,"ACTION"], [117,131,"LOCATION"]]}
{ "text": "Therefore, PCM is found to serve in a wide range of applications, for example two-phase fluid through porous media in textile industry [Powder Technology, 2019, 349:92-98] and in electronic industry [Applied Sciences, 2016, 6(9): 226], multiple-phase fracturing fluid in petroleum engineering [SPE Production & Operations, 2018, 33(4): 770-783], .... (some specific terms) in medical applications [2 to 3 references], etc.  ", "labels": [[172,175,"TRIGGER"], [418,421,"TRIGGER"]]}
{ "text": "Sections 2 and 3  ", "labels": [[0,10,"LOCATION"], [11,14,"TRIGGER"]]}
{ "text": "Sections 4 and 5  ", "labels": [[0,10,"LOCATION"], [11,14,"TRIGGER"]]}
{ "text": "Table 3 is an interesting summation of the review. The authors should dig more on it with an analysis why the combination of Darcy STM and E-EM is most common and why some certain types of the combination has not been studied.  ", "labels": [[0,7,"LOCATION"], [63,69,"MODAL"], [70,73,"ACTION"], [102,105,"TRIGGER"], [135,138,"TRIGGER"], [159,166,"TRIGGER"]]}
{ "text": "In a summary, the two sections are presented in a relatively shallow manner. The authors are required to elaborate them to provide more novelty and significance of the related studies.  ", "labels": [[18,30,"LOCATION"], [93,101,"ACTION"], [144,147,"TRIGGER"]]}
{ "text": "The English writing in the current form need a thorough polish. Below are a few examples:  ", "labels": [[40,44,"MODAL"], [56,62,"ACTION"], [64,69,"LOCATION"]]}
{ "text": "1) “regarding” should be “regarding to” throughout the whole manuscript;  ", "labels": [[3,14,"LOCATION"], [15,21,"MODAL"], [55,71,"MODAL"]]}
{ "text": "Above are only a few examples of the English writing in the current form. The authors need to go through the whole manuscript for better English writing.  ", "labels": [[86,90,"MODAL"], [94,104,"ACTION"], [109,125,"LOCATION"]]}
{ "text": "In a word, I shall not reconsider the publication until a major revision fully according to my comments has been made.  ", "labels": [[13,18,"MODAL"], [19,33,"ACTION"]]}
{ "text": "(1) Merge the two sections into one since either is too short to be an independent section.  ", "labels": [[4,9,"ACTION"], [36,48,"TRIGGER"], [52,55,"TRIGGER"]]}
{ "text": "(2) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[4,8,"ACTION"], [37,43,"TRIGGER"]]}
{ "text": "6\\. The references should be united.  ", "labels": [[4,7,"LOCATION"], [19,25,"MODAL"], [29,35,"ACTION"]]}
{ "text": "8\\. The writing English is poor and must be improved.  ", "labels": [[24,31,"ACTION"], [32,35,"TRIGGER"], [36,40,"MODAL"], [44,52,"ACTION"]]}
{ "text": "The current form of the manuscript has presented a detailed theoretical work on modeling transport and adsorption of arsenic ions in iron-oxide laden porous media. The significance of the work, however, has been presented in an incomplete manner. A major revision is thus required for my reconsideration of the publication.  ", "labels": [[24,34,"LOCATION"], [99,102,"TRIGGER"], [194,201,"TRIGGER"], [267,271,"TRIGGER"], [272,280,"ACTION"]]}
{ "text": "The derivation of the theoretical work has been presented in a detailed way. The final result, however, has not been validated with comparisons with any benchmarks, failing to present a complete work. The authors are required to present one comparison for validation at least, and to conduct a parametric study by using the proposed theoretical result to investigate some mechanisms involved quantitively.  ", "labels": [[95,102,"TRIGGER"], [108,126,"ACTION"], [217,225,"ACTION"], [277,280,"TRIGGER"]]}
{ "text": "At last, it could be quite interesting that the authors make a short discussion on the application of the theoretical studies in other fields, such as modeling fluid transportation in unconventional reservoirs and porous media [SPE Journal, 2017, 22(2): 645-659; International Journal of Heat and Mass Transfer, 2019, 137: 365-371].  ", "labels": [[12,17,"MODAL"], [39,43,"TRIGGER"], [56,60,"ACTION"], [210,213,"TRIGGER"], [293,296,"TRIGGER"]]}
{ "text": "4) It is inappropriate to cite more than five references to a single term (Line 45). The authors are required either to make it no more than five or to elaborate the relations of the references.  ", "labels": [[9,30,"ACTION"], [36,40,"TRIGGER"], [75,82,"LOCATION"], [101,109,"ACTION"], [110,116,"TRIGGER"], [136,140,"TRIGGER"], [146,148,"TRIGGER"]]}
{ "text": "The authors must check the whole manuscript and make any necessary revisions for the four issues above.  ", "labels": [[12,16,"MODAL"], [17,22,"ACTION"], [33,43,"LOCATION"], [44,47,"TRIGGER"], [48,52,"ACTION"]]}
{ "text": "1) The authors have presented some incorrect information right at the beginning of the introduction. The fluid gradually replaced by the nanofluid is not the “pure” fluid, but most of the conventional engineered fluid that does not have to be “pure” in practical applications. In addition, it is rare to state many applications of something while not to provide references to support the statement. The introduction should start as:  ", "labels": [[70,99,"LOCATION"], [172,175,"TRIGGER"], [218,227,"TRIGGER"], [341,346,"TRIGGER"], [403,415,"LOCATION"], [416,422,"MODAL"], [423,428,"ACTION"]]}
{ "text": "3) As the authors have already stated that ANN can be used to predict the thermal properties of the mentioned nanofluids in the last paragraph of the introduction, they need to provide the reasons or necessities to propose their two new approaches.  ", "labels": [[38,42,"TRIGGER"], [128,162,"LOCATION"], [169,173,"MODAL"], [177,184,"ACTION"], [197,199,"TRIGGER"]]}
{ "text": "3\\. Sections 2 and 3  ", "labels": [[4,14,"LOCATION"], [15,18,"TRIGGER"]]}
{ "text": "1) Merge Sections 2 and 3 to a single section named “mathematical modeling”. Present the original Section 2 in a more concise manner, since it is mostly established approaches.  ", "labels": [[3,8,"ACTION"], [9,19,"LOCATION"], [20,23,"TRIGGER"], [24,25,"LOCATION"], [77,84,"ACTION"], [98,107,"LOCATION"], [134,139,"TRIGGER"]]}
{ "text": "2) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "4\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "2) The authors are required to elaborate the benchmarks that are used to validate the proposed model, for example the experiment data in Figure 6, by citing the related references (where are the data from).  ", "labels": [[19,27,"ACTION"], [56,60,"TRIGGER"], [137,145,"LOCATION"]]}
{ "text": "It is easier to pick up the key findings of the study, if the conclusion is itemized with bullet points.  ", "labels": [[16,23,"ACTION"], [55,57,"TRIGGER"], [58,72,"LOCATION"]]}
{ "text": "The English writing needs improvement. For example,  ", "labels": [[20,25,"MODAL"], [26,37,"ACTION"]]}
{ "text": "1) Line 48: “Moreover” should be “On the other hand”, otherwise the logic does not make sense;  ", "labels": [[3,10,"LOCATION"], [12,22,"LOCATION"], [23,29,"MODAL"], [54,63,"TRIGGER"], [74,78,"TRIGGER"], [79,93,"ACTION"]]}
{ "text": "2) Line 82: “are capable to adapt” should be “are capable of adapting”;  ", "labels": [[3,10,"LOCATION"], [12,34,"LOCATION"], [35,41,"MODAL"], [45,69,"LOCATION"]]}
{ "text": "The current form of the manuscript has presented a detailed work on accurate spectral collocation solutions to 2nth-order Sturm-Liouville Problems. The novelty of the work, however, has not been demonstrated sufficiently for publication. A thorough revision is thus required for my reconsideration of the publication.  ", "labels": [[24,34,"LOCATION"], [173,180,"TRIGGER"], [182,207,"ACTION"], [261,265,"TRIGGER"]]}
{ "text": "Although the results look “making sense”, the authors should dig deeper in the results by presenting some in-depth discussion, such as implications of the results, such as possible application of them. In addition, I feel it better to provide comparison with a benchmark as validation at first, and then conduct numerical experiment in each case.  ", "labels": [[26,27,"LOCATION"], [34,39,"LOCATION"], [54,60,"MODAL"], [61,64,"ACTION"], [235,242,"ACTION"], [295,298,"TRIGGER"], [304,311,"ACTION"]]}
{ "text": "The current introduction is presented in a surprisingly insufficient manner. The authors only concentrate on the related work with PMMA, while ignoring the method, i.e. the nano technology, of which, they should provide some background and evolution. For example,  ", "labels": [[12,24,"LOCATION"], [137,142,"TRIGGER"], [205,211,"MODAL"], [212,219,"ACTION"], [236,239,"TRIGGER"]]}
{ "text": "Adding particles, characterized in nano dimensions, is found to improve a number of properties of base conventional engineered material significantly [ASME, 1995, 231:99-105 ], and therefore has been applied in a number of practical applications, for example porous media [Fractals, 2020, 28(2): 2050029; Powder Technology, 2019, 349: 92-98], petroleum engineering [SPE Production & Operations, 2018, 33(4): 770-783], power industry [2 to 3 references], and medical science [2 to 3 references], etc.  ", "labels": [[177,190,"TRIGGER"], [454,457,"TRIGGER"], [495,498,"TRIGGER"]]}
{ "text": "The references, particularly the ASME one authored by Choi, should be cited to support the statements.  ", "labels": [[4,14,"LOCATION"], [16,28,"TRIGGER"], [60,66,"MODAL"], [70,75,"ACTION"], [79,86,"ACTION"]]}
{ "text": "In addition, the current citation is presented in an inappropriate way. For example, the authors have claimed that the PMMA is the “most-frequently used” material for dentures. While using the superlative degree, the authors have to cite a reference here to validate the statement; otherwise the evaluation is suspicious in science.  ", "labels": [[37,46,"ACTION"], [110,114,"TRIGGER"], [233,237,"ACTION"], [250,254,"LOCATION"], [282,291,"TRIGGER"]]}
{ "text": "On the other hand, the authors seem ignoring the theoretical related work. Although the proposed work focuses on experiments, the authors should provide some information from the respective of theory for a complete literature review.  ", "labels": [[36,44,"ACTION"], [138,144,"MODAL"], [145,152,"ACTION"]]}
{ "text": "Please cite a reference to an equation, unless it is originally proposed here.  ", "labels": [[7,11,"ACTION"], [40,46,"TRIGGER"]]}
{ "text": "The subtitles of the two sections themselves are confusing, since the former includes discussion, why do we need another “discussion”?  ", "labels": [[4,13,"LOCATION"], [45,58,"ACTION"], [60,65,"TRIGGER"], [98,101,"TRIGGER"], [108,112,"ACTION"]]}
{ "text": "A thorough English writing is also required to improve the awful English writing in the current form, such as incorrect phrasing (Line 23), incorrect attributive clause (Line 121), etc.  ", "labels": [[30,34,"TRIGGER"], [35,43,"ACTION"], [130,137,"LOCATION"], [170,178,"LOCATION"], [181,184,"TRIGGER"]]}
{ "text": "The current form of manuscript presents a tube-cleaning study with a new model. The authors, however, fails to present the study in a clear, coherent or concise manner. Thus, a major revision fully according to my comments below is required before my consideration of its publication.  ", "labels": [[20,30,"LOCATION"], [93,100,"TRIGGER"], [102,107,"TRIGGER"], [108,118,"ACTION"], [150,152,"TRIGGER"], [232,240,"ACTION"]]}
{ "text": "(1) The authors should use common terminologies, such as “Young’s modulus”, instead of the self-created “Young’s coefficient”.  ", "labels": [[16,22,"MODAL"], [23,26,"ACTION"], [57,63,"LOCATION"], [64,73,"LOCATION"], [76,86,"TRIGGER"], [104,125,"LOCATION"]]}
{ "text": "(2) The authors should follow common scientific representation, instead of the incorrect form (Line 286).  ", "labels": [[16,22,"MODAL"], [23,29,"ACTION"], [64,74,"TRIGGER"], [95,103,"LOCATION"]]}
{ "text": "(2) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[4,8,"ACTION"], [37,43,"TRIGGER"]]}
{ "text": "(3) All the equations must be presented in consistent font size (see Eqs. 12 and 13).  ", "labels": [[22,26,"MODAL"], [30,39,"ACTION"], [69,72,"LOCATION"], [74,76,"LOCATION"], [77,80,"TRIGGER"], [81,83,"LOCATION"]]}
{ "text": "(4) The authors need to add a validation of the proposed model with a satisfying match of the results obtained by the new model and those by previous studies;  ", "labels": [[16,20,"MODAL"], [24,27,"ACTION"], [128,131,"TRIGGER"]]}
{ "text": "The governing equation of the model is a PDE; therefore the choosing of special interval (discretization) could also affect the numerical simulation. The authors should add some discussion of it.  ", "labels": [[46,55,"TRIGGER"], [106,111,"MODAL"], [112,116,"TRIGGER"], [117,123,"ACTION"], [162,168,"MODAL"], [169,172,"ACTION"]]}
{ "text": "Biomass fuels, a mixture of conventional fuel such as coal [1 to 2 references], porous materials [Fractals, 2020, 28 (2): 2050029; Powder Technology, 2019, 349: 92-98], and oil [SPE Production & Operations, 2018, 33(4): 770-783] and alternatives [some references], are found to serve in an increasing number of applications for heating and electricity production.  ", "labels": [[169,172,"TRIGGER"], [229,232,"TRIGGER"], [336,339,"TRIGGER"]]}
{ "text": "The authors are required to rewrite the introduction from the following perspectives at least.  ", "labels": [[16,24,"ACTION"], [40,52,"LOCATION"]]}
{ "text": "The background of the related study is presented in the confusing way, since the authors provide a lot of information that overwhelms the key feature of interest that stimulate the proposed study. It is better to start the introduction as:  ", "labels": [[71,76,"TRIGGER"], [89,96,"ACTION"], [118,122,"TRIGGER"], [162,166,"TRIGGER"], [213,218,"ACTION"], [223,235,"LOCATION"]]}
{ "text": "Equilibrium problem, pioneered by Blum and Oettli [1] as a unifying feature, is found to involved more and more actively in a number of applications, such as poroelasticity for petroleum engineering [SPE Production & Operations, 2018, 33(4): 770-783], porous materials [Powder Technology, 2019, 349:92-98; Fractals, 2019, 27 (4): 1950062], financial analysis in economics [2 to 3 references], and reconstruction of image in imaging-process. [2 to 3 references]....  ", "labels": [[39,42,"TRIGGER"], [103,106,"TRIGGER"], [393,396,"TRIGGER"]]}
{ "text": "The derivation and the results look “making sense”, while the authors are suggested making some in-depth analysis of the efficiency of the proposed algorithms.  ", "labels": [[4,14,"LOCATION"], [15,18,"TRIGGER"], [36,37,"LOCATION"], [37,43,"ACTION"], [44,49,"LOCATION"], [52,57,"TRIGGER"]]}
{ "text": "In summary, a major revision is required for my reconsideration of the publication.  ", "labels": [[3,10,"LOCATION"], [32,40,"ACTION"]]}
{ "text": "1\\. In Introduction, author described past work, but little comment on the contribution and shortcoming. Author need to provide critical comments.  ", "labels": [[7,19,"LOCATION"], [49,52,"TRIGGER"], [60,67,"ACTION"], [88,91,"TRIGGER"], [112,116,"MODAL"], [120,127,"ACTION"]]}
{ "text": "5\\. The references should be united. Some are abbreviation, the others are full name.  ", "labels": [[4,18,"LOCATION"], [19,25,"MODAL"], [29,35,"ACTION"]]}
{ "text": "This manuscript investigated the effects of bulk flow pulsations on film cooling with two sister holes. The topic may be important, the results are interesting and the methodology followed is appropriate, while the content falls well within the scope of this Journal. In general the paper makes fair impression and my recommendation is that it merits publication in this Journal, after the following major revision:  ", "labels": [[5,15,"LOCATION"], [160,163,"TRIGGER"], [205,210,"TRIGGER"], [311,314,"TRIGGER"], [336,340,"TRIGGER"]]}
{ "text": "The authors have presented a cumbersome English writing in the current form, making the manuscript hard to understand.  ", "labels": [[88,98,"LOCATION"], [99,117,"ACTION"]]}
{ "text": "The authors have conducted a study on air-water two-phase flow in a hydro- phobic fuel-cell micro-channel from the perspectives of both experiment and theoretic model. The current form of the manuscript, however, is presented in an incoherent, inconsistent, and redundant manner. Thus, I am will not consider it for publication until a major revision is made according to my following comments.  ", "labels": [[131,135,"TRIGGER"], [147,150,"TRIGGER"], [192,202,"LOCATION"], [204,211,"TRIGGER"], [258,261,"TRIGGER"], [291,295,"MODAL"], [300,308,"ACTION"]]}
{ "text": "1) The abstract is too lengthy. The author should present it in a concise manner, for example, those specific numbers are completely unnecessary in an abstract.  ", "labels": [[7,15,"LOCATION"], [19,22,"TRIGGER"], [43,49,"MODAL"], [50,57,"ACTION"]]}
{ "text": "1) Such a long introduction implies that the authors have made a closely review of the literature, which does not necessarily needed recording in such a detailed way in an introduction. The authors need to learn to introduce the related works concisely.  ", "labels": [[15,27,"LOCATION"], [36,40,"TRIGGER"], [105,109,"TRIGGER"], [110,132,"ACTION"], [198,202,"MODAL"], [206,211,"ACTION"]]}
{ "text": "3\\. Materials and methods  ", "labels": [[4,13,"LOCATION"], [14,17,"TRIGGER"]]}
{ "text": "2) Make the font and font size consistent (for example, Lines 193~194). The inconsistent font and font size are found throughout the whole manuscript.  ", "labels": [[3,7,"ACTION"], [17,20,"TRIGGER"], [56,65,"LOCATION"], [66,69,"LOCATION"], [94,97,"TRIGGER"], [139,149,"LOCATION"]]}
{ "text": "4\\. Experimental results and discussion  ", "labels": [[4,24,"LOCATION"], [25,28,"TRIGGER"]]}
{ "text": "2) Redraw the figures in Subsection 3.2, some legends and captions are too small to recognize.  ", "labels": [[3,9,"ACTION"], [25,37,"LOCATION"], [38,39,"LOCATION"], [54,57,"TRIGGER"], [67,70,"ACTION"], [71,74,"TRIGGER"], [75,80,"ACTION"]]}
{ "text": "4) Subsection 3.2.3 is of much smaller font size than other parts of the text.  ", "labels": [[3,15,"LOCATION"], [16,17,"LOCATION"], [18,19,"LOCATION"], [20,38,"ACTION"], [49,53,"TRIGGER"]]}
{ "text": "I think that the inconsistence throughout the whole manuscript indicates the authors’ carelessness.  ", "labels": [[8,12,"TRIGGER"], [52,62,"LOCATION"]]}
{ "text": "3) Cite an equation to a reference unless it is originally proposed here.  ", "labels": [[3,7,"ACTION"], [35,41,"TRIGGER"]]}
{ "text": "4) Make the font and font size of the equation consistent with elsewhere.  ", "labels": [[3,7,"ACTION"], [17,20,"TRIGGER"], [34,46,"LOCATION"], [47,57,"ACTION"]]}
{ "text": "5) Move the results of the proposed model to “Results and discussion”, and focus on the discussion of the results.  ", "labels": [[3,7,"ACTION"], [45,53,"LOCATION"], [54,57,"TRIGGER"], [58,69,"LOCATION"], [71,74,"TRIGGER"], [75,80,"ACTION"]]}
{ "text": "Again, the conclusion is too redundant. Just summarize the key findings of the study here. It is better to itemize the conclusions with bullet points.  ", "labels": [[0,5,"TRIGGER"], [7,21,"LOCATION"], [22,24,"ACTION"], [25,28,"TRIGGER"], [29,38,"ACTION"], [45,54,"ACTION"], [107,114,"ACTION"]]}
{ "text": "2) The authors seem prefer writing a long sentence including a few short but complete sentences connected by commas. For example, Lines 138~139 reads:  ", "labels": [[27,34,"ACTION"], [130,139,"LOCATION"], [140,143,"LOCATION"]]}
{ "text": "“The current paper addresses some of these gaps, quantifies some of the key parameters required in the modeling process, and focusses on …”  ", "labels": [[49,59,"LOCATION"], [121,124,"TRIGGER"], [125,136,"LOCATION"]]}
{ "text": "The authors need to check the whole text to make any necessary revisions.  ", "labels": [[12,16,"MODAL"], [20,25,"ACTION"], [30,40,"LOCATION"]]}
{ "text": "It is interesting to read an elaborated analysis of different methods to address the issue of load imbalances with a workload estimator designed and presented in details. The current form of the manuscript can be further improved, and thus be published, after the following revisions.  ", "labels": [[21,25,"ACTION"], [73,80,"ACTION"], [145,148,"TRIGGER"], [191,205,"LOCATION"], [206,209,"MODAL"], [221,229,"ACTION"], [231,239,"TRIGGER"]]}
{ "text": "Seven key words are too many for a scientific journal paper. Make it no more than five.  ", "labels": [[16,19,"ACTION"], [20,23,"TRIGGER"], [24,28,"ACTION"], [61,65,"ACTION"], [77,81,"TRIGGER"]]}
{ "text": "The results presented look making sense. I feel that the manuscript can be sounder if the authors provide an example of applying the different methods to solve a practical engineering problem and then compare the difference.  ", "labels": [[48,52,"TRIGGER"], [83,85,"TRIGGER"], [98,105,"ACTION"], [192,195,"TRIGGER"], [201,208,"ACTION"]]}
{ "text": "This manuscript investigated the enhancement of the capillary effect in a plastic capillary tube using a nanostructured surface. The topic may be important, the results are interesting and the methodology followed is appropriate, while the content falls well within the scope of this Journal. In general the paper makes fair impression and my recommendation is that it merits publication in this Journal, after the following major revision:  ", "labels": [[5,15,"LOCATION"], [185,188,"TRIGGER"], [230,235,"TRIGGER"], [336,339,"TRIGGER"], [361,365,"TRIGGER"]]}
{ "text": "The authors have presented a cumbersome English writing in the current form, making the manuscript hard to understand.  ", "labels": [[88,98,"LOCATION"], [99,117,"ACTION"]]}
{ "text": "The proposed study has demonstrated some interesting results for stagnation- point effect on the flow of micropolar nanofluid over an inclined surface. The current manuscript, however, fails to be presented in a clear, concise, and coherent manner. A major revision fully according to my following comments, thus, is required for my reconsideration of publication.  ", "labels": [[164,174,"LOCATION"], [176,183,"TRIGGER"], [185,206,"ACTION"], [228,231,"TRIGGER"], [308,312,"TRIGGER"], [317,325,"ACTION"]]}
{ "text": "2) Line 17: change “appropriate” to specific terms used for the transform in the proposed study, for example, self-similarity;  ", "labels": [[3,10,"LOCATION"], [19,32,"LOCATION"], [81,95,"LOCATION"]]}
{ "text": "3) Add one or two statements to present the highlights of the results of the study.  ", "labels": [[3,6,"ACTION"], [11,13,"TRIGGER"]]}
{ "text": "1) The introduction has been presented in an incoherent and insufficient manner. The authors do not address some basic but critical issues, particularly the one why nanofluid is preferred in the studies of heat-mass transfer? Thus, it is better to insert the following statement to introduce its significance:  ", "labels": [[7,19,"LOCATION"], [56,59,"TRIGGER"], [93,107,"ACTION"], [140,152,"TRIGGER"], [161,164,"TRIGGER"], [248,254,"ACTION"]]}
{ "text": "Inside the brackets are necessary references to support the statements. The authors are also required to cite 2 to 3 references to each application case listed in the introduction (Line 30, 50).  ", "labels": [[88,92,"TRIGGER"], [93,101,"ACTION"], [181,188,"LOCATION"], [190,192,"LOCATION"]]}
{ "text": "It is also astonishing to me that the authors have missed the last reference mentioned above. The reference authored by Choi is widely accepted as the first publication that introduces the concept of “nanofluid”. Any study on nanofluid should not miss this reference. The authors have definitely presented an incomplete literature review by doing so.  ", "labels": [[6,10,"TRIGGER"], [29,33,"TRIGGER"], [51,57,"ACTION"], [169,173,"TRIGGER"], [236,242,"MODAL"], [243,251,"ACTION"]]}
{ "text": "1) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "1) Although the results are all “making sense” to me, they are not organized in a coherent manner, making me fell quite confusing and uncomfortable when reading the text. For example, Table 3.1 is supposed to be presented as a verification of the proposed model, instead of “in order to match the published results”.  ", "labels": [[32,46,"LOCATION"], [59,76,"ACTION"], [130,133,"TRIGGER"], [148,152,"TRIGGER"], [184,191,"LOCATION"], [192,193,"LOCATION"], [274,315,"LOCATION"]]}
{ "text": "(1) no predicate in a sentence (Lines 69-70);  ", "labels": [[32,40,"LOCATION"], [41,43,"LOCATION"]]}
{ "text": "Above are only a few examples of the awful English writing. The author needs to go through the whole manuscript for better English writing.  ", "labels": [[71,76,"MODAL"], [80,90,"ACTION"], [95,111,"LOCATION"]]}
{ "text": "In a word, I shall not reconsider the publication until a major revision fully according to my comments has been made.  ", "labels": [[13,18,"MODAL"], [19,33,"ACTION"]]}
{ "text": "2\\. There are some equations coming from other paper’s theories and published works. The author should cite them  ", "labels": [[64,67,"TRIGGER"], [96,102,"MODAL"], [103,107,"ACTION"]]}
{ "text": "3\\. Please expand the motivation, the problem context, clarify the problem description, and (if possible) add specific objectives.  ", "labels": [[11,17,"ACTION"], [55,62,"ACTION"], [88,91,"TRIGGER"], [106,109,"ACTION"]]}
{ "text": "3) The authors have made 13 sections in the current form, while not numbering them. They must reorganize the manuscript by making the sections as follows:  ", "labels": [[58,63,"TRIGGER"], [64,77,"ACTION"], [89,93,"MODAL"], [94,104,"ACTION"], [109,119,"LOCATION"]]}
{ "text": "(3) Results and discussion, including the following subsections: validation, parametric study (containing the profiles of velocity, temperature, concentration, and entropy generation);  ", "labels": [[12,15,"TRIGGER"], [28,37,"ACTION"], [160,163,"TRIGGER"]]}
{ "text": "4) Add “-” between temperature and dependent in the title, make it as appeared in the first line of this review report.  ", "labels": [[31,34,"TRIGGER"], [52,57,"LOCATION"], [59,63,"ACTION"], [86,96,"LOCATION"]]}
{ "text": "2) Add a statement to indicate that the self-similarity is implemented to transfer PDE to ODE, which is then solved by bvp4 function;  ", "labels": [[3,6,"ACTION"], [31,35,"TRIGGER"]]}
{ "text": "3) Lines 18 to 20 should be: A parametric study on axial velocity, ..., and entropy profile has been conducted;  ", "labels": [[3,17,"LOCATION"], [18,24,"MODAL"], [25,27,"ACTION"], [72,75,"TRIGGER"]]}
{ "text": "4) List the key findings of the proposed study in the abstract concisely, instead of indicating what parameters are examined;  ", "labels": [[3,7,"ACTION"], [54,62,"LOCATION"], [74,84,"TRIGGER"], [96,100,"TRIGGER"]]}
{ "text": "5) Change the last statement (validation of the proposed model) to: “The result obtained by our proposed numerical model illustrates a satisfying agreement with the existing results.” It also should be moved before the statements of the key findings.  ", "labels": [[3,9,"ACTION"], [68,181,"LOCATION"], [182,183,"LOCATION"], [187,191,"TRIGGER"], [192,198,"MODAL"], [202,207,"ACTION"]]}
{ "text": "The cumbersome introduction in the current form fails to present neither the coherence nor the novelty of the proposed work clearly.  ", "labels": [[48,64,"ACTION"], [65,72,"TRIGGER"], [87,90,"TRIGGER"]]}
{ "text": "1) According to the title, the more-general subject to study is the “the temperature-dependent transport properties of the viscous fluid flow”. As a result, the authors should start the introduction with it, for example:  ", "labels": [[20,25,"LOCATION"], [68,84,"LOCATION"], [85,142,"LOCATION"], [169,175,"MODAL"], [176,181,"ACTION"], [186,198,"LOCATION"]]}
{ "text": "3) It is also unacceptable to write a general statement such as “Some other works can be found in Refs xx to xx” (Line 48). The authors are required to elaborate the relations of the references.  ", "labels": [[9,13,"TRIGGER"], [14,26,"ACTION"], [64,112,"LOCATION"], [114,121,"LOCATION"], [140,148,"ACTION"]]}
{ "text": "Cite a reference to an equation unless it is proposed here originally.  ", "labels": [[0,4,"ACTION"], [32,38,"TRIGGER"]]}
{ "text": "5\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "2\\. In the manuscript, how to connect the mass transfer with heat transfer?  ", "labels": [[11,21,"LOCATION"], [23,26,"TRIGGER"]]}
{ "text": "1\\. In Introduction, author described past work on permeability, but little comment on the contribution and shortcoming. Author need to provide critical comments on permeability.  ", "labels": [[7,19,"LOCATION"], [65,68,"TRIGGER"], [69,83,"ACTION"], [104,107,"TRIGGER"], [128,132,"MODAL"], [136,143,"ACTION"]]}
{ "text": "It is interesting to see a study on coupled electro-magneto-thermo- poroelasticity under the G-N theory. Unfortunately, the current form of the manuscript fails to present the work in a clear and coherent manner. Thus, I will not consider it for publication until a major revision is made fully according to my following comments  ", "labels": [[105,118,"TRIGGER"], [144,154,"LOCATION"], [155,171,"ACTION"], [192,195,"TRIGGER"], [213,217,"TRIGGER"], [221,225,"MODAL"], [226,238,"ACTION"]]}
{ "text": "1) Delete the phrase “attempts to” (Line 11) that implies the efforts fails finally.  ", "labels": [[3,9,"ACTION"], [21,33,"LOCATION"], [36,43,"LOCATION"]]}
{ "text": "2) The “See beck” (Line 14) is a single word “Seebeck”.  ", "labels": [[7,17,"LOCATION"], [19,26,"LOCATION"]]}
{ "text": "4) Add one to two more statements at the end of the abstract to present the key findings of the proposed work.  ", "labels": [[3,6,"ACTION"], [41,60,"LOCATION"]]}
{ "text": "In the former four paragraphs, each one should consist of three parts: a brief introduction of the theory; a few applications of the theory; and a concise literature review. For example, it is better to start the second paragraph (poroelasticity) with the introduction of the theory and applications:  ", "labels": [[7,29,"LOCATION"], [40,46,"MODAL"], [47,54,"ACTION"], [141,144,"TRIGGER"], [203,208,"ACTION"], [213,229,"LOCATION"], [283,286,"TRIGGER"]]}
{ "text": "Inside the brackets are necessary references to support the statement of the applications. The authors should cite 2~3 references for each application, instead of citing a number of references at the end of all the applications, as they did in Lines 53-59.  ", "labels": [[103,109,"MODAL"], [110,114,"ACTION"], [152,162,"TRIGGER"], [244,252,"LOCATION"], [253,255,"LOCATION"]]}
{ "text": "The authors should revise the first four paragraphs by following my comments fully.  ", "labels": [[12,18,"MODAL"], [19,25,"ACTION"], [30,51,"LOCATION"]]}
{ "text": "In addition, the English writing is awkward. See the “English writing” part for revision.  ", "labels": [[33,43,"ACTION"], [45,48,"ACTION"]]}
{ "text": "1) Change the section name to “Formulation of the problem” or “Derivation of the governing equations of the problem”.  ", "labels": [[3,9,"ACTION"], [31,58,"LOCATION"], [62,116,"LOCATION"]]}
{ "text": "3) What is the symbol “^” in Eq. (1)? It should be cross-product “×”.  ", "labels": [[3,7,"TRIGGER"], [22,23,"LOCATION"], [29,31,"LOCATION"], [34,35,"LOCATION"], [41,47,"MODAL"], [51,56,"ACTION"]]}
{ "text": "4) Cite a reference to an equation, unless it is proposed here originally.  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "2) Some groups of expressions are presented in an unorganized way, for example, those in Lines 142 to 147. List them in a more-organized way.  ", "labels": [[89,105,"LOCATION"], [107,111,"ACTION"]]}
{ "text": "6\\. Numerical results and discussion  ", "labels": [[4,21,"LOCATION"], [22,25,"TRIGGER"]]}
{ "text": "1) Redraw all the figures, since they are all of distorted aspect ratio.  ", "labels": [[3,9,"ACTION"], [27,32,"TRIGGER"]]}
{ "text": "3) The authors should provide a benchmark to validate the proposed model before doing any numerical calculation.  ", "labels": [[15,21,"MODAL"], [22,29,"ACTION"]]}
{ "text": "The authors have presented a miserably awkward English writing in the current form. They need to make a thorough revision for the improvement, particularly some fundamental mistake. For example:  ", "labels": [[89,93,"MODAL"], [97,101,"ACTION"], [143,155,"TRIGGER"]]}
{ "text": "1) Line 38: “were developed” should be “developed”;  ", "labels": [[3,10,"LOCATION"], [12,28,"LOCATION"], [29,35,"MODAL"]]}
{ "text": "3) Line 220: “temperature is decreases” should be “temperature decreases”  ", "labels": [[3,11,"LOCATION"], [13,39,"LOCATION"], [40,46,"MODAL"]]}
{ "text": "Above are only a few examples of the authors’ awful English writing. They need to check the whole manuscript and then make any necessary revisions.  ", "labels": [[74,78,"MODAL"], [82,87,"ACTION"], [98,108,"LOCATION"], [109,112,"TRIGGER"], [118,122,"ACTION"]]}
{ "text": "The proposed study is an interesting extension of the authors’ previous study. The current form of manuscript, however, looks more like an experimental report, instead of a scientific journal paper. Thus, a major revision according to my following comments is required for publication.  ", "labels": [[99,109,"LOCATION"], [111,118,"TRIGGER"], [131,135,"TRIGGER"], [260,268,"ACTION"]]}
{ "text": "The introduction is too short to present a clear and complete background of the proposed study. It can be improved from two perspectives:  ", "labels": [[4,16,"LOCATION"], [17,19,"ACTION"], [20,23,"TRIGGER"], [24,29,"ACTION"], [49,52,"TRIGGER"], [99,102,"MODAL"], [106,114,"ACTION"]]}
{ "text": "1) It is often to illustrate some applications of the relevant study at the beginning of an introduction. The author should begin the introduction that indicates the key advantage of nanofluid with some applications implying the importance. For example, it is better to start:  ", "labels": [[76,104,"LOCATION"], [117,123,"MODAL"], [124,129,"ACTION"], [134,146,"LOCATION"], [147,151,"TRIGGER"], [270,275,"ACTION"]]}
{ "text": "3\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "1) In Section 3.1, it is better to conduct the validation with a model proposed by the authors themselves or some published experimental results or theoretical data.  ", "labels": [[6,15,"LOCATION"], [16,17,"LOCATION"], [35,42,"ACTION"], [106,108,"TRIGGER"], [145,147,"TRIGGER"]]}
{ "text": "3) I am really interested in some parametric studies that have not been presented in the current form yet. For example, the concentration of the particles in the fluid is a critical parameter for practical engineering applications. It is better to include a study of the effects of the concentration of the nano- or microparticles on the separation. At least, the authors should discuss some important parameters that may affect the separation.  ", "labels": [[53,57,"TRIGGER"], [63,81,"ACTION"], [248,255,"ACTION"], [313,315,"TRIGGER"], [372,378,"MODAL"], [379,386,"ACTION"], [413,417,"TRIGGER"]]}
{ "text": "The manuscript has proposed a CFD study of gas holdup and frictional pressure drop of vertical riser inside IC reactor. The authors, however, fail to present the study in a clear and consistent way in the current form. Thus, a major revision fully according to my following comments is required, before my reconsideration of the publication.  ", "labels": [[4,14,"LOCATION"], [54,57,"TRIGGER"], [133,140,"TRIGGER"], [142,157,"ACTION"], [179,182,"TRIGGER"], [286,294,"ACTION"]]}
{ "text": "2) Line 23: “design” should be “optimal design”, since the proposed model is aimed to optimize the design.  ", "labels": [[3,10,"LOCATION"], [12,20,"LOCATION"], [21,27,"MODAL"], [31,32,"LOCATION"], [49,54,"TRIGGER"]]}
{ "text": "1) The first paragraph has presented some background of the related research. The authors, however, should cite some references to support the statements. It is rare without citation in a single paragraph in an introduction;  ", "labels": [[7,22,"LOCATION"], [91,98,"TRIGGER"], [100,106,"MODAL"], [107,111,"ACTION"], [166,173,"TRIGGER"]]}
{ "text": "2) It is inappropriate to cite more than 5 references at a single place (Lines 45). The authors are required to either elaborate the six references or to only cite 2-3 key references;  ", "labels": [[9,30,"ACTION"], [36,40,"TRIGGER"], [73,81,"LOCATION"], [100,108,"ACTION"], [112,118,"TRIGGER"], [148,150,"TRIGGER"]]}
{ "text": "3) The literature review (the 4th and 5th paragraphs) is presented in a confusing way. The authors should list a few examples for CFD method since, as stated in the current form, it is powerful tool to study two-phase flow. For example, it is better to write:  ", "labels": [[34,37,"TRIGGER"], [99,105,"MODAL"], [106,110,"ACTION"], [141,146,"TRIGGER"], [253,258,"ACTION"]]}
{ "text": "4) see the “English writing” part below.  ", "labels": [[3,6,"ACTION"], [34,39,"LOCATION"]]}
{ "text": "1) Cite a reference to an equation, unless it is proposed here originally;  ", "labels": [[3,7,"ACTION"], [36,42,"TRIGGER"]]}
{ "text": "2) see the “English writing” part below.  ", "labels": [[3,6,"ACTION"], [34,39,"LOCATION"]]}
{ "text": "1) Although the results look “making sense”, it is necessary to present at least a validation study, i.e. a comparison of the results obtained by the proposed study and those published in the literature;  ", "labels": [[29,43,"LOCATION"], [64,71,"ACTION"], [165,168,"TRIGGER"]]}
{ "text": "4) see the “English writing” part below.  ", "labels": [[3,6,"ACTION"], [34,39,"LOCATION"]]}
{ "text": "Line 22: the “was” in “XX and XX was reduced ...” should be “were”;  ", "labels": [[0,7,"LOCATION"], [13,18,"LOCATION"], [22,25,"LOCATION"], [26,29,"TRIGGER"], [30,44,"LOCATION"], [48,49,"LOCATION"], [50,56,"MODAL"]]}
{ "text": "Line 226: “the constant a and b are ...” should be “constants a and b are...”;  ", "labels": [[0,8,"LOCATION"], [10,25,"LOCATION"], [26,29,"TRIGGER"], [30,35,"LOCATION"], [39,40,"LOCATION"], [41,47,"MODAL"], [64,67,"TRIGGER"]]}
{ "text": "The 2nd particularly awful issue is the abuse of articles (a and the). For example,  ", "labels": [[8,20,"TRIGGER"], [61,64,"TRIGGER"]]}
{ "text": "Line 15: it should be “the present study”;  ", "labels": [[0,7,"LOCATION"], [12,18,"MODAL"]]}
{ "text": "Line 18: it should be “bubble flow inside a vertical riser”;  ", "labels": [[0,7,"LOCATION"], [12,18,"MODAL"], [22,59,"LOCATION"]]}
{ "text": "Above are only a few examples of the cumbersome English-writing. The author is recommended to check the whole text and then make any necessary revisions.  ", "labels": [[79,90,"ACTION"], [94,99,"ACTION"], [104,114,"LOCATION"], [115,118,"TRIGGER"], [124,128,"ACTION"]]}
{ "text": "2) A figure or a table should be presented after it is mentioned in the text for the first time.  ", "labels": [[12,14,"TRIGGER"], [23,29,"MODAL"], [33,42,"ACTION"], [72,76,"LOCATION"]]}
{ "text": "The abstract in the current form has been presented in quite an incoherent way, making me totally lost when reading it. I have no idea what the proposed study has done after reading the abstract. The authors are required to revise it completely by following the requirements:  ", "labels": [[4,12,"LOCATION"], [42,51,"ACTION"], [98,102,"ACTION"], [103,107,"TRIGGER"], [127,134,"ACTION"], [135,139,"TRIGGER"], [212,220,"ACTION"]]}
{ "text": "1) Do NOT make too much background in the abstract; make it 2 to 4 lines;  ", "labels": [[3,14,"ACTION"], [15,18,"TRIGGER"], [42,50,"LOCATION"], [52,56,"ACTION"]]}
{ "text": "2) Clearly indicate what the proposed study has done, what methods has been implemented to achieve the novelty (the difference from previous studies);  ", "labels": [[11,19,"ACTION"], [20,24,"TRIGGER"], [54,58,"TRIGGER"]]}
{ "text": "3) Clearly present key findings of the study. I have no idea what the last sentence of the current abstract means.  ", "labels": [[11,18,"ACTION"], [61,65,"TRIGGER"], [70,86,"LOCATION"]]}
{ "text": "The cumbersome and redundant introduction in the current form fails to present neither the coherence nor the novelty of the proposed work clearly. A thorough revision is required.  ", "labels": [[15,18,"TRIGGER"], [62,78,"ACTION"], [79,86,"TRIGGER"], [101,104,"TRIGGER"], [170,178,"ACTION"]]}
{ "text": "1) The author should quickly reach the advantage of the nanofluid compared to conventional fluids, instead of presenting too much background. As a result, the authors should start the introduction in the recommend way:  ", "labels": [[14,20,"MODAL"], [29,34,"ACTION"], [99,109,"TRIGGER"], [121,124,"TRIGGER"], [167,173,"MODAL"], [174,179,"ACTION"], [184,196,"LOCATION"]]}
{ "text": "The authors should keep in mind that the method implemented in the proposed study (homotopy analysis) is well-established. The failure to present the significance or novelty of the proposed work clearly by comparing with others’ works undermines the novelty of the manuscript significantly.  ", "labels": [[12,18,"MODAL"], [19,31,"ACTION"], [32,36,"TRIGGER"], [102,109,"ACTION"], [163,165,"TRIGGER"]]}
{ "text": "3) It is also unacceptable to write a general statement such as “Some current studies can be found in Refs xx to xx” (Line 84). The authors are required to elaborate the relations of the references or to only cite 2 to 4 key references.  ", "labels": [[9,13,"TRIGGER"], [14,26,"ACTION"], [64,116,"LOCATION"], [118,125,"LOCATION"], [144,152,"ACTION"], [198,200,"TRIGGER"]]}
{ "text": "The authors need to indicate what a symbol means before presenting it, for example S in Line 101, although a nomenclature is given at the end.  ", "labels": [[12,16,"MODAL"], [20,28,"ACTION"], [29,33,"TRIGGER"], [88,96,"LOCATION"], [98,106,"TRIGGER"], [125,130,"ACTION"], [134,141,"LOCATION"]]}
{ "text": "5\\. Results and discussion  ", "labels": [[4,11,"LOCATION"], [12,15,"TRIGGER"]]}
{ "text": "3) The authors have to use different written words or phrases to express causality, for example, as a consequence, lead to, result in/from, etc. The causality in the current form is presented in a cumbersome manner.  ", "labels": [[51,53,"TRIGGER"], [140,143,"TRIGGER"]]}
{ "text": "4) It makes me quite uncomfortable when reading the text to present the section in a single section. The authors are strongly suggested dividing the section into different paragraphs accordingly.  ", "labels": [[21,34,"ACTION"], [35,39,"TRIGGER"], [117,144,"ACTION"], [183,194,"TRIGGER"]]}
{ "text": "5) At least one comparison of the result obtained by the proposed study and that obtained by previous published works is needed for validation.  ", "labels": [[72,80,"TRIGGER"], [121,127,"ACTION"]]}
{ "text": "The Introduction section is very poor. It is necessary to frame the work in a broader form. This section has to improve substantially. Bibliographic references are scarce, especially in the international area. It is necessary to provide more literature, consult international Journals.  ", "labels": [[4,24,"LOCATION"], [25,37,"ACTION"], [58,63,"ACTION"], [92,104,"LOCATION"], [112,119,"ACTION"], [164,170,"ACTION"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "I have not seen the Conclusions section. Concise conclusions need to be drawn, not as a summary. If possible, these conclusions are clearly expressed, for example as key points.  ", "labels": [[2,15,"ACTION"], [20,39,"LOCATION"], [61,65,"MODAL"], [72,77,"ACTION"], [79,82,"TRIGGER"], [140,149,"ACTION"]]}
{ "text": "This paper analyzes the hydrological process of groundwater recharge in the arid desert of Gobi. To do this, a water balance model is combined with the use of tracers. The source data are 10 precipitation events totalling 41.5 mm in total and represent the inputs of the model. The outputs are by evaporation estimated with the Penman-Monteith method and by infiltration and incorporation into the groundwater body. The storage component is the moisture content of the soil.  ", "labels": [[5,10,"LOCATION"], [239,242,"TRIGGER"], [351,354,"TRIGGER"], [371,374,"TRIGGER"]]}
{ "text": "The main issues that I have found in this manuscript are related to a disorder of its content. Below are my suggestions that I think the authors will be able to address as a Major revision:  ", "labels": [[16,20,"TRIGGER"], [42,52,"LOCATION"], [120,124,"TRIGGER"], [145,149,"MODAL"], [153,168,"ACTION"]]}
{ "text": "1\\. The title of the work is very confusing. I think it can be written more clearly and concisely.  ", "labels": [[34,43,"ACTION"], [56,59,"MODAL"], [63,70,"ACTION"], [84,87,"TRIGGER"]]}
{ "text": "2\\. There is a great mix of methods and data with results. Section 4.1 are not results, it has to be in section 3.  ", "labels": [[36,39,"TRIGGER"], [59,68,"LOCATION"], [69,70,"LOCATION"], [71,86,"ACTION"], [104,113,"LOCATION"]]}
{ "text": "3\\. Section 4.2 is also about data collected during the research campaign. Therefore it cannot be in the results section.  ", "labels": [[4,13,"LOCATION"], [14,15,"LOCATION"], [19,23,"TRIGGER"], [75,84,"TRIGGER"], [88,94,"MODAL"], [95,97,"ACTION"], [105,120,"LOCATION"]]}
{ "text": "4\\. The Eddy Correlation Method, although cited in the introduction in the section Methods the development is missing.  ", "labels": [[33,41,"TRIGGER"], [55,67,"LOCATION"], [75,90,"LOCATION"], [107,117,"ACTION"]]}
{ "text": "5\\. Section 4.4 would be the results of the water balance model.  ", "labels": [[4,13,"LOCATION"], [14,15,"LOCATION"], [16,21,"MODAL"], [22,24,"LOCATION"]]}
{ "text": "7\\. The section \"4.6 Results of Tracer-Based Approach\" are results but cannot go within \"4. Results of Water Balance Approach.”  ", "labels": [[4,18,"LOCATION"], [19,38,"LOCATION"], [39,53,"LOCATION"], [67,70,"TRIGGER"], [71,77,"MODAL"], [78,80,"ACTION"]]}
{ "text": "Introduction: In my opinion, this is the weakest part of the paper. The Authors should add an overview of previous relevant works in the literature about other existing methodologies. The perspectives offered in the current version are very limited. They need to be greatly expanded. It is not explained in detail what scientific gaps authors want to address.  ", "labels": [[0,12,"LOCATION"], [80,86,"MODAL"], [87,90,"ACTION"], [255,259,"MODAL"], [274,282,"ACTION"], [290,303,"ACTION"], [314,318,"TRIGGER"]]}
{ "text": "The objectives of the work are not at all clear. In the final part of the introduction it is necessary to state the objectives explicitly and concretely and to place them within a more general framework.  ", "labels": [[27,47,"ACTION"], [56,86,"LOCATION"], [106,111,"ACTION"], [138,141,"TRIGGER"], [153,156,"TRIGGER"], [160,165,"ACTION"]]}
{ "text": "Also at the end of the introduction it is necessary to describe the general content of the article, with a short summary of each section.  ", "labels": [[0,4,"TRIGGER"], [12,35,"LOCATION"], [55,63,"ACTION"]]}
{ "text": "It is necessary to prepare a description of the place of origin of each type of salt. A geological description of the deposits from which the samples come is also necessary. Stratigraphic column of the complete series, lithology, situation of the coal layers within the column, age of the geological formations, geological map with geological formations, situation of the salt reservoirs and local or regional geological structure. Geological cross sections are also necessary.  ", "labels": [[3,15,"ACTION"], [158,162,"TRIGGER"], [388,391,"TRIGGER"], [398,400,"TRIGGER"], [462,466,"TRIGGER"], [467,476,"ACTION"]]}
{ "text": "The chemical composition (chlorides or sulfates of sodium, potassium, calcium??) and mineralogical (halite, silvinite, carnalite, glauberite, thenardite, gypsum, anhydrite??) of the different types of salt must be described, perhaps in the petrographic section or in a possible section on the framework.  ", "labels": [[36,38,"TRIGGER"], [81,84,"TRIGGER"], [206,210,"MODAL"], [214,223,"ACTION"], [225,232,"TRIGGER"], [261,263,"TRIGGER"]]}
{ "text": "In the geographical section, more crystallographic description is necessary (e.g. crystallization system, class, etc.)  ", "labels": [[7,27,"LOCATION"], [63,75,"ACTION"], [113,116,"TRIGGER"]]}
{ "text": "Nothing or very little is said about leachate production. The composition and concentration of salts must be indicated, as well as the volume produced by the amount of salt dissolved and by the volume of reservoir enabled and its storage capacity.  ", "labels": [[0,7,"ACTION"], [8,10,"TRIGGER"], [74,77,"TRIGGER"], [101,105,"MODAL"], [109,118,"ACTION"], [183,186,"TRIGGER"], [222,225,"TRIGGER"]]}
{ "text": "Above all, it must be presented how these leachates are managed, where they will end up and their polluting potential on the environment.  ", "labels": [[14,18,"MODAL"], [22,31,"ACTION"], [32,35,"TRIGGER"], [88,91,"TRIGGER"]]}
{ "text": "A water balance between the amount of water that intervenes in the industrial process of enabling reservoirs is necessary. Amount of water consumed, amount of leachate produced and water losses due to processes such as evaporation.  ", "labels": [[44,48,"TRIGGER"], [109,121,"ACTION"], [177,180,"TRIGGER"]]}
{ "text": "Line 207 and following replace \"\"Figure 2\"\" with \"\"Figure 4\"\". Please review these types of minor errors throughout the text.  ", "labels": [[0,8,"LOCATION"], [9,12,"TRIGGER"], [33,41,"LOCATION"], [50,59,"LOCATION"], [70,76,"ACTION"], [120,124,"LOCATION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Investigation on coal fragmentation by high-velocity water jet in drilling: size distributions and fractal characteristics” by Songqiang Xiao, Zhaolong Ge, Yiyu Lu, Zhe Zhou, Qian Li, Lei Wang.  ", "labels": [[46,56,"LOCATION"], [66,110,"LOCATION"], [111,141,"LOCATION"], [143,161,"LOCATION"], [162,165,"TRIGGER"], [166,190,"LOCATION"]]}
{ "text": "In this paper the Authors describe the particle size distribution, morphology and fractal characteristics of coal fragments generated from Water Jet Drilling (WJD). These features are determined by the coal failure patterns subjected to water jets in WJD, which are mainly related to the hydraulic parameters of water jets and the coal strength and its structure. According to the results, the particle cumulative frequency distributions, size distribution density, shape features (major axis/minor axis) and fractal dimensions of coal fragments for various jet impact velocities and coal strengths were analyzed based on the three-parameter GEV distribution and fractal theory.  ", "labels": [[3,13,"LOCATION"], [78,81,"TRIGGER"], [323,326,"TRIGGER"], [345,348,"TRIGGER"], [505,508,"TRIGGER"], [580,583,"TRIGGER"], [659,662,"TRIGGER"]]}
{ "text": "The manuscript seems interesting to me, but before publishing it needs to reorganize the content, because in my opinion the main issue is that there is a messy mixture between Methods and Results, therefore I recommend its publication after considering a Major Revision. My suggestions are these:  ", "labels": [[4,14,"LOCATION"], [65,70,"MODAL"], [74,84,"ACTION"], [98,105,"TRIGGER"], [135,142,"TRIGGER"], [184,187,"TRIGGER"], [197,206,"TRIGGER"]]}
{ "text": "In the final part of the introduction it would be necessary to explicitly state the objectives of this work as well as a brief description of the content of the manuscript, the methodology used in this research, etc.  ", "labels": [[7,37,"LOCATION"], [41,46,"MODAL"], [74,79,"ACTION"], [212,215,"TRIGGER"]]}
{ "text": "It is necessary a geological description at the level of geological formations, chronostratigraphy, lithology, structure, diagenetic environment, etc.  ", "labels": [[3,15,"ACTION"], [146,149,"TRIGGER"]]}
{ "text": "It would also be necessary, if available, for a thin-plate petrographic study that highlights the mineralogy and the texture of the rock.  ", "labels": [[3,8,"MODAL"], [9,13,"TRIGGER"], [14,26,"ACTION"], [78,82,"TRIGGER"], [109,112,"TRIGGER"]]}
{ "text": "The title is somewhat redundant. Please think of a shorter and more accurate title.  ", "labels": [[4,9,"LOCATION"], [22,31,"ACTION"], [59,62,"TRIGGER"]]}
{ "text": "Introduction. Part of the introduction is not endorsed by bibliographical references. Lines 34 to 39 need to be completed with bibliographic references related to the content of each paragraph. The same goes for Lines 41 to 50 and Lines 79 to 84.  ", "labels": [[39,54,"ACTION"], [86,100,"LOCATION"], [212,226,"LOCATION"], [227,230,"TRIGGER"], [231,245,"LOCATION"]]}
{ "text": "The objectives of the work are not clearly seen or are very short. At the end of the introduction it is necessary to explicitly establish the objectives of the work, at two levels, one in a broad framework, related to similar issues and problems in the real world, and another level of objectives in a specific framework.  ", "labels": [[31,47,"ACTION"], [48,50,"TRIGGER"], [51,65,"ACTION"], [70,97,"LOCATION"], [128,137,"ACTION"], [233,236,"TRIGGER"], [265,268,"TRIGGER"]]}
{ "text": "At the end of the introduction it is necessary to prepare a brief summary of the focus and content of each section. This will certainly help the reader.  ", "labels": [[7,30,"LOCATION"], [50,57,"ACTION"], [87,90,"TRIGGER"], [121,125,"MODAL"], [126,135,"TRIGGER"], [136,140,"ACTION"]]}
{ "text": "Figure 1. Please point out the slope and length of the channel, the width of the channel and the plan angles between the three alignments.  ", "labels": [[0,8,"LOCATION"], [17,26,"ACTION"], [37,40,"TRIGGER"], [89,92,"TRIGGER"]]}
{ "text": "The conclusions are good but too specific. Conclusions were completed in a broader framework within the scope.  ", "labels": [[4,15,"LOCATION"], [25,32,"TRIGGER"], [33,41,"ACTION"]]}
{ "text": "Figure 11 lack readability. Please do something about it. Also, for a better understanding, some of the legends should be explained in the text.  ", "labels": [[0,9,"LOCATION"], [35,37,"ACTION"], [58,62,"TRIGGER"], [112,118,"MODAL"], [122,131,"ACTION"], [139,143,"LOCATION"]]}
{ "text": "The dedication to the study area is quite poor. It is necessary to expand it with the contribution of general characteristics on hydroclimatology, hydromorphology, etc. It would be good to accompany with Figures.  ", "labels": [[67,73,"ACTION"], [164,167,"TRIGGER"], [172,177,"MODAL"], [204,211,"LOCATION"]]}
{ "text": "This article investigates the temporal trend of temperature data on the island of Sardinia (Italy) considering 48 series in the period 1982-2011. Specifically, monthly temperatures (maximum and minimum) and some indices of daily extremes were evaluated and tested to detect trends using the Mann- Kendall non-parametric test.  ", "labels": [[0,12,"LOCATION"], [190,193,"TRIGGER"], [203,206,"TRIGGER"], [253,256,"TRIGGER"]]}
{ "text": "The introduction is well written regarding references to other regions of the planet however it would be necessary to write a part with references to the methodology  ", "labels": [[4,16,"LOCATION"], [85,92,"TRIGGER"], [96,101,"MODAL"], [118,123,"ACTION"]]}
{ "text": "In addition, it should be stated explicitly which with the main contributions of the article to the world of hydrology. The relationship of temperature with hydrological processes is known, but a more precise description should be made in this article.  ", "labels": [[16,22,"MODAL"], [26,32,"ACTION"], [44,49,"TRIGGER"], [190,193,"TRIGGER"], [221,227,"MODAL"], [231,235,"ACTION"]]}
{ "text": "Data section: A brief description of the time series, statistics, maximum and minimum, average deviation, coefficient of variation, etc. is necessary (perhaps with a Table).  ", "labels": [[0,12,"LOCATION"], [74,77,"TRIGGER"], [132,135,"TRIGGER"], [137,149,"ACTION"], [151,158,"TRIGGER"]]}
{ "text": "Review Section numbering, e.g. Section 3 repeated and section 2 missing.  ", "labels": [[0,14,"LOCATION"], [31,40,"LOCATION"], [50,53,"TRIGGER"], [54,63,"LOCATION"], [64,71,"ACTION"]]}
{ "text": "This paper investigates the modelling of the surface hydrological process known as routing, controlled with a single parameter, the Manning roughness coefficient. It is applied in two-dimensional coupled hydrological-hydraulic distributed numerical models based on shallow water differential equations. For this, three different test cases have been used, in the United States with four pilot catchments, another in Mexico and another in Spain.  ", "labels": [[0,10,"LOCATION"], [423,426,"TRIGGER"]]}
{ "text": "For the same precipitation event, the magnitude and shape of the flood, in addition to the routing process, depends on other variables. Please take this into account in the discussion section.  ", "labels": [[48,51,"TRIGGER"], [143,147,"ACTION"], [173,191,"LOCATION"]]}
{ "text": "In the discussion of points 4 and 5 take into account this publication: DOI 10.1007/s12665-013-2668-5.  ", "labels": [[7,29,"LOCATION"], [30,33,"TRIGGER"], [34,35,"LOCATION"], [36,53,"ACTION"]]}
{ "text": "When simulating an event with different models (for example, one hydrological and another hydrodynamic), similar results are obtained with similar values of the roughness coefficient? Please take this into account in the discussion section.  ", "labels": [[0,4,"TRIGGER"], [78,81,"TRIGGER"], [191,195,"ACTION"], [221,239,"LOCATION"]]}
{ "text": "The Abstract is very messy and difficult to follow. It takes a lot of effort and dedication to generate a convincing Abstract.  ", "labels": [[4,12,"LOCATION"], [27,30,"TRIGGER"], [55,60,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Relationship between surface borehole wall dislocation and overlying strata movement induced by top-coal longwall mining” by Jinfeng Ju, Jialin Xu and Jingmin Xu. My suggestion is to recommend a Major Revision, which is mainly motivated by the lack of coordination in the structure of the manuscript, n which the following terms are considered:  ", "labels": [[46,56,"LOCATION"], [66,121,"LOCATION"], [122,125,"TRIGGER"], [126,166,"LOCATION"], [167,188,"LOCATION"], [214,217,"TRIGGER"]]}
{ "text": "The title is very confusing. The authors must choose a clear title that is representative of the work developed.  ", "labels": [[4,9,"LOCATION"], [18,27,"ACTION"], [41,45,"MODAL"], [46,52,"ACTION"], [67,71,"TRIGGER"]]}
{ "text": "In the introduction, the objectives of the work should be clearly stated.  ", "labels": [[7,19,"LOCATION"], [48,54,"MODAL"], [66,72,"ACTION"]]}
{ "text": "Sections 2.1 and 2.2 have the same caption. Please, clarify this.  ", "labels": [[0,10,"LOCATION"], [11,12,"LOCATION"], [13,16,"TRIGGER"], [17,18,"LOCATION"], [19,20,"LOCATION"], [52,59,"ACTION"]]}
{ "text": "There should be a Materials and Methods section containing the current section 2 and section 3.1.  ", "labels": [[6,12,"MODAL"], [13,15,"ACTION"], [28,31,"TRIGGER"], [71,80,"LOCATION"], [81,84,"TRIGGER"], [85,94,"LOCATION"], [95,96,"LOCATION"]]}
{ "text": "There should be a main results section with current section 3.2  ", "labels": [[6,12,"MODAL"], [13,15,"ACTION"], [52,61,"LOCATION"]]}
{ "text": "Although a discussion is carried out in section 4, it is necessary that the discussion section covers all aspects of the publication, taking into account especially the objectives of the work that must be clearly stated in the introduction.  ", "labels": [[40,49,"LOCATION"], [67,71,"TRIGGER"], [76,94,"LOCATION"], [192,196,"TRIGGER"], [197,201,"MODAL"], [213,219,"ACTION"], [223,239,"LOCATION"]]}
{ "text": "The Abstract is very messy and difficult to follow. It takes a lot of effort and dedication to generate a convincing Abstract.  ", "labels": [[4,12,"LOCATION"], [27,30,"TRIGGER"], [55,60,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "Figure 1 is lousy quality. A physical map should be handled in a subfigure and the altimetry map kept.  ", "labels": [[0,8,"LOCATION"], [9,25,"ACTION"], [42,48,"MODAL"], [52,59,"ACTION"], [75,78,"TRIGGER"]]}
{ "text": "Figure 2 it is necessary to add a lithological or geological type coverage.  ", "labels": [[0,8,"LOCATION"], [12,24,"ACTION"], [47,49,"TRIGGER"]]}
{ "text": "Section 2.2 needs more information on the 0.5º raster dataset. For example, density of original meteorological stations, quality of interpolation, role of GTOPO30, is a meteorological data/elevation correlation carried out?  ", "labels": [[0,9,"LOCATION"], [10,11,"LOCATION"], [12,17,"ACTION"]]}
{ "text": "The conclusions are not conclusions as such. They are a summary of the work and a proposal of research paths for future work. It is necessary to establish two levels of conclusions, a specific level regarding the results of the study and a broader level related to applications and fields of research.  ", "labels": [[4,15,"LOCATION"], [16,35,"ACTION"], [76,79,"TRIGGER"], [145,154,"ACTION"], [234,237,"TRIGGER"], [278,281,"TRIGGER"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Study on the Developmental Behavior of Water-Conducting Fracture Zone in the Overlying Strata of Shortwall Block Mining Beneath Aquifers in Western China” by Yun Zhang, Shenggen Cao, Rui Gao, Shuai Guo and Lixin Lan.  ", "labels": [[46,56,"LOCATION"], [66,111,"LOCATION"], [112,221,"LOCATION"], [269,272,"TRIGGER"]]}
{ "text": "1\\. Very long and confusing title. A shorter and successful title would be more attractive to potential readers.  ", "labels": [[14,17,"TRIGGER"], [45,48,"TRIGGER"]]}
{ "text": "In the title reference is made to conductive water areas, however in the title nothing is said about water or flow.  ", "labels": [[7,22,"LOCATION"], [58,65,"TRIGGER"], [73,78,"LOCATION"], [79,86,"ACTION"], [107,109,"TRIGGER"]]}
{ "text": "To better describe the study area, a regional geological description is needed, with its formations, ages and lithological and stratigraphic characteristics, as well as the regional geological structure in broad strokes. A regional geological map could help frame the study area and understand the stratigraphic configuration.  ", "labels": [[72,78,"ACTION"], [106,109,"TRIGGER"], [123,126,"TRIGGER"], [247,252,"MODAL"], [279,282,"TRIGGER"]]}
{ "text": "It is also necessary to provide information on the hydrogeological characteristics of the environment, aquifers, rivers, lakes, etc.  ", "labels": [[6,10,"TRIGGER"], [128,131,"TRIGGER"]]}
{ "text": "9\\. Figure 1 needs to be georeferenced, with scale and compass rose. You also need to place the study area within a map of China.  ", "labels": [[4,12,"LOCATION"], [51,54,"TRIGGER"], [73,77,"TRIGGER"], [78,82,"MODAL"], [86,91,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Investigation of deep mine shaft stability in alternate hard and soft rock strata using three‑dimensional numerical modeling” by Xiaoming Sun, Li-gan, Zhao Chengwei, Liu yangyang and Miao Chengyu.  ", "labels": [[46,56,"LOCATION"], [66,127,"LOCATION"], [128,131,"TRIGGER"], [132,192,"LOCATION"], [246,249,"TRIGGER"]]}
{ "text": "This document describes the mechanics of deformation and tension of the lining of shaft type mining and the surrounding rock mass. The geological conditions of the rock mass correspond to a stratigraphic alternation of competent rock and plastic rock. The Anju coal mine, Shandong Province, China is taken as a case study.  ", "labels": [[5,13,"LOCATION"], [53,56,"TRIGGER"], [100,103,"TRIGGER"], [234,237,"TRIGGER"]]}
{ "text": "1\\. Figure 1 is illegible and with it, it is very difficult to locate the situation of the case study. It is necessary to add another sub-figure at a regional scale with the precise location, scale, georeferencing, orientation, etc.  ", "labels": [[4,12,"LOCATION"], [13,25,"ACTION"], [26,29,"TRIGGER"], [50,69,"ACTION"], [122,125,"ACTION"], [228,231,"TRIGGER"]]}
{ "text": "2\\. Figure 3 describes the stratigraphic column in a generic way but I believe that a wider geological description would be necessary. Stratigraphic formations, lithological composition and stratigraphic structure of the formations, discontinuities, tectonic structure, etc.  ", "labels": [[4,12,"LOCATION"], [65,68,"TRIGGER"], [79,83,"TRIGGER"], [115,120,"MODAL"], [124,133,"ACTION"], [186,189,"TRIGGER"], [270,273,"TRIGGER"]]}
{ "text": "3\\. The mechanical characteristics of the two lithologies, plastic and elastic, should have wider development.  ", "labels": [[4,57,"LOCATION"], [59,66,"LOCATION"], [67,70,"TRIGGER"], [71,78,"LOCATION"], [80,86,"MODAL"], [87,109,"ACTION"]]}
{ "text": "4\\. In my opinion, the role that water plays in mining is crucial. I believe that it would be necessary a greater development on the hydric processes, at the level of hydrogeological description, aquifers, confining formations, permeability. Also, answer questions such as: How does the presence of water affect its variation in mechanical behaviour?  ", "labels": [[28,32,"TRIGGER"], [77,81,"TRIGGER"], [85,90,"MODAL"], [242,246,"TRIGGER"], [274,282,"TRIGGER"]]}
{ "text": "5\\. The keywords are very complex and they should be simpler and more attractive for the reader  ", "labels": [[4,16,"LOCATION"], [26,33,"LOCATION"], [34,37,"TRIGGER"], [43,49,"MODAL"], [53,60,"ACTION"], [61,64,"TRIGGER"], [65,80,"ACTION"]]}
{ "text": "6\\. I think that an important grammatical revision is necessary, because in many occasions the meaning of the sentences is not taken well  ", "labels": [[12,16,"TRIGGER"], [54,63,"ACTION"], [65,72,"TRIGGER"], [123,132,"ACTION"]]}
{ "text": "The methodology is interesting, but it is necessary to highlight several aspects that I will comment below considered as a Major Revision:  ", "labels": [[32,35,"TRIGGER"], [55,64,"ACTION"], [81,85,"TRIGGER"]]}
{ "text": "In section 4 (Results), it is necessary to highlight in the text the spatiotemporal qualities of floods and, if possible, with quantitative data such as extent of maximum flood, volume of stored water mass, etc.  ", "labels": [[3,12,"LOCATION"], [43,52,"ACTION"], [56,64,"LOCATION"], [104,107,"TRIGGER"], [207,210,"TRIGGER"]]}
{ "text": "In the discussion section it is necessary to highlight the new findings regarding the publication of Debusscher and Van Coillie (2019). What are the new methodological contributions and what are the new results?  ", "labels": [[7,25,"LOCATION"], [45,54,"ACTION"], [112,115,"TRIGGER"], [136,140,"TRIGGER"], [182,190,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Experimental study of the pore structure and permeability of coal by acidizing” by Zhao Bo, Guangcai Wen, Haitao Sun and Xusheng Zhao.  ", "labels": [[46,56,"LOCATION"], [66,107,"LOCATION"], [108,111,"TRIGGER"], [112,146,"LOCATION"], [184,187,"TRIGGER"]]}
{ "text": "In this paper, a research experiment of hydraulic fracturing in coal deposits is designed by applying acid injected under pressure to improve the permeability of the rock. The porosity and natural fracturing of the rock are initially cemented and sealed, but through the application of acidification processes, the opening of the ducts is achieved, improving the permeability of the rock and allowing the extraction of methane gas. In my opinion, this article needs Major Revision. Below are my suggestions:  ", "labels": [[3,13,"LOCATION"], [185,188,"TRIGGER"], [243,246,"TRIGGER"], [388,391,"TRIGGER"], [460,465,"MODAL"], [466,480,"ACTION"]]}
{ "text": "2\\. The introduction is not very concise. When one reads, one finds it difficult to find out what one is trying to find out in this work. In addition, in the final part of the introduction it is necessary to clearly establish the objectives of this article.  ", "labels": [[8,20,"LOCATION"], [24,40,"ACTION"], [93,97,"TRIGGER"], [158,188,"LOCATION"], [216,225,"ACTION"]]}
{ "text": "3\\. In the introduction it is said “Mineral block in cleats is composed of authigenic minerals such as carbonates and aluminosilicates”. But it is probably primary minerals. A geological description of the coal deposit and its surroundings would be necessary  ", "labels": [[11,23,"LOCATION"], [35,113,"LOCATION"], [114,117,"TRIGGER"], [118,135,"LOCATION"], [137,140,"TRIGGER"], [219,222,"TRIGGER"], [240,245,"MODAL"]]}
{ "text": "5\\. The presentation is very poorly elaborated. Line numbers: in some parts of the text there are numbering but in other parts there is not. On the other hand, the numbering starts on each page, but the pages are unnumbered, so it is impossible to make specific references to the text. Please number the lines from beginning to end continuously, and number the pages of the text.  ", "labels": [[29,46,"ACTION"], [195,198,"TRIGGER"], [234,244,"ACTION"], [293,299,"ACTION"], [346,349,"TRIGGER"]]}
{ "text": "It is necessary to define acronyms and model names, preferably the first time they are named and optionally by means of a list.  ", "labels": [[19,25,"ACTION"], [35,38,"TRIGGER"], [93,96,"TRIGGER"]]}
{ "text": "The Abstract is very messy and difficult to follow. It takes a lot of effort and dedication to generate a convincing Abstract  ", "labels": [[4,12,"LOCATION"], [27,30,"TRIGGER"], [55,60,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “A new coupled Biodegradation–BioClog model for optimizing bioreactor landfill stabilization while minimizing drainage clogging” by Dan Liu, Xinhua Zhou, Xuan Wang, Jiajia Fang and Yunlong Zhang.  ", "labels": [[46,56,"LOCATION"], [66,95,"LOCATION"], [96,158,"LOCATION"], [159,164,"TRIGGER"], [165,194,"LOCATION"], [243,246,"TRIGGER"]]}
{ "text": "The article presented is almost 100% theoretical. Although I do not believe that the authors are willing to carry out experimental verifications of the theoretical models presented here, in my opinion I believe that there is the possibility of documenting with experimental results of other authors that are related to the objectives of the work.  ", "labels": [[61,75,"ACTION"], [76,80,"TRIGGER"], [108,117,"ACTION"], [211,215,"TRIGGER"], [299,303,"TRIGGER"]]}
{ "text": "The objectives of the work must be established explicitly in the final part of the introduction.  ", "labels": [[27,31,"MODAL"], [35,46,"ACTION"], [61,95,"LOCATION"]]}
{ "text": "On the genesis of leachates in landfills, little is said. The leachate generation process should be develop, which depends mainly on rainfall.  ", "labels": [[90,96,"MODAL"], [100,107,"ACTION"]]}
{ "text": "Issues such as the influence of the climatology of the region where the landfills are located should be addressed at least in the introduction, with references to previous works.  ", "labels": [[94,100,"MODAL"], [104,113,"ACTION"], [130,142,"LOCATION"]]}
{ "text": "It would lack a complete scheme of the cycle of leachate and its water balance, from the main origin (rain) to the elimination through processes of evaporation, evapotranspiration and recirculation that feed back the previous processes.  ", "labels": [[3,8,"MODAL"], [9,13,"ACTION"], [57,60,"TRIGGER"], [180,183,"TRIGGER"], [198,202,"TRIGGER"]]}
{ "text": "Line 73 needs a summary of the [reference 16] petrographic description of the four granitoids. Discuss analogies and differences. Is anything known about its magmatic differentiation phases and melting / solidification temperatures deduced from its mineralogy and texture?  ", "labels": [[0,7,"LOCATION"], [8,13,"MODAL"], [32,44,"LOCATION"], [95,102,"ACTION"], [113,116,"TRIGGER"], [190,193,"TRIGGER"], [260,263,"TRIGGER"]]}
{ "text": "Perhaps data on the location of these rocks could be provided.  ", "labels": [[0,7,"TRIGGER"], [44,49,"MODAL"], [53,61,"ACTION"]]}
{ "text": "Please do not mix methods within the discussion: e.g., Equation 1 and Figure 9 create a section in the Methods section.  ", "labels": [[7,17,"ACTION"], [37,47,"LOCATION"], [55,65,"LOCATION"], [66,69,"TRIGGER"], [70,78,"LOCATION"], [79,85,"ACTION"], [103,118,"LOCATION"]]}
{ "text": "In equation 1 what is “A”. Perhaps it would be interesting to provide an example of density calculation with this equation.  ", "labels": [[3,13,"LOCATION"], [14,18,"TRIGGER"], [22,25,"LOCATION"], [27,34,"TRIGGER"], [38,43,"MODAL"], [62,69,"ACTION"]]}
{ "text": "The introduction lacks a general framework for the study. A framing is needed with other related topics and with more bibliographical references. This section has to improve substantially. Bibliographic references are scarce.  ", "labels": [[4,16,"LOCATION"], [71,77,"ACTION"], [104,107,"TRIGGER"], [146,158,"LOCATION"], [166,173,"ACTION"], [214,224,"ACTION"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Movement boundary shape of overburden strata and its influencing factors” by Changchun He, Jialin Xu, Fei Wang and Feng Wang.  ", "labels": [[46,56,"LOCATION"], [66,111,"LOCATION"], [112,115,"TRIGGER"], [116,140,"LOCATION"], [178,181,"TRIGGER"]]}
{ "text": "The deformation shape of the overlying strata because the collapse of the drifts mining, as well as the factors that intervene in the process are modelled in this paper. The prediction of this phenomenon is useful in territorial planning because delimiting the areas of risk of subsidence in the terrain surface. In my opinion, this work is of good quality, useful and well presented. My suggestion is to recommend a Major Revision. Some concerns below:  ", "labels": [[46,53,"TRIGGER"], [112,116,"TRIGGER"], [238,245,"TRIGGER"], [365,368,"TRIGGER"]]}
{ "text": "The long titles of the sections should also be shorter.  ", "labels": [[9,31,"LOCATION"], [32,38,"MODAL"], [39,43,"TRIGGER"], [47,54,"ACTION"]]}
{ "text": "The introduction goes straight to the point, which is fine, but the work should be framed within a more general scope.  ", "labels": [[4,16,"LOCATION"], [17,30,"ACTION"], [60,63,"TRIGGER"], [73,79,"MODAL"], [83,89,"ACTION"]]}
{ "text": "With the conclusions the same thing happens. The three conclusions are fine, but a more general one should be added, for example on the applicability of the research in the delimitation of the risk of collapse in surface.  ", "labels": [[77,80,"TRIGGER"], [100,106,"MODAL"], [110,115,"ACTION"]]}
{ "text": "The introduction is somewhat confusing. The following should be considered:  ", "labels": [[4,16,"LOCATION"], [29,38,"ACTION"], [54,60,"MODAL"], [64,74,"ACTION"]]}
{ "text": "* The content from line 66 onwards should scroll to a subsection within Methodology.  ", "labels": [[19,26,"LOCATION"], [35,41,"MODAL"], [42,48,"ACTION"]]}
{ "text": "* In the final part of the introduction, the objectives of the manuscript should be stated very explicitly and concisely.  ", "labels": [[9,39,"LOCATION"], [74,80,"MODAL"], [84,90,"ACTION"], [107,110,"TRIGGER"]]}
{ "text": "* Also in the final part of the introduction, a summary of the content of each section should be made, which, without hesitation, will guide the reader.  ", "labels": [[2,6,"TRIGGER"], [14,44,"LOCATION"], [87,93,"MODAL"], [97,101,"ACTION"], [110,117,"TRIGGER"]]}
{ "text": "In Figure 1 the legend is not readable. What is P, R and R? Do the hypsometric colors correspond to the altitude? Where is located the streamflow gauge?  ", "labels": [[3,11,"LOCATION"], [23,29,"ACTION"], [40,44,"TRIGGER"], [53,56,"TRIGGER"], [60,62,"TRIGGER"], [114,119,"TRIGGER"]]}
{ "text": "A physiographic description of the basin defined by the gauging station, catchment area, slope and length of the main channel, altimetric distribution of the catchment, land use and rainfall regime is necessary, etc.  ", "labels": [[95,98,"TRIGGER"], [178,181,"TRIGGER"], [212,215,"TRIGGER"]]}
{ "text": "The selection of extreme values appears to be selected when they exceed a certain threshold. Please, they have to highlight in a more striking way the procedure of the selection of extremes, what is the threshold and why, etc.  ", "labels": [[55,59,"TRIGGER"], [191,195,"TRIGGER"], [213,220,"TRIGGER"], [222,225,"TRIGGER"]]}
{ "text": "The Abstract is very messy and difficult to follow. It takes a lot of effort and dedication to generate a convincing Abstract.  ", "labels": [[4,12,"LOCATION"], [27,30,"TRIGGER"], [55,60,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "The Introduction section is very poor. It is necessary to frame the work in a broader form. This section has to improve substantially. Bibliographic references are scarce, especially in the international area. It is necessary to provide more literature, consult international Journals.  ", "labels": [[4,24,"LOCATION"], [25,37,"ACTION"], [58,63,"ACTION"], [92,104,"LOCATION"], [112,119,"ACTION"], [164,170,"ACTION"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "It is necessary to provide information on the genesis of the rocks analyzed and highlight the differences in the formation environments (sedimentary, metamorphic and plutonic).  ", "labels": [[19,26,"ACTION"], [76,79,"TRIGGER"], [80,89,"ACTION"], [162,165,"TRIGGER"]]}
{ "text": "It is necessary a geological description at the level of geological formations, chronostratigraphy, lithology, structure, training environment, and in each case, diagenetic environment, metamorphic environment (pressure, temperature), magmatic differentiation for the case of granodiorite, etc..  ", "labels": [[144,147,"TRIGGER"], [290,293,"TRIGGER"]]}
{ "text": "Match the format of the section headers. E.g., sections 3.2 to 3.3 have different format.  ", "labels": [[47,57,"LOCATION"], [58,64,"LOCATION"], [65,66,"LOCATION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Effects of Non-stationarity on Flood Frequency Analysis: Case Study of Cheogmichen Watershed in South Korea” by Sang Ug Kim, Minwoo Son, Eun-Sung Chung, and Xiao Yu.  ", "labels": [[46,56,"LOCATION"], [66,81,"LOCATION"], [82,122,"LOCATION"], [124,175,"LOCATION"], [220,223,"TRIGGER"]]}
{ "text": "In this study it is analyzed the effect of considering non-stationary trend models in the prediction of peek-flow for return periods. HEC-HMS model and SWAT software packages are used here.  ", "labels": [[3,13,"LOCATION"], [148,151,"TRIGGER"], [179,183,"ACTION"]]}
{ "text": "The objectives of this study must be stated more clearly, and with a little more development, in the final part of the introduction.  ", "labels": [[29,33,"MODAL"], [37,43,"ACTION"], [58,61,"TRIGGER"], [97,131,"LOCATION"]]}
{ "text": "There is quite a mix between methods and results, for example Line 349 to 354 is in results and should be in the methodological section. There are many more cases like this one.  ", "labels": [[37,40,"TRIGGER"], [62,77,"LOCATION"], [92,95,"TRIGGER"], [96,102,"MODAL"], [103,105,"ACTION"], [113,135,"LOCATION"], [163,167,"TRIGGER"]]}
{ "text": "The Abstract is very messy and difficult to follow. It takes a lot of effort and dedication to generate a convincing Abstract  ", "labels": [[4,12,"LOCATION"], [27,30,"TRIGGER"], [55,60,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "Also in the final part of the Introduction, a brief summary of the content of each section would help the reader to better understand the structure of the paper.  ", "labels": [[0,4,"TRIGGER"], [12,42,"LOCATION"], [91,96,"MODAL"], [97,101,"ACTION"]]}
{ "text": "Figure 6 lack readability. Please do something about it. Also, for a better understanding, some of the legends should be explained in the text.  ", "labels": [[0,8,"LOCATION"], [9,13,"ACTION"], [34,36,"ACTION"], [57,61,"TRIGGER"], [111,117,"MODAL"], [121,130,"ACTION"], [138,142,"LOCATION"]]}
{ "text": "The text does not specify the meaning of some acronyms, for example LULC (Land Use / Land Cover).  ", "labels": [[4,8,"LOCATION"], [9,13,"TRIGGER"], [14,25,"ACTION"]]}
{ "text": "A thorough revision of the language is also necessary. For example line 13 “This research presents explores a simplified…” Line 125 \"\"A analysis ...\"\" and many others.  ", "labels": [[36,38,"ACTION"], [39,43,"TRIGGER"], [44,53,"ACTION"], [67,127,"LOCATION"], [132,144,"LOCATION"], [148,149,"LOCATION"], [151,154,"TRIGGER"]]}
{ "text": "In the analysis carried out in the study area, how the ease of leachate removal and the storage needs are assessed according to the rainfall regime and the natural or artificial evaporation capacity for the removal of leachates.  ", "labels": [[47,50,"TRIGGER"], [80,83,"TRIGGER"], [106,114,"ACTION"], [148,151,"TRIGGER"], [164,166,"TRIGGER"]]}
{ "text": "Geology, starting from line 321. Reference should be made to the role played by the geological barrier due to the permeability and thickness of geological formations.  ", "labels": [[0,7,"LOCATION"], [23,31,"LOCATION"], [43,49,"MODAL"], [53,57,"ACTION"], [127,130,"TRIGGER"]]}
{ "text": "The hydrogeological conditions of the sites play a fundamental role in the possible contamination of aquifers by leachate seepage. This aspect should be taken into account in the methodological analysis and in the discussion.  ", "labels": [[143,149,"MODAL"], [153,158,"ACTION"], [203,206,"TRIGGER"], [214,224,"LOCATION"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "The objective of the research is to argue from the results of the stratigraphic method the reconstruction of the history of bridge construction, its evolution over time, and the identification and assessment of the interventions carried out on the structure to improve the service. The main weakness and critical concerns that I have encountered are the following:  ", "labels": [[36,41,"ACTION"], [170,173,"TRIGGER"], [193,196,"TRIGGER"], [300,303,"TRIGGER"], [322,326,"TRIGGER"]]}
{ "text": "Also in the discussion section, other methodological aspects that could shed light on the investigation of the evolution of bridges should be highlighted, such as petrographic studies, origin of the supplied material (quarries), durability. Also hydrological aspects, as for example on historical floods that may have left their mark on the bridges.  ", "labels": [[0,4,"TRIGGER"], [12,30,"LOCATION"], [61,65,"TRIGGER"], [132,138,"MODAL"], [142,153,"ACTION"], [241,245,"TRIGGER"], [304,308,"TRIGGER"]]}
{ "text": "The main methodology is the stratigraphic analysis of the masonry. There should be a method section where the characteristics of this methodology applied to archaeological purposes in bridges or other buildings are developed.  ", "labels": [[73,79,"MODAL"], [80,82,"ACTION"], [192,194,"TRIGGER"]]}
{ "text": "The conclusions are more a summary of the article than the conclusions themselves. Please make a conclusion list as such.  ", "labels": [[4,15,"LOCATION"], [50,54,"TRIGGER"], [90,94,"ACTION"]]}
{ "text": "In the final part of the introduction, the objectives should be explicitly stated.  ", "labels": [[7,37,"LOCATION"], [54,60,"MODAL"], [75,81,"ACTION"]]}
{ "text": "The final part of the introduction should include a brief summary of each section in order to clarify the content of the paper.  ", "labels": [[4,34,"LOCATION"], [35,41,"MODAL"], [42,49,"ACTION"]]}
{ "text": "In section 3.2 on geology, it is necessary to provide a figure with a longitudinal geological section of the landslide on a suitable scale, with the different geological formations of the substrate, the altered rock layer and the groundwater table.  ", "labels": [[3,12,"LOCATION"], [13,14,"LOCATION"], [46,53,"ACTION"], [222,225,"TRIGGER"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "Authors must report about novelty-based methodology, I cannot see anything emphasizing on this.  ", "labels": [[8,12,"MODAL"], [13,19,"ACTION"], [55,61,"MODAL"], [62,65,"ACTION"]]}
{ "text": "A thorough revision of the language is also necessary.  ", "labels": [[36,38,"ACTION"], [39,43,"TRIGGER"], [44,53,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “A Dynamic Data Structure to Efficiently Find the Points Below a Line and Estimate their Number” by Bart Kuijpers and Peter Z. Revesz, in the modality of research paper.  ", "labels": [[46,56,"LOCATION"], [66,135,"LOCATION"], [136,139,"TRIGGER"], [140,162,"LOCATION"], [180,183,"TRIGGER"]]}
{ "text": "My recommendation is to propose a Major Revision, but in a positive way, because I believe the article has potential. My suggestions are as follows:  ", "labels": [[50,53,"TRIGGER"], [73,80,"TRIGGER"]]}
{ "text": "Abstract: is very short and only focuses on the internal part of the algorithm. You should indicate something about the world around you, for example concrete applications where it would be useful, other similar algorithms, with more or less performance in certain problems, etc.  ", "labels": [[0,8,"LOCATION"], [10,23,"ACTION"], [24,27,"TRIGGER"], [84,90,"MODAL"], [91,99,"ACTION"], [234,236,"TRIGGER"], [275,278,"TRIGGER"]]}
{ "text": "Introduction: The same as in the abstract. Describe potential applications for the algorithm, especially in the world of maps, cartography, databases, geographic information systems, exploitation of information from remote sensors, etc.  ", "labels": [[0,12,"LOCATION"], [33,41,"LOCATION"], [43,51,"ACTION"], [232,235,"TRIGGER"]]}
{ "text": "Algorithm performance: Nothing is said, not compared with similar ones. Something should be said about this.  ", "labels": [[0,21,"LOCATION"], [82,88,"MODAL"], [92,96,"ACTION"]]}
{ "text": "Bibliography: There is very little on the subject of the magazine, perhaps the dates 7 and 8, but nothing more. The authors have to do a broader search.  ", "labels": [[67,74,"TRIGGER"], [79,86,"LOCATION"], [87,90,"TRIGGER"], [91,92,"LOCATION"], [94,97,"TRIGGER"]]}
{ "text": "In line 79-80 it is said that the vertical hydraulic conductivity is greater than the horizontal... Please document this aspect with bibliographical references.  ", "labels": [[3,10,"LOCATION"], [11,13,"LOCATION"], [25,29,"TRIGGER"], [77,81,"TRIGGER"], [107,115,"ACTION"]]}
{ "text": "The relationship between the radius of influence R and the height H must be documented and justified analytically and empirically.  ", "labels": [[51,54,"TRIGGER"], [68,72,"MODAL"], [76,86,"ACTION"], [87,90,"TRIGGER"], [91,100,"ACTION"], [114,117,"TRIGGER"]]}
{ "text": "In Figure 4, all the head lines must be quantitatively characterized. The flow lines must be quantitatively characterized.  ", "labels": [[3,11,"LOCATION"], [32,36,"MODAL"], [55,68,"ACTION"], [85,89,"MODAL"], [108,121,"ACTION"]]}
{ "text": "Boundary condition 3 must be analytically and empirically justified.  ", "labels": [[9,20,"LOCATION"], [21,25,"MODAL"], [29,41,"ACTION"], [42,45,"TRIGGER"], [58,67,"ACTION"]]}
{ "text": "The empirical model (section 3) should be described more clearly, with flowcharts and parameters, and present results more clearly.  ", "labels": [[21,30,"LOCATION"], [32,38,"MODAL"], [42,51,"ACTION"], [82,85,"TRIGGER"], [98,101,"TRIGGER"], [102,109,"ACTION"]]}
{ "text": "The Introduction section is very poor. It is necessary to frame the work in a broader form. This section has to improve substantially. Bibliographic references are scarce, especially in the international area. It is necessary to provide more literature, consult international Journals.  ", "labels": [[4,24,"LOCATION"], [25,37,"ACTION"], [58,63,"ACTION"], [92,104,"LOCATION"], [112,119,"ACTION"], [164,170,"ACTION"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "Although there is extensive literature throughout the document, the introductory part is missing further development that refers to similar works or those related to this paper. In general, the introduction is very poor and it is necessary for the Authors to carry out a more exhaustive bibliographic research.  ", "labels": [[86,96,"ACTION"], [117,121,"TRIGGER"], [146,148,"TRIGGER"], [194,206,"LOCATION"], [207,219,"ACTION"], [220,223,"TRIGGER"], [230,239,"ACTION"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "The final part of the introduction is a geometric and historical description of the well, but this section is not the suitable place for it.  ", "labels": [[4,34,"LOCATION"], [50,53,"TRIGGER"], [90,93,"TRIGGER"], [94,106,"LOCATION"], [110,132,"ACTION"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "A situation of the existing well is necessary, on a country scale and on a regional scale with physiographic characteristics.  ", "labels": [[36,45,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "This article is the second instalment of an article by parts. In the introduction, this second part should be framed within the complete set, providing a brief summary of all the work.  ", "labels": [[0,12,"LOCATION"], [69,81,"LOCATION"], [100,106,"MODAL"], [110,116,"ACTION"]]}
{ "text": "In the final part of the introduction, the objectives should be explicitly stated. Both the objectives of this instalment and the general objectives of the entire series.  ", "labels": [[7,37,"LOCATION"], [54,60,"MODAL"], [75,81,"ACTION"], [122,125,"TRIGGER"]]}
{ "text": "The final part of the introduction should include a brief summary of each section in order to clarify the content of the paper.  ", "labels": [[4,34,"LOCATION"], [35,41,"MODAL"], [42,49,"ACTION"]]}
{ "text": "In the introduction the bibliography does not just frame the work. A greater bibliographic study with related works is needed, especially that frame this paper within a wide scope.  ", "labels": [[7,19,"LOCATION"], [37,41,"TRIGGER"], [51,56,"ACTION"], [119,125,"ACTION"], [138,142,"TRIGGER"]]}
{ "text": "In the statement of the Figures they must be numbered. It currently appears as “\"\"  ", "labels": [[7,31,"LOCATION"], [37,41,"MODAL"], [45,53,"ACTION"]]}
{ "text": "Figures 2, 3, 4 and 5 lack readability. Please do something about it.  ", "labels": [[0,9,"LOCATION"], [11,12,"LOCATION"], [14,15,"LOCATION"], [16,19,"TRIGGER"], [20,21,"LOCATION"], [47,49,"ACTION"]]}
{ "text": "A thorough revision of the language is also necessary.  ", "labels": [[36,38,"ACTION"], [39,43,"TRIGGER"], [44,53,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Seepage and damage evolution characteristics of gas-bearing coal under different cyclic loading–unloading stress paths” by Qingmiao Li, Yunpei Liang and Quanle Zoua.  ", "labels": [[46,56,"LOCATION"], [66,74,"LOCATION"], [75,78,"TRIGGER"], [79,118,"LOCATION"], [119,162,"LOCATION"], [163,186,"LOCATION"], [216,219,"TRIGGER"]]}
{ "text": "In this paper the Authors carry out gas infiltration experiments in crude coal by cyclic loading and unloading in three ways (stepped, increasing and crossed), and five conclusions are obtained.  ", "labels": [[3,13,"LOCATION"], [97,100,"TRIGGER"], [146,149,"TRIGGER"], [160,163,"TRIGGER"]]}
{ "text": "Before publishing the manuscript, it needs to reorganize the content, because in my opinion the main issue is that there is a messy mixture between Methods Results and Discussion, therefore I recommend its publication after considering a Major Revision. My suggestions are these:  ", "labels": [[37,42,"MODAL"], [46,56,"ACTION"], [70,77,"TRIGGER"], [110,114,"TRIGGER"], [164,167,"TRIGGER"], [180,189,"TRIGGER"]]}
{ "text": "1\\. Abstract: In the current version the abstract has a high degree of coincidence with the conclusions. A comprehensive reform of the abstract is necessary so that it represents a summary of the entire document.  ", "labels": [[4,12,"LOCATION"], [41,49,"LOCATION"], [131,143,"LOCATION"], [144,156,"ACTION"], [160,164,"TRIGGER"]]}
{ "text": "A revision of the languagewould be necessary, with shorter paragraphs, because often one loses the sense of the phrase.  ", "labels": [[18,31,"MODAL"], [32,44,"ACTION"], [71,78,"TRIGGER"]]}
{ "text": "There are many acronyms. I recommend a list of acronyms and their meaning and of variables with their meaning and units in the international system.  ", "labels": [[56,59,"TRIGGER"], [74,77,"TRIGGER"], [110,113,"TRIGGER"]]}
{ "text": "The Introduction section is very poor. It is necessary to frame the work in a broader form. This section has to improve substantially. Bibliographic references are scarce, especially in the international area. It is necessary to provide more literature, consult international Journals.  ", "labels": [[4,24,"LOCATION"], [25,37,"ACTION"], [58,63,"ACTION"], [92,104,"LOCATION"], [112,119,"ACTION"], [164,170,"ACTION"]]}
{ "text": "The study domain is not framed on any country-scale map. Perhaps in Figure 1 it could be indicated, or if not, in another figure.  ", "labels": [[17,23,"ACTION"], [57,64,"TRIGGER"], [68,76,"LOCATION"], [80,85,"MODAL"], [89,98,"ACTION"], [100,109,"TRIGGER"]]}
{ "text": "A geological description of the study area is missing, accompanied by a geological map with geological formations, lithology, geological structure and representative sections.  ", "labels": [[43,53,"ACTION"], [147,150,"TRIGGER"]]}
{ "text": "The discussion is very poor, more questions must be addressed, and a greater contrast with previous works.  ", "labels": [[4,14,"LOCATION"], [18,27,"ACTION"], [44,48,"MODAL"], [52,61,"ACTION"], [63,66,"TRIGGER"]]}
{ "text": "This document adopts the similarity theory to study the no pillar gob-side entry retaining (NPGER). The practical and background aspects seem to be interesting, but there is a serious lack in formal aspects and of transmission to the reader. A Major Revision is my recommendation, and below are my suggestions:  ", "labels": [[114,117,"TRIGGER"], [161,164,"TRIGGER"], [207,210,"TRIGGER"], [281,284,"TRIGGER"]]}
{ "text": "1\\. The abstract is very confusing and with it it is impossible to get a summary idea of the complete document. It is necessary to completely rewrite it, making clear what the objectives of the document are  ", "labels": [[8,16,"LOCATION"], [25,34,"ACTION"], [35,38,"TRIGGER"], [53,70,"ACTION"], [142,149,"ACTION"], [167,171,"TRIGGER"]]}
{ "text": "2\\. In the final part of the introduction it would be necessary to state explicitly and clearly the objectives of the work. In addition, a brief description of the structure of the document should be made.  ", "labels": [[7,41,"LOCATION"], [45,50,"MODAL"], [67,72,"ACTION"], [84,87,"TRIGGER"], [190,196,"MODAL"], [200,204,"ACTION"]]}
{ "text": "3\\. A situation map at the country level is provided, but another georeferenced local map is needed.  ", "labels": [[54,57,"TRIGGER"], [93,99,"ACTION"]]}
{ "text": "4\\. A geological map of the environment of the mine is necessary, with geological formations and tectonic structure. It should also be provided with one or two representative sections.  ", "labels": [[52,64,"ACTION"], [93,96,"TRIGGER"], [120,126,"MODAL"], [127,131,"TRIGGER"], [135,143,"ACTION"], [153,155,"TRIGGER"]]}
{ "text": "6\\. A Discussion section is essential, objective, clear, clean and concise, where the two experimental and simulation methodologies are compared.  ", "labels": [[6,24,"LOCATION"], [63,66,"TRIGGER"], [103,106,"TRIGGER"]]}
{ "text": "In the introduction, the literature is sparse. It should be expanded with references to a greater number of works related to the subject, both at a general level and at a closer level. In the paragraph between lines 39 to 47 it is necessary to provide more bibliographic references.  ", "labels": [[7,19,"LOCATION"], [36,45,"ACTION"], [50,56,"MODAL"], [60,68,"ACTION"], [138,142,"TRIGGER"], [162,165,"TRIGGER"], [210,224,"LOCATION"]]}
{ "text": "At the end of the introduction, a brief summary of the content and objective of each section is necessary to help orient the reader.  ", "labels": [[7,30,"LOCATION"], [63,66,"TRIGGER"]]}
{ "text": "In Figures 6 and 7 why the effective precipitation or runoff is not represented.  ", "labels": [[3,12,"LOCATION"], [13,16,"TRIGGER"], [17,18,"LOCATION"], [19,22,"TRIGGER"], [51,53,"TRIGGER"], [61,79,"ACTION"]]}
{ "text": "More information is needed on obtaining IDF curves. Indicate the characteristics of the starting data. Develop The Ghahreman equation.  ", "labels": [[20,26,"ACTION"], [52,60,"ACTION"], [103,110,"ACTION"]]}
{ "text": "The Introduction has hardly improved. The changes are minimal. Very poor literature review. It is necessary to take more dedication to this section.  ", "labels": [[4,16,"LOCATION"], [17,36,"ACTION"], [50,61,"ACTION"], [63,72,"ACTION"], [111,131,"ACTION"], [135,147,"LOCATION"]]}
{ "text": "“It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction.”  ", "labels": [[0,51,"LOCATION"], [52,55,"TRIGGER"], [56,66,"LOCATION"], [67,70,"TRIGGER"], [71,147,"LOCATION"], [148,151,"TRIGGER"], [152,164,"LOCATION"]]}
{ "text": "“In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.”  ", "labels": [[8,38,"LOCATION"], [43,47,"ACTION"]]}
{ "text": "“The structure of the article is not suitable. A discussion section is necessary. Conclusions section is necessary.”  ", "labels": [[30,45,"ACTION"], [60,67,"LOCATION"], [68,80,"ACTION"], [82,104,"LOCATION"], [105,114,"ACTION"]]}
{ "text": "“The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.”  ", "labels": [[5,15,"LOCATION"], [16,22,"MODAL"], [23,32,"ACTION"], [118,121,"TRIGGER"], [122,129,"ACTION"], [159,161,"TRIGGER"], [170,174,"TRIGGER"]]}
{ "text": "More work is needed on this section following my comments from the previous review.  ", "labels": [[13,19,"ACTION"], [23,35,"LOCATION"]]}
{ "text": "It is necessary to define acronyms, preferably the first time they are named and optionally by means of a list.  ", "labels": [[19,25,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "The Abstract is very messy and difficult to follow. It takes a lot of effort and dedication to generate a convincing Abstract  ", "labels": [[4,12,"LOCATION"], [27,30,"TRIGGER"], [55,60,"ACTION"], [77,80,"TRIGGER"]]}
{ "text": "The objectives of the work are not stated in a sufficiently broad and clear way.  ", "labels": [[31,41,"ACTION"], [66,69,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "It would be better to highlight major difficulties and challenges and your original achievements to overcome them in a clearer way in the abstract and introduction  ", "labels": [[3,8,"MODAL"], [22,31,"ACTION"], [51,54,"TRIGGER"], [66,69,"TRIGGER"], [138,146,"LOCATION"], [147,150,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "The graphic content of section 3. Results needs improvements and application through new figures of results.  ", "labels": [[23,32,"LOCATION"], [42,47,"MODAL"], [48,60,"ACTION"], [61,64,"TRIGGER"], [65,76,"ACTION"]]}
{ "text": "The discussion should summarize the manuscript's main finding(s) in the context of the broader scientific literature and address any limitations of the study or results that conflict with other published work.  ", "labels": [[4,14,"LOCATION"], [15,21,"MODAL"], [22,31,"ACTION"], [117,120,"TRIGGER"], [121,128,"ACTION"], [158,160,"TRIGGER"], [169,173,"TRIGGER"]]}
{ "text": "There are no conclusions (another flaw in the structure). Conclusions should be highlighted in a clear and concise way, perhaps through bullet points.  ", "labels": [[70,76,"MODAL"], [80,91,"ACTION"], [103,106,"TRIGGER"], [120,127,"TRIGGER"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Study on Water Suitability of Apple Tree Forest in the 2 Loess Plateau under Climate Change” Xuerui Gao, Ai Wang, Yong Zhao, Xining Zhao, Miao Sun, Junkai Du and Chengcheng Gang.  ", "labels": [[46,56,"LOCATION"], [66,159,"LOCATION"], [225,228,"TRIGGER"]]}
{ "text": "The article is suitable and within the scope of Journal. The objectives are stated clearly, the data are of good quality, but the assumptions and analyses are not too clear, due to the short period of the data series. My recommendation is to accept the article after considering a Major Revision. My suggestions are these:  ", "labels": [[24,27,"TRIGGER"], [122,125,"TRIGGER"], [142,145,"TRIGGER"], [159,162,"ACTION"], [163,166,"TRIGGER"], [167,172,"ACTION"]]}
{ "text": "1\\. Reliability studies are necessary in the results section since they are part of a 24-year time series, perhaps short to ensure climate change effects.  ", "labels": [[24,37,"ACTION"], [45,60,"LOCATION"], [61,66,"TRIGGER"], [107,114,"TRIGGER"]]}
{ "text": "2\\. A sensitivity analysis of the model variables is also necessary, and how they affect the range of variation of the results.  ", "labels": [[50,52,"ACTION"], [53,57,"TRIGGER"], [58,67,"ACTION"], [69,76,"TRIGGER"]]}
{ "text": "3\\. The Discussion section is a mixture of data and results. It is necessary to order the content of this document. For example, all the methodology from line 367 onwards has to be treated previously in a methodological subsection and not in this place.  ", "labels": [[8,26,"LOCATION"], [48,51,"TRIGGER"], [154,162,"LOCATION"], [231,234,"TRIGGER"]]}
{ "text": "4\\. In the results section it is necessary to clearly present the complete water balance model through tables.  ", "labels": [[11,26,"LOCATION"], [54,61,"ACTION"], [103,109,"LOCATION"]]}
{ "text": "If we go into the purely scientific aspects, I propose this title: Numerical modelling of saltwater intrusion in the Rmel-Oulad-Ogbane coastal aquifer (Larache, Morocco) in the climate change and sea-level rise context (2040).  ", "labels": [[0,2,"TRIGGER"], [192,195,"TRIGGER"]]}
{ "text": "There are many acronyms. I recommend a list of acronyms and their meaning and of variables with their meaning and units in the international system.  ", "labels": [[56,59,"TRIGGER"], [74,77,"TRIGGER"], [110,113,"TRIGGER"]]}
{ "text": "The Introduction section is very poor. It is necessary to frame the work in a broader form. This section has to improve substantially. Bibliographic references are scarce, especially in the international arena. It is necessary to provide more literature, consult international Journals.  ", "labels": [[4,24,"LOCATION"], [25,37,"ACTION"], [58,63,"ACTION"], [92,104,"LOCATION"], [112,119,"ACTION"]]}
{ "text": "The study domain (ROOCA) is not framed on any country-scale map. Perhaps in Figure 1 it could be indicated, or if not, in another figure.  ", "labels": [[28,31,"ACTION"], [65,72,"TRIGGER"], [76,84,"LOCATION"], [88,93,"MODAL"], [97,106,"ACTION"], [108,117,"TRIGGER"]]}
{ "text": "Section 3.2 Geological background. These are not results either. Please completely restructure the materials and methods section.  ", "labels": [[0,9,"LOCATION"], [10,11,"LOCATION"], [57,63,"TRIGGER"], [83,94,"ACTION"], [99,108,"LOCATION"], [109,112,"TRIGGER"], [113,128,"LOCATION"]]}
{ "text": "Please use American or OK English, but not both (e.g., in all cases or modeling or modelling)  ", "labels": [[7,10,"ACTION"], [20,22,"TRIGGER"], [35,38,"TRIGGER"], [43,47,"TRIGGER"], [68,70,"TRIGGER"], [80,82,"TRIGGER"]]}
{ "text": "On the proposed approach compared to traditional methods, in lines 228 to 230 little is said. Consequently, it would remain pending to justify, by way of discussion, the advantages of the new method on the establishment of risk levels in a quantifiable way, based on the mathematical relationships between risk, frequency and probability.  ", "labels": [[61,70,"LOCATION"], [74,77,"LOCATION"], [94,106,"TRIGGER"], [111,116,"MODAL"], [322,325,"TRIGGER"]]}
{ "text": "This document investigates the effects of backfill mining on the deformation of the rock massif and on the water influx through the analysis of pressures, tensions, displacements and deformation of the rock mass in the area of filling. It is concluded that the backfill mining is an effective procedure to improve the deformation of the rock and, in turn, the water inflow into the galleries filled with sterile.  ", "labels": [[96,99,"TRIGGER"], [179,182,"TRIGGER"], [252,256,"TRIGGER"], [342,345,"TRIGGER"]]}
{ "text": "In my opinion the article is well structured and can be published in this journal, however I think that some concerns should be taken into account through a Mayor Revision. Here are my suggestions:  ", "labels": [[45,48,"TRIGGER"], [83,90,"TRIGGER"], [99,103,"TRIGGER"], [118,124,"MODAL"], [128,146,"ACTION"]]}
{ "text": "In the introductory section the literature is scarce. It is necessary to develop this part better, so that it better frames the work in a scaled way, from a broad framework of related works to works with objectives similar to the present study.  ", "labels": [[7,27,"LOCATION"], [73,80,"ACTION"], [102,106,"TRIGGER"], [117,123,"ACTION"]]}
{ "text": "In section 2 a broad geological description should be provided. First a regional description (include geological map with formations and structure) and then a local scale description (include geological detail map and geological cross section).  ", "labels": [[3,12,"LOCATION"], [44,50,"MODAL"], [54,62,"ACTION"], [133,136,"TRIGGER"], [148,151,"TRIGGER"], [214,217,"TRIGGER"]]}
{ "text": "The discharge of a river is directly related to the potential for hydroelectric generation. This study calculates the discharge using various hydrological models in order to improve the reliability of predictions of the potential for power generation in ungauged basins. Specifically, the empirical formula of Kajiyama is used, the Two-Parameter monthly water balance model (TPM), which calculates runoff using hydrological and meteorological data, and the tank model, which calculates discharge by modelling the rainfall-runoff process.  ", "labels": [[424,427,"TRIGGER"], [449,452,"TRIGGER"]]}
{ "text": "It seems that this article is the first instalment of an article by parts. In the introduction, this first part should be framed within the complete set, providing a brief summary of all the work.  ", "labels": [[9,13,"TRIGGER"], [82,94,"LOCATION"], [112,118,"MODAL"], [122,128,"ACTION"]]}
{ "text": "In the final part of the introduction, the objectives should be explicitly stated. Both the objectives of this instalment and the general objectives of the entire series.  ", "labels": [[7,37,"LOCATION"], [54,60,"MODAL"], [75,81,"ACTION"], [122,125,"TRIGGER"]]}
{ "text": "The final part of the introduction should include a brief summary of each section in order to clarify the content of the paper.  ", "labels": [[4,34,"LOCATION"], [35,41,"MODAL"], [42,49,"ACTION"]]}
{ "text": "In the introduction the bibliography does not just frame the work. A greater bibliographic study with related works is needed, especially that frame this paper within a wide scope.  ", "labels": [[7,19,"LOCATION"], [37,41,"TRIGGER"], [51,56,"ACTION"], [119,125,"ACTION"], [138,142,"TRIGGER"]]}
{ "text": "In the formulas of section 2.1 it is necessary to provide a range of values of the parameters (both implicit and explicit) of the equations.  ", "labels": [[7,28,"LOCATION"], [29,30,"LOCATION"], [50,57,"ACTION"], [95,99,"TRIGGER"], [109,112,"TRIGGER"]]}
{ "text": "The same happens with section 2.2 where, in addition, the meaning of each performance parameter must be included.  ", "labels": [[22,31,"LOCATION"], [32,33,"LOCATION"], [34,39,"TRIGGER"], [96,100,"MODAL"], [104,112,"ACTION"]]}
{ "text": "Section 2.3, page 220-221. The values adopted for efficiency and utilization rate should be justified, if possible with references to works by other authors.  ", "labels": [[0,9,"LOCATION"], [10,11,"LOCATION"], [13,21,"LOCATION"], [22,25,"LOCATION"], [61,64,"TRIGGER"], [82,88,"MODAL"], [92,101,"ACTION"]]}
{ "text": "A thorough revision of the language is also necessary.  ", "labels": [[36,38,"ACTION"], [39,43,"TRIGGER"], [44,53,"ACTION"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Cheek of Spillway Safety Using State of the Art 3D Model a Case Study of Tendaho Dam Spillway, Ethiopia” by Getnet Kebede Demeke, Dereje Hailu Asfaw and Yilma Seleshi Shiferaw.  ", "labels": [[66,160,"LOCATION"], [162,171,"LOCATION"], [216,219,"TRIGGER"]]}
{ "text": "In this document, a three-dimensional model of the spillway of the Tendaho Dam in Ethiopia is established. The software (Flow 3D) is used, which solves the Navier-Stockes equations by finite volumes, and it is also compared with a classic 1D model (HEC-RAS) that solve the Saint-Venant equations based on integrating the velocity profile and the cross sections, resulting in a one- dimensional model  ", "labels": [[3,16,"LOCATION"], [200,203,"TRIGGER"], [210,214,"TRIGGER"], [258,262,"TRIGGER"], [338,341,"TRIGGER"]]}
{ "text": "2\\. The introduction should give a broader view of the state of the art at the present time. For example, this research uses Eulerian methods that are fixed in control sections, but currently, the research of hydraulic structures are having great success Lagrangian models that are fixed in the movement of fluid particles.  ", "labels": [[8,20,"LOCATION"], [21,27,"MODAL"], [28,32,"ACTION"], [142,146,"TRIGGER"], [160,176,"LOCATION"], [273,277,"TRIGGER"]]}
{ "text": "4\\. The methodological section describes the equations on which the 3D model is based, but another subsection describing the mathematical model 1D and the simplification of the equations that integrates the velocity profile would be necessary.  ", "labels": [[8,30,"LOCATION"], [87,90,"TRIGGER"], [147,150,"TRIGGER"], [187,191,"TRIGGER"], [224,229,"MODAL"], [230,242,"ACTION"]]}
{ "text": "6\\. An explanatory figure with 3D discretization would be good to better understand the 3D model with respect to the cross-sectional 1D profiles.  ", "labels": [[49,54,"MODAL"], [73,83,"ACTION"]]}
{ "text": "7\\. It is expected that in the bend stretch there are relevant differences between the two models. More information about this section would be needed, with a cross-sectional comparison between the two models.  ", "labels": [[19,23,"TRIGGER"], [122,134,"LOCATION"], [135,140,"MODAL"], [144,150,"ACTION"]]}
{ "text": "8\\. Regarding the hydraulic jump, nothing is said. For example, where is it located for different flow rates, how much energy dissipates, differences between models, etc.  ", "labels": [[34,49,"ACTION"], [64,69,"TRIGGER"], [110,113,"TRIGGER"], [166,169,"TRIGGER"]]}
{ "text": "10\\. You must pass the dictionary tool and a language revision. e.g. “turbulunce”, “practicaly”  ", "labels": [[9,13,"MODAL"], [14,18,"ACTION"], [39,42,"TRIGGER"], [69,81,"LOCATION"]]}
{ "text": "The introduction is somewhat confusing. The following should be considered:  ", "labels": [[4,16,"LOCATION"], [29,38,"ACTION"], [54,60,"MODAL"], [64,74,"ACTION"]]}
{ "text": "* The reader does not clearly find the objectives of the investigation. In the final part of the introduction, the objectives of the manuscript should be stated very explicitly and concisely.  ", "labels": [[13,17,"TRIGGER"], [79,109,"LOCATION"], [129,143,"LOCATION"], [144,150,"MODAL"], [154,160,"ACTION"], [177,180,"TRIGGER"]]}
{ "text": "* Also in the final part of the introduction, a summary of the content of each section should be made, which, without hesitation, will guide the reader.  ", "labels": [[2,6,"TRIGGER"], [14,44,"LOCATION"], [87,93,"MODAL"], [97,101,"ACTION"], [110,117,"TRIGGER"]]}
{ "text": "In Figure 1 the legend is not readable. What is P, R and R? Do the hypsometric colors correspond to the altitude? Where is located the streamflow gauge?  ", "labels": [[3,11,"LOCATION"], [23,29,"ACTION"], [40,44,"TRIGGER"], [53,56,"TRIGGER"], [60,62,"TRIGGER"], [114,119,"TRIGGER"]]}
{ "text": "The main objectives of this paper are the determination of sustainability criteria and indicators and the development of an evaluation process for various scenarios for the rehabilitation of mining areas. The lignite core of West Macedonia, a surface mine complex that was the mainstay of Greece's energy sector for more than six decades, is taken as a case study.  ", "labels": [[23,33,"LOCATION"], [83,86,"TRIGGER"], [98,101,"TRIGGER"], [264,268,"TRIGGER"], [321,325,"TRIGGER"]]}
{ "text": "The abstract is very generic. The content of the abstract must refer to the materials and methods used in the research, and to the objectives of the contribution.  ", "labels": [[4,12,"LOCATION"], [13,28,"ACTION"], [49,57,"LOCATION"], [58,62,"MODAL"], [63,68,"ACTION"], [86,89,"TRIGGER"], [120,123,"TRIGGER"]]}
{ "text": "The structure of the document is unconventional. In my opinion it is not necessary to change it, however in the final part of the introduction it is necessary to summarize the content of each section and the purpose.  ", "labels": [[69,82,"ACTION"], [86,92,"ACTION"], [97,104,"TRIGGER"], [108,142,"LOCATION"], [162,171,"ACTION"], [200,203,"TRIGGER"]]}
{ "text": "A general geological description is required (age of the deposits, adjacent geological formations, lithology, geological structure of the mining basins, etc.). Furthermore, specifically for the Western Macedonia Lignite Center, a more detailed geological description would be required, including figures with a geological map and sections.  ", "labels": [[36,44,"ACTION"], [153,156,"TRIGGER"], [160,171,"TRIGGER"], [267,272,"MODAL"], [276,284,"ACTION"], [326,329,"TRIGGER"]]}
{ "text": "The current version of the manuscript lacks discussion. It is necessary to create a new discussion section where the different work issues are addressed.  ", "labels": [[27,37,"LOCATION"], [75,81,"ACTION"], [88,106,"LOCATION"], [143,152,"ACTION"]]}
{ "text": "The content of the conclusions is more a summary than conclusions as such. Concise conclusions need to be drawn, not as a summary. If possible, these conclusions are clearly expressed, for example as key points..  ", "labels": [[19,30,"LOCATION"], [49,53,"TRIGGER"], [95,99,"MODAL"], [106,111,"ACTION"], [113,116,"TRIGGER"], [174,183,"ACTION"]]}
{ "text": "There are many acronyms. I recommend a list of acronyms and their meaning. There are also many variables in equations. Another list of variables with their meaning and units in the international system is recommended  ", "labels": [[56,59,"TRIGGER"], [85,89,"TRIGGER"], [108,117,"LOCATION"], [164,167,"TRIGGER"]]}
{ "text": "The Introduction section is very poor, has a very small size (33 lines). It is necessary to frame the work in a broader form. This section has to improve substantially. Bibliographic references are scarce, especially in the international area. It is necessary to provide more literature, consult international Journals.  ", "labels": [[4,24,"LOCATION"], [25,37,"ACTION"], [92,97,"ACTION"], [126,138,"LOCATION"], [146,153,"ACTION"], [198,204,"ACTION"]]}
{ "text": "It takes a lot of effort to deduce the objectives of the article that are exposed in an unclear and direct way. In the final part of the introduction, the objectives of the work must be explicitly stated.  ", "labels": [[65,69,"TRIGGER"], [96,99,"TRIGGER"], [119,149,"LOCATION"], [178,182,"MODAL"], [197,203,"ACTION"]]}
{ "text": "Also in the final part of the introduction, a brief summary of the object and / or content of each section would be of great help to the reader.  ", "labels": [[0,4,"TRIGGER"], [12,42,"LOCATION"], [74,77,"TRIGGER"], [80,82,"TRIGGER"], [107,112,"MODAL"], [113,129,"ACTION"]]}
{ "text": "The study area (Shanxi Province, China) is very poorly described. First, a general location map is necessary, at the country scale and another regional situation with physiographic characteristics.  ", "labels": [[48,64,"ACTION"], [99,108,"ACTION"], [131,134,"TRIGGER"]]}
{ "text": "In the analysed sandstones, a more extensive petrographic study is necessary where, in addition to the textural analysis, a compositional classification and a description of the size and shape of the grains, proportions of skeleton, matrix, cement and voids is made. Petrographic composition of grains, matrix and cement.  ", "labels": [[67,76,"ACTION"], [77,82,"TRIGGER"], [153,156,"TRIGGER"], [183,186,"TRIGGER"], [248,251,"TRIGGER"], [310,313,"TRIGGER"]]}
{ "text": "Thanks for your kind invitation to review the manuscript entitled “Distribution of Regional Water Flow Field and Prediction of Water Inflow in Mountain Tunnel under Complex Environment” by Zhang Zhiqiang, Xu Peng, Zhang Heng and Zhang Kangjian.  ", "labels": [[46,56,"LOCATION"], [66,108,"LOCATION"], [109,112,"TRIGGER"], [113,185,"LOCATION"], [225,228,"TRIGGER"]]}
{ "text": "This paper analyses the regional water flow field and the prediction of the water inlet in the Daxiangling tunnel, a mountain tunnel located at great depth. Below are my suggestions as a Major Revision:  ", "labels": [[0,10,"LOCATION"], [50,53,"TRIGGER"]]}
{ "text": "1\\. In the final part of the introduction it would be necessary to state explicitly and clearly the objectives of the work. In addition, a brief description of the structure of the document should be made.  ", "labels": [[7,41,"LOCATION"], [45,50,"MODAL"], [67,72,"ACTION"], [84,87,"TRIGGER"], [190,196,"MODAL"], [200,204,"ACTION"]]}
{ "text": "2\\. A situation map is needed at the country level and another georeferenced local map.  ", "labels": [[23,29,"ACTION"], [51,54,"TRIGGER"]]}
{ "text": "3\\. Figure 3 is difficult to understand. Apart from the structural map, a geological map with the geological formations of Table 2 is needed, in colour.  ", "labels": [[4,12,"LOCATION"], [16,39,"ACTION"], [123,130,"LOCATION"], [134,140,"ACTION"]]}
{ "text": "4\\. A geological section is also needed in greater detail, with all the formations through the tunnel.  ", "labels": [[28,32,"TRIGGER"], [33,39,"ACTION"]]}
{ "text": "5\\. In the section \"2.3 Regional Hydrogeological Characteristics\" more information is required:  ", "labels": [[20,21,"LOCATION"], [22,64,"LOCATION"], [86,94,"ACTION"]]}
{ "text": "* Section with the aquifer formations that crosses the tunnel, piezometric levels, etc.  ", "labels": [[38,42,"TRIGGER"], [83,86,"TRIGGER"]]}
{ "text": "6\\. In Figure 4 the terrain surface land is currently gray, but you need to represent the model with all the formations of the legend and the trace of the faults on the terrain surface.  ", "labels": [[7,15,"LOCATION"], [44,58,"ACTION"], [60,63,"TRIGGER"], [68,72,"MODAL"], [76,85,"ACTION"], [134,137,"TRIGGER"]]}
{ "text": "7\\. Please check the structure of the manuscript. For example there are two sections 3.4, \"Cases Setting\" and \"Model Verification\"  ", "labels": [[11,16,"ACTION"], [85,86,"LOCATION"], [87,88,"LOCATION"], [106,109,"TRIGGER"], [111,129,"LOCATION"]]}
{ "text": "8\\. Please, in Figures 7, 8 and 9 represent with a dashed line the trace of the future tunnel.  ", "labels": [[15,24,"LOCATION"], [26,27,"LOCATION"], [28,31,"TRIGGER"], [32,33,"LOCATION"], [34,43,"ACTION"]]}
{ "text": "9\\. The content of the conclusions is very poor. More general conclusions would be necessary, not only about the study case.  ", "labels": [[4,34,"LOCATION"], [35,47,"ACTION"], [74,79,"MODAL"], [83,92,"ACTION"]]}
{ "text": "In my opinion the content of this document is a bit limited, it focuses on a compaction analysis of samples. I think you should be given a broader approach in almost every part of the document. Below are my suggestions that can be addressed as a Moderate to Major Revision:  ", "labels": [[43,59,"ACTION"], [121,127,"MODAL"], [131,136,"ACTION"], [219,223,"TRIGGER"], [224,227,"MODAL"], [231,240,"ACTION"]]}
{ "text": "1\\. In the final part of the introduction, as a summary, it is necessary to describe the structure of the document with a brief indication of the content in each part.  ", "labels": [[11,41,"LOCATION"], [76,84,"ACTION"]]}
{ "text": "4\\. In the introduction and in the conclusions, greater emphasis must be placed on the fields of application of this research.  ", "labels": [[11,23,"LOCATION"], [24,27,"TRIGGER"], [31,46,"LOCATION"], [65,69,"MODAL"], [73,79,"ACTION"]]}
{ "text": "6\\. The content of the conclusions section more general conclusions would be necessary, not only about the experiment.  ", "labels": [[23,42,"LOCATION"], [68,73,"MODAL"], [74,86,"ACTION"], [88,91,"TRIGGER"]]}
{ "text": "It is necessary to take care of the formal aspects, for example figures 19 and 20 are not fully visible; please use subsections numbering.  ", "labels": [[3,5,"ACTION"], [19,28,"ACTION"], [64,74,"LOCATION"], [75,78,"TRIGGER"], [79,81,"LOCATION"], [82,103,"ACTION"], [112,115,"ACTION"]]}
{ "text": "The final part of the Introduction is a brief summary of what is done in this article, but specific objectives are not clearly established.  ", "labels": [[4,34,"LOCATION"], [57,61,"TRIGGER"], [87,90,"TRIGGER"], [115,138,"ACTION"]]}
{ "text": "In the final part of the introduction you need a brief summary of each section to help you better understand the content of the paper.  ", "labels": [[7,37,"LOCATION"], [42,46,"ACTION"]]}
{ "text": "A model calibration section or subsection is required. Referring to reference [14] is not enough. Please make a summary of calibration criteria and techniques.  ", "labels": [[28,30,"TRIGGER"], [45,53,"ACTION"], [68,77,"LOCATION"], [79,81,"LOCATION"], [83,96,"ACTION"], [105,109,"ACTION"], [144,147,"TRIGGER"]]}
{ "text": "It is necessary to highlight new features (it is not enough to say in the introduction that \"\"Models with curved risers have not been studied before as evident from table no 1\"\").  ", "labels": [[19,28,"ACTION"], [49,59,"ACTION"], [74,86,"LOCATION"], [87,91,"TRIGGER"], [93,175,"LOCATION"]]}
{ "text": "The methodology limitation should be mentioned.  ", "labels": [[27,33,"MODAL"], [37,46,"ACTION"]]}
